{"title":"XXX Fucktory The Parody Italian Style XXX DVDRiP x264-PORNOLATiO","uid":8350956,"size":2462208254,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:017cd28c3eaa53492f6f9723769e297fb9988745&amp;dn=XXX+Fucktory+The+Parody+Italian+Style+XXX+DVDRiP+x264-PORNOLATiO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":1,"time":1365344902,"description":"\nStarring\nRocco Siffredi, Kid Jamaica, Abbie Cat, Mike Chapman, Emylia Argan, Lyen Parker, Angel Wicky\nGenre\nAll Sex\nDescription\nXXX Fucktory porn I met Emylia Argan, the true alter ego of Arisa, the Italian singer and star judge of 'X Factor' in Italy. 'XXX Fucktory' is a parody of the four Italian judges on 'X Factor. XXX Fucktory DVD video ' The movie is lots of fun, with funny moments thanks to Oscar Gelanti and Mike Chapman. They are Fantastic comedians. - Rocco SiffrediLegendary porn artiste Rocco Siffredi showcases his crazy talents and huge dick in his latest hard-core feature. 'XXX Fucktory,' a comedic parody of an Italian TV talent competition, brings the famous performer and some well-hung pals together with a bevy of amazingly eager European beauties for goofy fun and filthy encounters that include intense butt sex, anal gaping and forbidden raunch. When busty reporter Abbie Cat and her swinging photographer, the leggy and luscious Lyen Parker, come to interview Rocco, they get more than a magazine puff piece!He devours Abbie's big, sexy ass, and the sultry professional ends up on her knees, her lips wrapped around the director's enormous cock. Lyen joins in and the nasty anal threesome climaxes in a gooey cum swap. In the wild and wacky talent show, performers have theatrical sex in front of an absurd panel of costumed judges. Sweet, all-natural Henessy gets ravaged by Roman pervert Omar Galanti, and hugely stacked cutie Chrissy services sailor boy Bradley. Meanwhile, in the dressing room, black stud Mike Chapman has an interracial interlude with glamorous blonde slut Lana. Voluptuous bombshell Angel Wicky gets sodomized by Kid Jamaica's massive black dick, and bespectacled, shorthaired supermodel Emylia Argan enjoys two separate sessions of ass-pounding pleasure. Filthy action comes hard and fast. If you're looking for the best combination of over-the-top comedy and butt-banging fun, 'XXX Fucktory' is the perfect pornographic diversion!\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=fucktoryf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=fucktoryf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=fucktoryfb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=fucktoryfb.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=plfucktory.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=plfucktory.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:017cd28c3eaa53492f6f9723769e297fb9988745","amp;dn":"XXX+Fucktory+The+Parody+Italian+Style+XXX+DVDRiP+x264-PORNOLATiO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017cd28c3eaa53492f6f9723769e297fb9988745","infoHashBuffer":{"type":"Buffer","data":[1,124,210,140,62,170,83,73,47,111,151,35,118,158,41,127,185,152,135,69]},"announce":[],"urlList":[]}}