{"title":"Alex Jones Show - 2013 Apr 05 FR [sebaygo1]","uid":8346161,"size":68828275,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:030e7fc70f43fd4c65008cb44ee3e5d71a979ead&amp;dn=Alex+Jones+Show+-+2013+Apr+05+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1365207676,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 05 Apr 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Friday, April 5 transmission of The Alex Jones Show, Alex breaks through the wall of lies overthrowing reality as Americans face the fight of their lives, confronting a purge of gun owners and a persecution of returning veterans being disarmed and having their children stolen. He also breaks down the accelerating global economic meltdown, and the escalating North Korean nuclear threat's chillingly close April 10 deadline. On today's show, Alex speaks with former presidential nominee of the Constitution Party, co-author of Romans 13: The True Meaning of Submission and the founder and former pastor of Crossroad Baptist Church in Florida, Chuck Baldwin. Also, Alex welcomes Dr. Greg Dixon, a Baptist pastor who staged a peaceful protest against the IRS's para-military order.\n\nThough not mentioned in the official show description, Alex also talks with Dr. Steve Pieczenik, who is in South Korea, near the DMZ.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:030e7fc70f43fd4c65008cb44ee3e5d71a979ead","amp;dn":"Alex+Jones+Show+-+2013+Apr+05+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030e7fc70f43fd4c65008cb44ee3e5d71a979ead","infoHashBuffer":{"type":"Buffer","data":[3,14,127,199,15,67,253,76,101,0,140,180,78,227,229,215,26,151,158,173]},"announce":[],"urlList":[]}}