{"title":":::* VOX vs OAX *:::","uid":8341420,"size":38357461,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:0470bb654907e600ac5d5f915cfb977cfe04878b&amp;dn=%3A%3A%3A%2A+VOX+vs+OAX+%2A%3A%3A%3A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"narsiscod","files":-1,"time":1365102578,"description":"VOX vs OAX\n\nSave Earth, humanity and destroy the OAX.\nRun, jump and shoot these hideous monsters. Kill them all.\nAs you proceed towards the OAX stronghold, you can collect extra lives to replenish your health, shields to protect yourself and upgrade your fighting skills to kill more effectively.\nShields will enable you to temporarily upgrade your shooting power, swiftly killing every OAX in sight.\nThe OAX can not be killed by jumping on top of them: you have to fire at them. Some OAX cannot be killed, like the Red Egg mine, The best way is to simply avoid, kill, or jump on top of them when you have your shield equipped.\nTry to kill the OAX as quickly as you can, since you will be killed when you get hit by their balls of fire.\nAs you get further into the game, the levels will get harder.\nWho knows... you might just be able to make it to the final fight.\nThe world exists of three stages: Greenox, Bluox and Redox.\nGreenox can be regarded as a stage through which you will run with a smile, easily killing everything in your way.\nIn Bluox, things get serious. Make sure your trigger finger is warmed up. Bluox will bring some nice extra gadgets.\nRedox is a place you do not really want to pass through. Be prepared to face the most vicious OAX of all, including the Great Headox.\nSo far, no one has entered Redox and got back... You have been warned.\nGame updates arrive monthly offering new level &amp; OAX, skills, and character customization options.","torrent":{"xt":"urn:btih:0470bb654907e600ac5d5f915cfb977cfe04878b","amp;dn":"%3A%3A%3A%2A+VOX+vs+OAX+%2A%3A%3A%3A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0470bb654907e600ac5d5f915cfb977cfe04878b","infoHashBuffer":{"type":"Buffer","data":[4,112,187,101,73,7,230,0,172,93,95,145,92,251,151,124,254,4,135,139]},"announce":[],"urlList":[]}}