{"title":"Gordon Neufeld - Making Sense of CounterWill","uid":8234109,"size":1465609618,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:04da3c809ea6098a5aec6ad69e3c2588fc60c4f4&amp;dn=Gordon+Neufeld+-+Making+Sense+of+CounterWill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fusion81","files":6,"time":1362801699,"description":"Dr. Gordon Neufeld - Making Sense of CounterWill\n\n4 one hour presentations\n\nEncoded using AVS Video Converter into m4v files for playback on iPhone, iPad, Android based phones and tablets, Windows, Mac, &amp; Linux\n\nResolution: 640x480\nTotal Bitrate: 835kbps \n\nFrom: http://neufeldinstitute.com/products/dvds\n\nOVERVIEW:\n\nAlthough the counterwill impulse - that instinct that gives rise to resistance and oppositionality in children - is quite normal and even healthy in certain circumstances, its manifestations and impact can be highly disruptive. This basic human reaction is undoubtedly one of the most troublesome, misunderstood and misdiagnosed dynamics in childhood.\n\nIn this four-session course, Dr. Neufeld makes sense of this perplexing phenomenon, including the three dynamics that control its existence and expression, and then presents a three-pronged approach for prevention and intervention.\n\nThis course is highly relevant to variety of audiences:parents of children of any age, educators from preschool to high school, professionals working with delinquent youth, or adults involved with children with severe behaviour problems.\n\n\nCounterwill is a name for the instinctive reaction of a child to resist being controlled. This resistance can take many forms: opposition, negativism, laziness, noncompliance, disrespect, lack of motivation, belligerence, incorrigibility and even antisocial attitudes and actions. It can also express itself in resistance to learning. Despite the multitude of manifestations, the underlying dynamic is deceptively simple - a defensive reaction to perceived control or coercion.\n\nCounterwill is undoubtedly the most misunderstood and misinterpreted dynamic in adult-child relations. The simplicity of the dynamic is in sharp contrast to the trouble it creates - for parents, for teachers, and for anyone dealing with children. It creates a perplexing dilemma in that what is most demanded or expected from a child can become the least likely to be realized.\n\nUnderstanding the role of counterwill in the development process is the key to knowing how to handle it. A three-pronged approach to safely defusing counterwill and to handling the resistant child or adolescent will be discussed.","torrent":{"xt":"urn:btih:04da3c809ea6098a5aec6ad69e3c2588fc60c4f4","amp;dn":"Gordon+Neufeld+-+Making+Sense+of+CounterWill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04da3c809ea6098a5aec6ad69e3c2588fc60c4f4","infoHashBuffer":{"type":"Buffer","data":[4,218,60,128,158,166,9,138,90,236,106,214,158,60,37,136,252,96,196,244]},"announce":[],"urlList":[]}}