{"title":"Jody Williams - 2001 - Return Of A Legend FLAC","uid":8438455,"size":463057885,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:091ac8117cc18e8f7d4b23ec5009d25164eae4b9&amp;dn=Jody+Williams+-+2001+-+Return+Of+A+Legend+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1367699985,"description":"Jody Williams - 2001 - Return Of A Legend\n\nThe boastful title is no exaggeration; this is a welcome return for the classic Chicago blues sideman, who, primarily because of the misfortune of his music being exploited by other musicians, took a self-imposed retirement for nearly 30 years. It's especially rewarding since Williams -- whose work you hear on early Howlin' Wolf, Otis Spann, Bo Diddley, Billy Boy Arnold (who guests here) sides -- hadn't played a lick during that time, keeping his guitar stashed under his bed. He sounds like he never put the instrument away on this album, the first cohesive disc under his own name ever. Aided by comparative youngsters Tinsley Ellis, Ronnie Baker Brooks, and Rusty Zinn, along with a 21-year-old Sean Costello, Williams holds the spotlight like the pro his is. Though well into his sixties when this was recorded in 2001, he sounds remarkably vibrant, completely confident, and totally in his element. Whether reprising past glories like the magnificent instrumental &quot;Moanin' for Molasses&quot; along with Costello (who had revived the tune as the title track to his third release) or &quot;Lucky Lou,&quot; which most blues fans will immediately recognize as the opening to Otis Rush's &quot;All Your Love&quot; (but was nicked from Williams), or writing new originals like the slow blues of &quot;She Found a Fool and Bumped His Head,&quot; the guitarist sounds like he's thrilled to be recording again. That enthusiasm infects the band and pervades this album with a glow all too seldom felt when bluesmen attempt comebacks, especially after laying low as long as Williams has. Between his clean, jazzy yet direct blues style, the remarkably sympathetic band, and wonderfully understated production from Dick Shurman (the man heavily credited with enticing Williams back from obscurity), there are no missteps on this return. It's a tasteful showcase for one of the blues' lesser-known yet classic stars, and will hopefully be the beginning of a new lease on life for Jody Williams. (AllMusic)\n\nTrack listing:\n01. Lucky Lou\n02. Come Over To My House\n03. Lifelong Lover\n04. You May\n05. Moanin' For Molasses\n06. Monkey Business\n07. I'm Coming Back Again\n08. She Found A Fool And Bumped His Head\n09. Jive Spot\n10. Brown Eyes And Big Thighs\n11. Wham Bam Thank You Ma'Am\n12. What You Gonna Do!\n13. Henpecked And Happy\n\nPersonnel:\nKenny Anderson - Trumpet\nBilly Boy Arnold - Guest Artist, Harp, Vocals\nAllen Batts - Organ, Piano\nRonnie Baker Brooks - Guest Artist, Guitar, Guitar (Rhythm)\nSean Costello - Guest Artist, Guitar, Vocals, Voices\nTinsley Ellis - Guest Artist, Guitar, Vocals, VoicesHank Ford Sax (Tenor)\nWillie Henderson - Arranger, Sax (Baritone)\nKenny Smith - Drums\nHarlan Terson - Bass\nJody Williams - Composer, Guitar, Maracas, Primary Artist, Vocals\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:091ac8117cc18e8f7d4b23ec5009d25164eae4b9","amp;dn":"Jody+Williams+-+2001+-+Return+Of+A+Legend+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091ac8117cc18e8f7d4b23ec5009d25164eae4b9","infoHashBuffer":{"type":"Buffer","data":[9,26,200,17,124,193,142,143,125,75,35,236,80,9,210,81,100,234,228,185]},"announce":[],"urlList":[]}}