{"title":"Marc Zvi Brettler - How to Read the Bible (2005)","uid":8467285,"size":19993859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09d19c33ce45fbde387af267b27e52db8667d99c&amp;dn=Marc+Zvi+Brettler+-+How+to+Read+the+Bible+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"workerbee","files":-1,"time":1368388838,"description":"Marc Zvi Brettler - How to Read the Bible (Jewish Publication Society, 2005).\n\nISBN: 9780827607750 | 400 pages | PDF\n\n\nMaster Bible scholar and teacher Marc Brettler argues that today's contemporary readers can only understand the ancient Hebrew Scripture by knowing more about the culture that produced it. And so Brettler unpacks the literary conventions, ideological assumptions, and historical conditions that inform the biblical text and demonstrates how modern critical scholarship and archaeological discoveries shed light on this fascinating and complex literature.\n\nBrettler surveys representative biblical texts from different genres to illustrate how modern scholars have taught us to &quot;read&quot; these texts. Using the &quot;historical-critical method&quot; long popular in academia, he guides us in reading the Bible as it was read in the biblical period, independent of later religious norms and interpretive traditions. Understanding the Bible this way lets us appreciate it as an interesting text that speaks in multiple voices on profound issues.\n\nThis book is the first &quot;Jewishly sensitive&quot; introduction to the historical-critical method. Unlike other introductory texts, the Bible that this book speaks about is the Jewish one -- with the three-part Tanakh arrangement, the sequence of books found in modern printed Hebrew editions, and the chapter and verse enumerations used in most modern Jewish versions of the Bible.  In an afterword, the author discusses how the historical-critical method can help contemporary Jews relate to the Bible as a religious text in a more meaningful way.\n\n\nReviews\n\n&quot;How does a person read the Bible, which is a product of another time and culture, and have it make sense? Brettler, who chairs the department of Near Eastern and Judaic Studies at Brandeis, begins with the complicated web of doctrine, history and myth that is the Hebrew Bible and untangles it until a clear and beautifully drawn picture emerges. His mode of interpretation is the historical-critical method -- reading the text in its historical setting, employing critical methodology to explicate and, when possible, harmonize 'the multiple ancient perceptions of God, preserved in our composite Bible.' After explaining his approach, Brettler takes readers through the historical periods of the Bible, placing the stories in their proper context. He explains, for example, the importance of the Jewish exile in Babylon to the people's view of the prophetic calling. He also discusses the poetic books, their formation and content, and the messages of the prophets. The result is an eye-opening journey through a familiar text, a fresh look at an old story. Written for the beginning reader as well as the scholar, this is an outstanding introduction to the Hebrew Bible and the history of Israel, and should be widely read.&quot; -- Publishers Weekly\n\n&quot;As a professor of biblical studies, I am frequently sent textbooks ... and I often consult academic introductions to the field as well. None of them is as clear, sophisticated, and readable as this book. For Jewish and non-Jewish readers... The book's accomplishments remain stellar.&quot; -- Benjamin D. Sommer\n\n&quot;One of the most exciting Judaic studies books I've read in years.... Brettler's writing is easy and clear enough for non-scholarly readers. I highly recommend his work.&quot; -- The Reporter\n","torrent":{"xt":"urn:btih:09d19c33ce45fbde387af267b27e52db8667d99c","amp;dn":"Marc+Zvi+Brettler+-+How+to+Read+the+Bible+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d19c33ce45fbde387af267b27e52db8667d99c","infoHashBuffer":{"type":"Buffer","data":[9,209,156,51,206,69,251,222,56,122,242,103,178,126,82,219,134,103,217,156]},"announce":[],"urlList":[]}}