{"title":"Denise Giardina - Saints and Villains: A Novel (pdf)","uid":8482658,"size":4463881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cba7e05ac06ceb492b44b7ac12cc2aaa4310c3b&amp;dn=Denise+Giardina+-+Saints+and+Villains%3A+A+Novel+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1368773935,"description":"Denise Giardina - Saints and Villains (Norton, 1998). 487 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate metadata and pagination, etc.\n\n\nNovel about real-life theologian and attempted Hitler-assassin Dietrich Bonhoeffer.\n\n\ndescription:\n\nAn astonishing historical novel in the tradition of Schindler's List--evoking powerfully the danger and heroism of the Nazi resistance.\n\nWhat is the price of acting morally in a time of great evil, when sin and necessity seem twinned? Saints and Villains is a strikingly resonant novel that dramatizes this painful dilemma through the fictional re-creation of the life of Dietrich Bonhoeffer. This emblematic figure risked his life--and finally lost it--through his participation in the failed plot to assassinate Hitler and topple the Nazi regime. In a gripping and sweeping narrative that moves from Berlin to London to New York City, encompassing shattering historical events, clandestine meetings, perilous missions abroad, and eventual imprisonments and death, Denise Giardina brings to life an instance of shining courage in the charnel house that was Europe in the Second World War. A novel that is bold in conception and utterly convincing in its powers of fictional re-creation--a literary event.\n\nReview\n\nSometimes the universe produces a man or woman whose life seems ready-made for fiction: Joan of Arc, for example, or Robert Falcon Scott; John Brown, Martin Luther King Jr., or Jesus of Nazareth. Fiction writers are attracted to larger-than-life personalities and each of the above-mentioned luminaries have indeed appeared in fictional works. Now German theologian Dietrich Bonhoeffer joins their ranks in Denise Giardina's novel Saints and Sinners. Bonhoeffer was born in 1906 in Breslau, Germany. As a young man, he found his vocation in the church, and his theological education took him to England, Spain, and eventually New York, where he spent a year in post-doctoral studies at Union Theological Seminary. He returned to Germany imbued with both the ideals of ecumenicalism and of the Church's responsibility to participate in social and political debate. These ideals, unfortunately, were hardly compatible with the rise of Nazism in the Germany of the '30s and '40s. Bonnhoeffer, true to his beliefs, spoke out against the Nazi regime, and participated in Germany's small Protestant resistance. He was eventually arrested for helping Jews escape to Switzerland and was hanged in the concentration camp in Flossenberg in the waning days of the war.\n\nDenise Giardina knows the stuff of drama when she sees it, and in writing this fictionalized account of Bonhoeffer's life and death, she has drawn heavily on his own writings. Though she sticks to the facts where chronology is concerned, she does introduce three fictional characters into her protagonist's life as a means of illuminating his most private aspects. There is Elisabeth Hildebrant, Bonhoeffer's Jewish lover; Alois Bauer, his Nazi nemesis; and Fred Bishop, a black American seminarian Bonhoeffer meets during his year in New York who serves to politicize and radicalize the German theologian. After reading Saints and Sinners, readers might want to take a look at Bonhoeffer's Letters and Papers from Prison, written during the last two years of his life, for a taste of the real man.\n\n**********\n\nfor Bonhoeffer's book The Cost of Discipleship, see this: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7881582&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7881582&lt;/a&gt;","torrent":{"xt":"urn:btih:0cba7e05ac06ceb492b44b7ac12cc2aaa4310c3b","amp;dn":"Denise+Giardina+-+Saints+and+Villains%3A+A+Novel+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cba7e05ac06ceb492b44b7ac12cc2aaa4310c3b","infoHashBuffer":{"type":"Buffer","data":[12,186,126,5,172,6,206,180,146,180,75,122,193,44,194,170,164,49,12,59]},"announce":[],"urlList":[]}}