{"title":"Evan Parker - 1978 - Monoceros (v0)","uid":8362166,"size":70844239,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0fd703a76ad37121ae30df75a0d80a1bd2f555c1&amp;dn=Evan+Parker+-+1978+-+Monoceros+%28v0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"StyleeDP","files":4,"time":1365660158,"description":"Evan Parker is a virtuosic solo improviser, and these soprano saxophone recordings, made in England in 1978, are perhaps the next best thing to seeing him perform live. Monoceros is divided into four parts, but each is of comparable sonic quality. Parker uses rapid tonguing techniques and circular breathing to create a sound all his own, marked by the simultaneous intonation of multiple notes. When one listens to Evan Parker, one hears a note as well as all the residual tones around it; each breath ends up sounding like a battle between the different registers of the horn. At various times, Parker's saxophone sounds like dolphin speech, electronic tape squeals, or human murmurs; namely, anything but what it actually is. His language on the instrument is essential listening for anyone interested in acoustic experimental music. The Chronoscope CD version of Monoceros distinguishes itself from other Parker solo recitals by its relatively early recording date, excellent sound quality, and probing, anecdotal liner notes courtesy of Steve Lake. ","torrent":{"xt":"urn:btih:0fd703a76ad37121ae30df75a0d80a1bd2f555c1","amp;dn":"Evan+Parker+-+1978+-+Monoceros+%28v0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd703a76ad37121ae30df75a0d80a1bd2f555c1","infoHashBuffer":{"type":"Buffer","data":[15,215,3,167,106,211,113,33,174,48,223,117,160,216,10,27,210,245,85,193]},"announce":[],"urlList":[]}}