{"title":"DeviceBondage---DB-29523 Mz Berlin and Odile WMV","uid":8288601,"size":959278836,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:164f901cd40f8e66f58212f7fe1ea4d026276839&amp;dn=DeviceBondage---DB-29523+Mz+Berlin+and+Odile+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1363990180,"description":"\nMz Berlin vs Odile\n\nMar 22, 2013 - Performers: Mz Berlin and Odile \n\n\nWMV only. MP4 + Pics later.      \n\n\nOdile has been begging for attention from Mz for months. Cunt should be more careful of what she wishes for. Displayed spread eagle in unforgiving restraints she is unable to appreciate her accessibility due to the punishing metal globe encasing her head. Failure seems to be the only option available to cunt as she struggles to deal with the cane, cattle prod and cruel nipple stretching clamps. Her only comfort is the echo of her own screams inside her metal prison. Unable to please Mz she is taunted with tease, denial and harsh verbal humiliation and scolding. So disappointing...\n\nClearly this bitch needs to be schooled. The punishment begins with the position in our second scene. Locked in a kneeling strappado, cunt endures a wooden breast vice, neck and wrist stocks and metal shackles. Feet, ass and cunt are exposed and worked over with precision by Mz, overwhelming cunt. A painful paddling and tight labial clamps push our pretty piece of meat to the edge and painful orgasm denial keeps her right on it.\n\nFinally cunt is bound in a face up modified frog position, held in place with tight leather. A head harness finally allows her to see the torments in store. Wax and nipple clamps get this pain party started. Her ripe pussy exposed for smacking and excruciating flicks before being stuffed full of a hard, steady fist. Cunt is violated and exhausted after the onslaught of orgasms that ensue. Guess she's only good for one thing- being a whore.\n\nScreens   &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29523&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29523&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:164f901cd40f8e66f58212f7fe1ea4d026276839","amp;dn":"DeviceBondage---DB-29523+Mz+Berlin+and+Odile+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"164f901cd40f8e66f58212f7fe1ea4d026276839","infoHashBuffer":{"type":"Buffer","data":[22,79,144,28,212,15,142,102,245,130,18,247,254,30,164,208,38,39,104,57]},"announce":[],"urlList":[]}}