{"title":"Kyoukaisenjou no Horizon SI &amp; SII | Horizon in the Middle of","uid":8463657,"size":9352927041,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:16b00d075450d671b8e772965a4f593a1d515b27&amp;dn=Kyoukaisenjou+no+Horizon+SI+%26amp%3B+SII+%7C+Horizon+in+the+Middle+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"yTSa6","files":-1,"time":1368306565,"description":"Kyoukaisenjou no Horizon SI &amp; SII | Horizon in the Middle of Nowhere S1 &amp; S2 - 720p\n\nKyoukaisenjou no Horizon SI &amp; SII \nHorizon in the Middle of Nowhere S1 &amp; S2 \n720p\n\n\nType: TV\nEpisodes: 26\nStatus: Finished Airing\nAired: Oct 2, 2011 to Sep 30, 2012\nProducers: Sunrise, Sentai FilmworksL\nGenres: Action, Fantasy\nDuration: 24 min. per episode\nRating: R+ - Mild Nudity\nS1 http://myanimelist.net/anime/10456/Kyoukaisenjou_no_Horizon\nS2 http://myanimelist.net/anime/12487/Kyoukaisenjou_no_Horizon_II\nLanguage Japanese\nSubtitles English (Softsubs)\n\n\n\n\nS1\nIn the far future, humans abandon a devastated Earth and traveled to outer space. \nHowever, due to unknown phenomenon that prevents them from traveling into space, \nhumanity returns to Earth only to find it inhospitable except for Japan. \n\nTo accomodate the entire human population, pocket dimensions are created around Japan \nto house in the populace. In order to find a way to return to outer space, the humans \nbegan reenacting human history according to the Holy book Testament. But in the year 1413 \nof the Testament Era, the nations of the pocket dimensions invade and conquer Japan, \ndividing the territory into feudal fiefdoms and forcing the original inhabitants of Japan to leave. \n\nIt is now the year 1648 of the Testament Era, the refugees of Japan now live in the city ship \nMusashi, where it constantly travels around Japan while being watched by the Testament \nUnion, the authority that runs the re-enactment of history. However, rumors of an apocalypse and \nwar begins to spread when the Testament stops revealing what happens next after 1648. \n\nTaking advantage of this situation, Toori Aoi, head of Musashi Ariadust \nAcademy's Supreme Federation and President of the student council, \nleads his fellow classmates to use this opportunity to regain their homeland. \n\n\n\nS2\nTaking advantage of the opportunity that the Mikawa Conflict provides, \nTori and his comrades attempt to rescue Horizon from the Testament Union. \nBut even as the Floating City Musashi speeds towards its next destination, \nthe Floating Island England, Tres Espa?a is preparing its own armada for \nwar against the British Islanders. Now, as the quest of Horizon's emotions \nbuilds to its climax, Tori's new battle is about to begin in the land ruled \nby the Fairy Queen! The reenactment of the history described in the \nmysterious Testament continues as the secret of the Armor of Deadly Sins is \nunleashed in the spectacular second season of Horizon in the Middle of Nowhere! \n\n\n","torrent":{"xt":"urn:btih:16b00d075450d671b8e772965a4f593a1d515b27","amp;dn":"Kyoukaisenjou+no+Horizon+SI+%26amp%3B+SII+%7C+Horizon+in+the+Middle+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b00d075450d671b8e772965a4f593a1d515b27","infoHashBuffer":{"type":"Buffer","data":[22,176,13,7,84,80,214,113,184,231,114,150,90,79,89,58,29,81,91,39]},"announce":[],"urlList":[]}}