{"title":"Coast to Coast AM May 09, 2013 - OBEs and Astral Projection","uid":8460982,"size":56561860,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:172f5ef306e0daebda6becda3a2b30521761a1e7&amp;dn=Coast+to+Coast+AM+May+09%2C+2013+-+OBEs+and+Astral+Projection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pyramid91","files":5,"time":1368230392,"description":"Coast to Coast AM for May 09, 2013. OBEs and Astral Projection\nNote: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nIn the latter half, an expert in out-of-body exploration and the paranormal, \nBob Peterson,\ndiscussed a number of topics including OBEs, astral travel, lucid dreams, and sleep paralysis. Peterson said he's been having OBEs (out-of-body experiences) for over 33 years, and that most OBE authors/researchers agree that we leave our bodies during nightly sleep, and this recharges us with some kind of cosmic energy. However, people aren't aware of this because they're unconscious. &quot;The trick is to become conscious and aware of what these experiences are,&quot; he\nsaid, adding that there are a variety of techniques to induce an OBE. One of his methods, is when approaching the edge of sleep, to visualize a cube spinning, and start to manipulate it, pulling it closer and further away. You visualize the cube coming closer and closer, and eventually let it pull you out of the body, he detailed. More techniques are posted \nhere.\n\n&quot;Many people have reported that their out-of-body experiences have had a level of consciousness and awareness and even perception that far surpasses physical reality,&quot; as well as that of lucid dreams, he commented. Peterson has theorized there are four different OBE states: unconscious + hallucinating = ordinary\ndream, unconscious + objective reality = shared dreams (ala author Robert Moss), conscious + hallucinating = lucid dreams, conscious + objective reality = OBE. You can transition from a lucid dream into an OBE by dispelling the illusion of the dream, he continued. For more, check out Jurgen Ziewe's detailed OBE adventures in his book \nMultidimensional Man,\nas well as Peterson's blog, OBE Outlook.\n\nDangers of Fish Oil\n\nFirst hour guest, \nProf. Brian Peskin\n reported that a number of studies show fish oil is not beneficial to health (a recent  Italian study\n found the supplement does not prevent heart attacks). Fish oil capsules are &quot;non-physiologic&quot; to human beings, providing much more DHA and EPA than one's body would ever create, and can have deleterious effects, he declared. While eating fish is generally healthy, fish oil supplements immediately oxidize in the body, and go rancid, he continued. Instead of fish oil, Peskin suggested people supplement with what he called Parent Essential Oils (PEOs), unadulterated\nforms of essential fats that the body needs. More on PEOs \nhere\n (PDF file). \n\nEconomy &amp; Energy Update\n\nIn the second hour, investment advisor \nCatherine Austin Fitts said there's tremendous divergence in the economy right now. While the tech industry and stock market are doing well, &quot;where I live in Tennessee you might as well think you're in the Great Depression,&quot; she remarked, adding that tremendous liquidity is being provided to the corporate sector but &quot;credit liquidity\non Main Street is very bad.&quot; One bright spot in the energy market is that the cost of solar power now equals that of coal and other grid power, she announced.\n&quot;That is a major tipping point,&quot; she enthused, &quot;and we're about to go into a world where renewable energy starts to be something more than just a dream\nor token thing, but can really make a real difference.&quot; \n\nNews segment guests: \nCapt. Kelly Sweeney,\nRichard C. Hoagland\n\nWebsite(s):\n robertpeterson.org\n\n brianpeskin.com\n solari.com\nBook(s):\n Out-of-Body Experiences: How to Have Them and What to Expect\n Answers Within\n Lessons Out of the Body\n The Hidden Story of Cancer\n","torrent":{"xt":"urn:btih:172f5ef306e0daebda6becda3a2b30521761a1e7","amp;dn":"Coast+to+Coast+AM+May+09%2C+2013+-+OBEs+and+Astral+Projection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"172f5ef306e0daebda6becda3a2b30521761a1e7","infoHashBuffer":{"type":"Buffer","data":[23,47,94,243,6,224,218,235,218,107,236,218,58,43,48,82,23,97,161,231]},"announce":[],"urlList":[]}}