{"title":"Device (2013) [FLAC]","uid":8359917,"size":398732948,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1dae797b600802f9cd538ee64154aac422357830&amp;dn=Device+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1365591946,"description":"\n  Device (2013) [FLAC]\n\n  Released: 2013\n  Duration: 51:58\n  Genre: Pop/Rock\n  Style: Metal, Industrial\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 You Think You Know\n  02 Penance\n  03 Vilify\n  04 Close My Eyes Forever\n  05 Out of Line\n  06 Hunte\n  07 Opinion\n  08 War of Lies\n  09 Haze\n  10 Through It All\n  11 Wish\n  12 A Part of Me\n  13 Recover\n\n  David Draiman pulls out all the stops with the self-titled debut of his industrial metal band, Device, his first project since Disturbed went on hiatus in 2011. Teaming up with Geno Lenardo, formerly of Filter, Device's debut finds them looking back to the blend of massive guitars, synth beds, and pulsing beats that bands like Nine Inch Nails and Die Krupps like to play around, delivering plenty of aggression without losing track of the songs' more rhythmic elements. Adding to the cathartic fun, a slew of guest appearances makes the album feel like an alt-metal barn-raising. Avenged Sevenfold's M. Shadows brings some vocals to &quot;Haze,&quot; while Rage Against the Machine's Tom Morello lends a ripping solo to &quot;Opinion.&quot; The real treat, though, is &quot;Out of Line,&quot; where System of a Down's Serj Tankian and metal legend Geezer Butler drop in on what might be the album's heaviest track. While the guest spots help to spice things up, Draiman and Lenardo certainly don't have any trouble going at it alone on songs like &quot;Hunted,&quot; a kinetic fusion of electronica and metal that really gets at the heart of what Device are doing. Sure, the band isn't exactly reinventing industrial metal, but by looking back instead of just slapping a bunch of dubstep beats over some post-grunge, Device feels like a refreshing throwback instead of a slapdash trend-chaser, making for a fun and heavy debut that shouldn't have any trouble getting its hooks into Disturbed fans.","torrent":{"xt":"urn:btih:1dae797b600802f9cd538ee64154aac422357830","amp;dn":"Device+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dae797b600802f9cd538ee64154aac422357830","infoHashBuffer":{"type":"Buffer","data":[29,174,121,123,96,8,2,249,205,83,142,230,65,84,170,196,34,53,120,48]},"announce":[],"urlList":[]}}