{"title":"Natalie Maines - Mother [2013] [FLAC/WEB]","uid":8458897,"size":294611471,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f1179d17ee96afa9503aab30801b91998470aca&amp;dn=Natalie+Maines+-+Mother+%5B2013%5D+%5BFLAC%2FWEB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":11,"time":1368176698,"description":"Artist: Natalie Maines\nRelease: Mother\nReleased: 2013\nLabel: Columbia Records\nCatalog#: \nFormat: FLAC / Lossless / web\nCountry: USA\nStyle: country,pop,rock,americana\n\n\n\n\n\n01. Without You 3:51\n02. Mother 5:52\n03. Free Life 5:02\n04. Silver Bell 3:00\n05. Lover, You Should've Come Over 7:01\n06. Vein In Vain 4:44\n07. Trained 2:40\n08. Come Cryin' To Me 4:33\n09. I'd Run Away 3:31\n10. Take It On Faith 5:48\n\nAfter the double-platinum Taking the Long Way in 2006, the Dixie Chicks went on hiatus in 2007 after winning three Grammys; they had nothing left to prove. They'd successfully beat back the infamous country radio blacklisting they experienced in 2003 after Natalie Maines' comments about president George W. Bush during the Iraq war. They re-emerged in 2010 with a string of dates with the Eagles and Keith Urban -- the same year that sisters Emily Robison's and Martie Maguire's side band, the Court Yard Hounds, released their self-titled debut. After three years of silence, it's Maines' turn. Mother was co-produced with Ben Harper; he and his band back her on a series of generally polished rock &amp; roll covers and originals. This is a singer's record, not a songwriter's. Maines has made no secret of her preference for rock and R&amp;B over country, and her version of rock is indulged here. The set's best moments are the most unexpected. Her reading of Eddie Vedder's &quot;Without You&quot; finds Maines digging into its lyric and exposing its veins. The title cut by Roger Waters is less spooky and mournful than the original, and contains a tinge of contemporary country in its mix. The set's real gems include her scorching take on Patty Griffin's unreleased &quot;Silver Bell,&quot; which is nearly off the rails in its intensity and features blazing guitars from Harper and Jason Mozersky. The midtempo &quot;Come Cryin to Me&quot; was co-written by the Dixie Chicks and the Jayhawks' Gary Louris. It's a pop/rock number about devotion and unconditional love, and Maines delivers the lyric with an earthy passion and commitment. Her version of Jeff Buckley's &quot;Lover You Should Have Come Over&quot; stretches her throaty contralto and falsetto to the breaking point, and offers a range of expression we've seldom heard from her before. &quot;Vein in Vain&quot; -- is the set's only original tune and only ballad, but it exercises all of her authority as a vocalist in its confessional, broken-hearted narrative. Set closer &quot;Take It on Faith,&quot; with Harper's stinging slide guitar and glorious multi-layered backing chorus, caps it off with a gospel-like affirmation. For all its positives, however, Mother feels a tad uneven. For one, Harper's &quot;Trained,&quot; the set's lone attempt at R&amp;B-rock fusion, falls flat, succeeding at neither. While Maines' singing is the glue that holds everything together, the set's overly polished production and the scattershot curation of the material makes it feel like more like just a haphazard collection of songs than a cohesive album. Maines' fans, won't mind these quibbles, however, and will likely delight in her rock &amp; roll obsession.","torrent":{"xt":"urn:btih:1f1179d17ee96afa9503aab30801b91998470aca","amp;dn":"Natalie+Maines+-+Mother+%5B2013%5D+%5BFLAC%2FWEB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f1179d17ee96afa9503aab30801b91998470aca","infoHashBuffer":{"type":"Buffer","data":[31,17,121,209,126,233,106,250,149,3,170,179,8,1,185,25,152,71,10,202]},"announce":[],"urlList":[]}}