{"title":"Ed Schultz Show with John Nichols (The Nation) - May 16 2013","uid":8483137,"size":48604323,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:20eba1c0164c94a66c8d98e4bbbea473b9de5296&amp;dn=Ed+Schultz+Show+with+John+Nichols+%28The+Nation%29+-+May+16+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"480v","files":3,"time":1368786662,"description":"May 16, 2013\nEd Schultz Show with John Nichols, Washington Correspondent for The Nation Magazine, filling in for Big Eddie!\n\n\nSen. Bernie Sanders, I-VT, joins the 1st hour of Thursday's show to discuss the CBO's report on the deficit.\n\nRep. Gwen Moore, D-WI, joins the 2nd hour of Thursday's show to discuss her vote against the &quot;Pay China First Act.&quot;\n\nRep. Sheila Jackson-Lee, D-TX, joins the 3rd hour of Thursday's show to discuss the Judiciary Committee hearings with AG Holder yesterday.\n\nLori Wallach, Director of Public Citizen's Global Trade Watch, joins the 3rd hour of Thursday's show to discuss the Trans-Pacific Partnership.\n\nWashington's top tax official was fired on Wednesday as President Barack Obama sought to stem a rising tide of criticism over the Internal Revenue Service's improper targeting of conservative groups for special scrutiny. We'll give you the details.\n\nA Republican-controlled panel in the U.S. House of Representatives on Wednesday approved the biggest cuts in food stamps for the poor in a generation and a potentially expensive expansion of federally subsidized crop insurance. We'll talk about it.\n\nThe Justice Department's controversial decision to seize phone records of Associated Press journalists was just one element in a sweeping U.S. government investigation into media leaks about a Yemen-based plot to bomb a U.S. airliner, government officials said on Wednesday. We'll bring you the latest.\n\nPlus your calls and the latest news, Thursday on The Ed Schultz Show. ","torrent":{"xt":"urn:btih:20eba1c0164c94a66c8d98e4bbbea473b9de5296","amp;dn":"Ed+Schultz+Show+with+John+Nichols+%28The+Nation%29+-+May+16+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20eba1c0164c94a66c8d98e4bbbea473b9de5296","infoHashBuffer":{"type":"Buffer","data":[32,235,161,192,22,76,148,166,108,141,152,228,187,190,164,115,185,222,82,150]},"announce":[],"urlList":[]}}