{"title":"Billie Holiday - Me myself and I","uid":8476978,"size":378993140,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2382706991f8112da55a355cf79f4a2ff4d16e67&amp;dn=Billie+Holiday+-+Me+myself+and+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mabritta","files":14,"time":1368638724,"description":"BILLIE HOLlDAY\n\n&quot;Mom and Pop were just a couple of kids when they got married. He was eighteen, she was sixteen and I was three&quot;. Those immortal words open the late Billie Holiday's autobiography and set the scene for a life which was often full of tragedy and unhappiness. Billie Holiday (1915-1959, real name Eleanor Gough) was born in Baltimore on April 7, 1915. Her father played banjo and guitar in Fletcher Henderson's band in the early thirties and it was about this time Billie moved to New York City with her mother. Within a year she was singing in various Harlem clubs and was discovered by critic John Hammond and Benny Goodman. With Goodman she made her record debut in \nNovember 1933, but her international fame began with a series of records she made with Teddy Wilson's orchestra from July 1935 until January 1939. Billie Holiday sang with the bands of Count Basie (1937) and Artie Shaw (1938) before branching out on her own as a single. \nBillie Holiday made a lot of news, most of it bad. She made and spent a lot of money. Her more than two-hundred records constitute a legacy of much that was finest in her era of [jazz, a precious documentation of her own unique art as a singer and of the art of the splendid musicians, both white and black, who worked with her. \nBillie could not read music. Her art might have survived literacy. But it would have gained nothing from it. What she heard in her mind's ear and translated into vocal utterance had nothing to do with the notes on a printed age. Nor has it come down to us in any printed form. Even her records account for only a part of her musical estate, \nDuring her last years many tragedies in her personal life, marked by endless and hopeless battles with narcotic addition, took a heavy toll on her voice, but almost until the end enough of the original quality remained to enable her at times to recapture at least a shred of the glory of her early years. \nThe voice of Billie Holiday was one of the incomparable voices that [jazz produced in the Thirties. At her peak, in that era, Billie Holiday was unquestionably the greatest jazz singer of Item all, an avant-garde artist of her time who polished unremarkable popular songs into iridescent gems. \nHer greatest successes both artistically and commercially included Strange Fruit, Fine and Mellow, and Lover Man. On this compact disc Billie Holiday is at her very best in A. O. &quot;What A Little Moonlight Can Do&quot;, &quot;Miss Brown To You&quot; and &quot;Easy Living&quot;. \n\nContents:\n\nEasy Living                  \nGetting Some Fun out of Life\nYour Were Mine            \nI'll Get by                  \nLet's Call a Heart a Heart   \nMe Myself and I             \nMiss Brown to You            \nPlease Keep Me in Your Dreams\nSpreadin' Rhythm Around      \nThis Year's Kisses           \nTwenty Four Hours a Day      \nWhat a Little Moonlight Can Do","torrent":{"xt":"urn:btih:2382706991f8112da55a355cf79f4a2ff4d16e67","amp;dn":"Billie+Holiday+-+Me+myself+and+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2382706991f8112da55a355cf79f4a2ff4d16e67","infoHashBuffer":{"type":"Buffer","data":[35,130,112,105,145,248,17,45,165,90,53,92,247,159,74,47,244,209,110,103]},"announce":[],"urlList":[]}}