{"title":"Sembunyi - Amukan Azazil","uid":8412963,"size":382481771,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2651a874bdab1f57ac1c42e5833e13c4c15b5e45&amp;dn=Sembunyi+-+Amukan+Azazil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1366964489,"description":"Classification: P13\n\nGenre: Fantasy / Horror\n\nGeneral Release Date: 28 Mar 2013\n\nRunning Time: 1 Hour 37 Minutes\n\nDistributor: Primeworks Studios\n\nCast: Diana Danielle, Remy Ishak, Umie Aida, Sharnaaz Ahmad, Fizo Omar\n\nDirector: Kabir Bhatia\n\nAishah (Diana Danielle) is a young woman living during the Japanese Occupation of Malaya, who, after being knocked unconscious while escaping from the clutches of the Japanese Army, wakes up in a quiet, sleepy village, seemingly untouched by the war. The villagers give her shelter and she begins a new life there. But soon it becomes clear that the village hides other secrets as well. Aishah is haunted by the presence of a young deformed girl whom no one else can see and she discovers that an unknown evil lurks in the surrounding woods nearby the village, an ancient creature that makes the villagers its prey, a demon known only as Azazil. The villagers keep an uneasy peace with the demon through offerings but the moment Aishah enters the village, the attacks inexplicably begin again.\n\n-----------------------------------------------------------------------------------\n\nIt is not every day that you get to see a horror film with more plot twists and turns than you can imagine. \n\nThe plotline was strong and how the story was told with an artistic flair that was also easy to comprehend, although it did have its ridiculous moments. It had an interesting story and background, and it was a fine idea to insert the story into a period-piece background, especially a period piece in Malaysia.\n\nThe Japanese invasion era idea was a really fun idea to extract from by the looks of it. An important and monumental time in Malaysia should be respected and remembered, though the memories and what the Japanese had done were not at all happy times for our country.\n\nThe first thing you notice before anything was the beautiful cinematography and it deserves to be applauded. The scene and the sets were so well done, and it made us appreciate how attractive our country actually is. \n\nIt was fine for the first few scenes because you do not really see the 'creature' at first, which makes you imagine something right out of your nightmares, but it would have been preferred if the 'creature' was not seen at all, even in the end. The mystery of wondering what it looked like was frightening to think about, and it is why horror films are fun. An effective horror film should creep into your mind and not leave it, and the scenes in the beginning did that justice.\n\nThe make-up and prosthetics needed a little more work as it did not really give such a scare after the anticipation it built up to. It was actually pretty hilarious.\n\nAs the story begins to unfold it has its moments where it would creep you out and even blow a bit of your mind.\n\nDiana Danielle was good in her role. It was great seeing her scared beyond her wits most of the time. But who really stole the show was Emelda Rosmilia who played Melur. Even Sara Ali who played the smaller role of Hanum stole the spotlight for a bit. They were great and entertaining and their characters had a certain depth many secondary actors crave for.\n\nIn the men department, Remy Ishak played the leading male role, though he was mostly the silent hero throughout the film. The best male role though was Atan, played by Sharnaaz Ahmad. He was such a joy to watch with his misunderstood sensibility and his arrogant and angry character, which he pulled off really well.\n\nUmie Aida also played a very good version of her role, where you do not know if she was a good character or a bad one. Of course in that sense nobody is either one or the other, but she played her creepy character so well that it makes you wonder if you should trust her and it was exciting.\n\nKabir Bhatia is a terrific director, but something about this film still lacked the punch a horror film like &quot;Susuk&quot;. However, &quot;Sembunyi: Amukan Azazil&quot; is recommended if you love good storytelling and to appreciate the efforts to combine both a good story and cinematography into a horrifying period piece. Bhatia's next film will be anticipated even more.\n\nCinema Online, 15 March 2013","torrent":{"xt":"urn:btih:2651a874bdab1f57ac1c42e5833e13c4c15b5e45","amp;dn":"Sembunyi+-+Amukan+Azazil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2651a874bdab1f57ac1c42e5833e13c4c15b5e45","infoHashBuffer":{"type":"Buffer","data":[38,81,168,116,189,171,31,87,172,28,66,229,131,62,19,196,193,91,94,69]},"announce":[],"urlList":[]}}