{"title":"[F-D]Persona 4 [480P][Dual-Audio]","uid":8480319,"size":2072753311,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:271bbc265ba87210ef11455f060ffbd940edfedd&amp;dn=%5BF-D%5DPersona+4+%5B480P%5D%5BDual-Audio%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vandread9","files":-1,"time":1368719330,"description":"Plot:\nPersona 4 begins on April 11, 2011, with the protagonist, a high school second year, arriving in Inaba to live with the Dojimas, consisting of his uncle Ryotaro and his cousin Nanako, for one year, as his parents are working abroad.[17] Just after his arrival, a TV announcer is found dead, her body hanging from an antenna; Saki Konishi, the high school student who had discovered the body, is later found dead under similar gruesome circumstances.[18] After the protagonist and his friends accidentally enter the TV world, they encounter Teddie, who helps them travel freely between the TV and real worlds.[19] They awaken their Persona abilities, and, realizing that the murders stem from Shadow attacks in the TV world, are able to rescue several would-be victims. Yosuke, Chie, Yukiko, Kanji, Rise and Teddie accept their other selves, which become giant Shadows in the TV world, and join the group as Persona-users. Mitsuo Kubo, a student from another high school who disappears following the death of Kinshiro Morooka, the protagonist's foul-mouthed homeroom teacher, claims credit for the murders; it is eventually learned that Kubo only killed the teacher and played no part in the other murders.[20] Naoto Shirogane, a nationally-renowned &quot;Detective Prince&quot; investigating the case, is also rescued and joins the group, who learn that &quot;he&quot; is actually a girl who assumed a male identity to avoid the police's sexism.\n\nInfo:\nAudio: Eng/Jap\nAubs: Eng\nEps: 25 + Extra\nEncoder: Frozen_Solid [F-D]\nSize/ep: 80MB +/-\nFormat: .mkv\t","torrent":{"xt":"urn:btih:271bbc265ba87210ef11455f060ffbd940edfedd","amp;dn":"%5BF-D%5DPersona+4+%5B480P%5D%5BDual-Audio%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"271bbc265ba87210ef11455f060ffbd940edfedd","infoHashBuffer":{"type":"Buffer","data":[39,27,188,38,91,168,114,16,239,17,69,95,6,15,251,217,64,237,254,221]},"announce":[],"urlList":[]}}