{"title":"Alex Jones Show - 2013 May 15 WE [sebaygo1]","uid":8477818,"size":77501448,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2a188620c948f5d40dca416055532539cb4eeda9&amp;dn=Alex+Jones+Show+-+2013+May+15+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":13,"time":1368659950,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 15 May 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Wednesday, May 15 broadcast of The Alex Jones Show, Alex takes a closer look at the controversies engulfing the White House as details concerning the Benghazi attack, the IRS' targeting of Conservative groups and the Justice Department's AP phone tapping scandal begin to surface. \n\nOn today's show, Alex will detail the various crimes of the Obama administration, and his staff's bumbling attempts to cover them up by claiming ignorance. Alex also breaks down the emerging police state, as witnessed in a viral video shot in California, and why events like this will be the new normal in the Soviet States of America.\n\nAs is apparently standard practice, when Alex has a guest on to promote products sold on InfowarsHealth.com they are not mentioned in the show description. Today it's dentist Corey Gold of Youngevity during the second and third hours.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:2a188620c948f5d40dca416055532539cb4eeda9","amp;dn":"Alex+Jones+Show+-+2013+May+15+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a188620c948f5d40dca416055532539cb4eeda9","infoHashBuffer":{"type":"Buffer","data":[42,24,134,32,201,72,245,212,13,202,65,96,85,83,37,57,203,78,237,169]},"announce":[],"urlList":[]}}