{"title":"Advanced SystemCare Ultimate 6.0.8.289 incl [key]-DarkSider","uid":8457837,"size":76052636,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2aafab97916333a8c85348be643d4216214b63a9&amp;dn=Advanced+SystemCare+Ultimate+6.0.8.289+incl+%5Bkey%5D-DarkSider&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nicolas4412","files":1,"time":1368146308,"description":"Advanced SystemCare Ultimate incorporates top anti-virus capabilities, as well as the already proven comprehensive PC tune-up ability. With its real-time protection against viruses, spyware and phishing attacks, powerful tuning-up and cleaning functionality, Advanced SystemCare Ultimate provides always-on, automated, and all-in-one protection against all kinds of security threats, system slow down, freeze and crash. It ensures PC security, and maintains maximum computer performance automatically without slowing your system down. \n\nFeatures:\n\nBased on Dual engine: the award-winning BitDefender anti-virus engine and IObit anti-malware engine\nDefends against possible virus infection, while speeds up PC rapidly in the meantime\nScans and detects more threats, proven by generally recognized testing organization\nFast scanning ability provides reliable protection against viruses, spyware and other threats\nReal-time and proactive protection detects and stops all kinds of malicious behavior\nRapid virus database updates provides high-level of detection and keep your protection current\nScans and removes spyware and adware with the latest definition\nPrevents spyware, hijackers and malicious websites with Surfing Protection Technology \nMonitors PC performance in Real-time with Performance Monitor\nErases the history of all activities in your computer\nScans and fixes invalid and improper registry entries\nDetects and removes invalid startup items\nSearches and Cleans up unused Windows garbage\nRepairs system configurations, Eliminates System Bottlenecks and Prevents Crashes\nTunes up Windows to improve both system and Internet performance, unleashes the power of your Windows\nAnalyzes and Shows detailed information of hardware and Windows\nTwo Modes to meet all user's needs, finishes all work with one click, Super Easy to Use\n\nWhat's new:\n\n+ Added more Language Files\n+ Added more skins\n+ Improved Antivirus Engine\n+ Improved Real-time Protection\n+ Improved Full Supported for Microsoft Windows 8\n+ Improved Tools in Toolbox\n+ Improved User Interface\n+ Updated Database for Driver Manager\n+ Updated Database for Privacy Sweep\n+ Fixed General bugs","torrent":{"xt":"urn:btih:2aafab97916333a8c85348be643d4216214b63a9","amp;dn":"Advanced+SystemCare+Ultimate+6.0.8.289+incl+%5Bkey%5D-DarkSider","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aafab97916333a8c85348be643d4216214b63a9","infoHashBuffer":{"type":"Buffer","data":[42,175,171,151,145,99,51,168,200,83,72,190,100,61,66,22,33,75,99,169]},"announce":[],"urlList":[]}}