{"title":"Silverback Attack 2_XXX_AtomicGdog.mp4","uid":8303840,"size":3723556119,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2cecc2e7b8b4cde3998f2d49eed08572866243f6&amp;dn=Silverback+Attack+2_XXX_AtomicGdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KidAtomic","files":1,"time":1364321671,"description":"\nSilverback Attack 2: Join these black studs, led by Lexington Steele, as they take on a bevy of white beauties. Watch them jam their giant c*cks into every hole imaginable. And they do it all just for you.\n\n    Scene 1. Gianna Michaels, Jean-Claude Batiste, Lexington Steele\n    Scene 2. Keeani Lei, Brian Pumper\n    Scene 3. Bailey Monroe, Brian Pumper, Lexington Steele\n    Scene 4. Ricki White, Brian Pumper, Lexington Steele\n    Scene 5. Velicity Von, Lexington Steele\n\nMercenary Pictures\n\nGenre: Interracial\n\nDirector: Lexington Steele\n\nCast: Gianna, Lexington Steele, Jean Claude Batiste, Keeani Lei, Brian Pumper, Bailey Monroe, Rikki White, Velicity Von\n\nLength: 190 minutes\n\nDate of Production: 6/12/2006 \n\nActresses:\n    Bailey Monroe (as Baily Monroe) [Facial IR]\n    Gianna Michaels (as Gianna) [Facial IR]\n    Keeani Lei [Anal Facial]\n    Ricki White [Facial IR]\n    Velicity Von [Facial IR]\n\nActors:\n    Brian Pumper\n    Jean-Claude Batiste\n    Lexington Steele\n\nBody of Review: Lexington Steele started up Mercenary Pictures as a means to gain more control over his work and reap the financial benefits as a result. There are many male performer turned directors in the industry these days but Lex has shown that when he gets it right, he really gets it right. He doesn't direct as many movies these days as he used to, handling business affairs and performing in his company's movies taking up most of his free time but his strengths and weaknesses were clearly on display with his latest effort, a title called Silverback Attack 2. The term Silverback actually comes from a group of gorillas that sport a streak of white hair after they become teenagers and reports are that they have really small penises so I'm guessing that Lex had something non-sexual in mind when he came up with the term. That said, the movie started and ended strongly, with three really well done scenes of interracial action. If you're still interested, and you should be, here's a quick look at the scenes, noting that no condoms were used at all: \n\n\n","torrent":{"xt":"urn:btih:2cecc2e7b8b4cde3998f2d49eed08572866243f6","amp;dn":"Silverback+Attack+2_XXX_AtomicGdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cecc2e7b8b4cde3998f2d49eed08572866243f6","infoHashBuffer":{"type":"Buffer","data":[44,236,194,231,184,180,205,227,153,143,45,73,238,208,133,114,134,98,67,246]},"announce":[],"urlList":[]}}