{"title":"HISTORY OF POP AND ROCK MUSIC - part 487","uid":8280485,"size":106039555,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3511e56886d0299c36303f0b866fd7b644dfafd9&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+487&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1363818788,"description":"\n             \n\n                       PART  489\n\n\n\n          PAT BRADY &amp; SONS OF THE PIONEERS  - Lazy Days  (1947)\n\n\n\n     &quot;Lazy Days&quot; is a song written by Tim Spencer and performed by Pat Brady and Sons of the Pioneers (1947).\n\n     The Sons of the Pioneers are one of America's earliest Western singing groups whose classic recordings set a new standard for performers of Western music.Known for the high quality of their vocal performances, musicianship, and songwriting, they produced finely-crafted and innovative recordings that have inspired many Western music performers and remained popular through the years. Since 1933, through many changes in membership, the Sons of the Pioneers have remained one of the longest-surviving country music vocal groups in history.\n     In October of 1931, Bob Nolan answered an ad in the Los Angeles Herald that read: &quot;YODELER, for old time act to travel. Tenor preferred.&quot; He met a man named Leonard Frank Slye, who had dropped the 'e' from his family name and introduced himself as Len Sly. (Leonard Frank Slye aka Len Sly would later change his name to 'Roy Rogers') Rogers was a member of a group called the Rocky Mountaineers. Not comfortable singing solo, he wanted to hire another singer for the act and had placed the ad that led to meeting Bob Nolan. The latter left the group in the summer of 1932 and Rogers placed another ad in the newspaper classifieds for a replacement for a baritone who could yodel. Vern Spencer, better known as Tim Spencer, got the job. A third singer in the group was a singer named Bill &quot;Slumber&quot; Nichols, whom Rogers had hired to create a harmonizing-and-yodeling trio. The trio of Rogers, Spencer and Nichols left the Rocky Mountaineers to join Benny Nawahi and His International Cowboys.  During that time, fiddle player Hugh Farr joined the group, adding a bass voice to the group's vocal arrangements. He also sang lead on some songs. Later that year, the &quot;Pioneers Trio&quot; became the &quot;Sons of the Pioneers&quot; through a radio station announcer's chance remark. Asked why he'd changed their name, the announcer said they were too young to have been pioneers, but that they could be sons of pioneers. The name was received well and fit the group, who were no longer a trio.\n\n","torrent":{"xt":"urn:btih:3511e56886d0299c36303f0b866fd7b644dfafd9","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+487","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3511e56886d0299c36303f0b866fd7b644dfafd9","infoHashBuffer":{"type":"Buffer","data":[53,17,229,104,134,208,41,156,54,48,63,11,134,111,215,182,68,223,175,217]},"announce":[],"urlList":[]}}