{"title":"NubileFilms - Silhoutte (2013) [1080p].mp4","uid":8357707,"size":1086373256,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:37d30a501bd5fca0826a5b6d4324f2d62bdf65c6&amp;dn=NubileFilms+-+Silhoutte+%282013%29+%5B1080p%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FluxXxu","files":-1,"time":1365535991,"description":"\nNubileFilms - Silhoutte (2013) [1080p].mp4\n\n\nScreens\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=97374216196058268847.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=97374216196058268847.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=97232462557036054971.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=97232462557036054971.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=97781561083003859952.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=97781561083003859952.jpg&lt;/a&gt;\n\n\nCast\n\nTeal Conrad, Tyler Nixon\n\n\nDescription\n\n&quot;Teal Conrad offers her man Tyler Nixon the ultimate treat when she seats him on the couch and then steps behind frosted glass doors so that he can watch her shimmy and shake as she changes into some stunning lingerie.\nTaking a few moments to sway in silhouette behind the doors, Teal finally opens them and struts into the room. A woman on a mission of seduction, she climbs onto the couch opposite her man and continues her sexy sway with a huge smile as she watches Tyler touching his huge erection through his underwear.\nAt last Teal gives in to her man's need and tugs him over to the other couch. Springing him free from the confines of his boxer briefs, Teal leans forward and eagerly wraps her warm lips around his pulsing member as she licks and sucks with obvious pleasure.\nWhen Taylor can't take the sweet torture of his woman's lips anymore, he leans forward to palm the bounty of Teal's breasts in his hands. She releases them from her bra, freeing them for Taylor's mouth to seek out her hard sensitive nipples as she continues to suckle at his cock.\nNeeding to give his girl the pleasure she deserves, Taylor lies down and urges Teal to straddle his chest with her landing strip pussy positioned evenly with his mouth. From that position Taylor can feast on the sweet slickness between Teal's legs while reaching up to massage her voluptuous breasts.\nInsatiable for the feel of her man's long dick in her mouth, Teal returns to her interrupted blow job as her beau cups his hand to the heat of her dripping pussy and rubs her clit.\nFinally, the lovers come together as Teal sinks down on her man's dick facing away. A few frenzied pumps warm them both up before they switch to the spooning position. The angle in that position is perfect to send Teal over the edge of her orgasm. Her moans fill the room and her inner walls milk Taylor to the edge of his endurance.\nRising to his knees above his woman, Taylor showers Teal's face, breasts, and belly with the essence of his passion. She laps at the liquid, licking her fingers clean and enjoying the taste of her man's cum as he cleans off her creamy pussy with a few last sweeps of his tongue before climbing up her body to cuddle close.&quot;\n\n\nTags\n\nHardcore, XxX, Hot, Cumshot, Blowjob, Brunette\n\n\nResolution\n\n1920x1080\n  \n\nDuration\n\n00:20:43\n   \n\t\nSize\n\n1.01 GB\n      \n~~~~~~~~~~~~~~~~\n\nHave Some Fun at: &lt;a href=&quot; http://whois4fun.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://whois4fun.com/&lt;/a&gt;  ;)\n","torrent":{"xt":"urn:btih:37d30a501bd5fca0826a5b6d4324f2d62bdf65c6","amp;dn":"NubileFilms+-+Silhoutte+%282013%29+%5B1080p%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d30a501bd5fca0826a5b6d4324f2d62bdf65c6","infoHashBuffer":{"type":"Buffer","data":[55,211,10,80,27,213,252,160,130,106,91,109,67,36,242,214,43,223,101,198]},"announce":[],"urlList":[]}}