{"title":"[eFukt] siterip funny strange lulz porn videos part 11","uid":8376625,"size":544195866,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:38a47a68922f5c2e459dca2989021584f6580391&amp;dn=%5BeFukt%5D+siterip+funny+strange+lulz+porn+videos+part+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"joew771","files":34,"time":1366067492,"description":"This is a siterip of Efukt.com (4-6-2013). Videos only. Part 11 of 14.\n\nFrom encyclopediadramatica - eFukt is a gigantic collection of pics and vids of NSFW content which are placed in a variety of lulzy categories such as: amateur, amputee, Asians, bizarre, bloopers, bums, busted, drunk, educational, exhibitionist, famous, fighting, fisting, gallery, gape, groped, hookers, insertion, loose, lulz, modifications, orgasms, painal, parody, penis, plugs, premature, prolapse, public, retards, strippers, TV, vintage, violent, voyeur, and yukka. After looking at such an impressive list of categories one question immediately pops into the head of any right minded individual; who the fuck wants to look at any of that? While prima facie it does seem to be a bit on the extreme side, when compared to all the furry, adult baby, guro, cp, scat, and plushie porn out there, eFukt really doesn't seem all that bad. Either that, or it is all fucked and anyone who tries to defend it is a sick morally depraved fuck.\n\n\nPart 11 - 34 Videos\n\n\nUnfortunately the videos are not categorized after ripping and I wasn't about to redo that for over 700 vids, so they will be a random selection in alpha-numeric order.","torrent":{"xt":"urn:btih:38a47a68922f5c2e459dca2989021584f6580391","amp;dn":"%5BeFukt%5D+siterip+funny+strange+lulz+porn+videos+part+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a47a68922f5c2e459dca2989021584f6580391","infoHashBuffer":{"type":"Buffer","data":[56,164,122,104,146,47,92,46,69,157,202,41,137,2,21,132,246,88,3,145]},"announce":[],"urlList":[]}}