{"title":"god of war iso rip ps2","uid":8414639,"size":8522792960,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3ac985706a6661cb30a884eac43be4dd21475a9c&amp;dn=god+of+war+iso+rip+ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"udaredme","files":-1,"time":1367001157,"description":"Unleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures - including Medusa, Cyclops, the Hydra and more, while solving intricate puzzles in breathtaking environments. Driven by pure revenge, nothing can stop Kratos from achieving absolution.\n\nKratos is an ex-Spartan soldier possessed by Ares, the God of War. Over time, he becomes the most vicious warrior in Ancient Greece to a point where he can't bare it anymore and sets out on a journey to kill Ares. However, the only way to destroy Ares is to find Pandora's Box, which is located in a temple that's perched upon a hill and guarded by traps, puzzles, enemies, etc. The story is told as a flashback of three weeks prior to where the opening movie starts and then sets the stage for the game...\n\n* GOD OF WAR introduces a brutal slice of life set in the mythological Greek era. Players can live according to their own nature. Even if it is by brute force. \n\n* Defining the next evolution in gaming, GOD OF WAR presents an explosive gameplay mix: raw melee combat fused with traps, stunts and story driven puzzles. \n\n* Huge collection of moves: players can swing on ropes, scale mountain cliffs, swim through rivers, slide down zip lines. \n\n* GOD OF WAR delivers an extensive combat system based on uniquely linking combos for a myriad of fighting moves. Take the combat in air, take out a number of enemies at once, and utilize &quot;context sensitive moves&quot; - moves that in particular situations, allow you to grab, kick or throw an enemy. \n\n* Kratos' main weapons are two blades - one attached to each arm by a long chain that wraps around his arm. This allows for both short-range and long-range attacks. \n\n* Encounter some of the greatest mythological beasts and enemies: Medusa, Cyclops, Minotaur, Harpies and more. \n\n* Unleash an innovative magic system that grants the power of gods and monsters: use Medusa's head to freeze your enemies, strike them with Zeus' thunderbolt, cut them down with Ares' blades. \n\n* Explore and unravel numerous puzzles that range from simpler lever pulls to the most mind-bending, sadistic twisters around. \n\n* Players can experience a real-time world of interactivity: soldiers battle and die, structures fall to the ground, and the dark, violent world of Greek mythology comes to life in gory detail. \n\n* From the creative director of the Twisted Metal and Twisted Metal:Black franchise.\n\ndirect dvd rip using imgburn","torrent":{"xt":"urn:btih:3ac985706a6661cb30a884eac43be4dd21475a9c","amp;dn":"god+of+war+iso+rip+ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ac985706a6661cb30a884eac43be4dd21475a9c","infoHashBuffer":{"type":"Buffer","data":[58,201,133,112,106,102,97,203,48,168,132,234,196,59,228,221,33,71,90,156]},"announce":[],"urlList":[]}}