{"title":"PSP on PS3 Volume 3 [51-75]","uid":8439675,"size":18306121485,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3c762d8b0ce174f75369de2081c33083d80673cd&amp;dn=PSP+on+PS3+Volume+3+%5B51-75%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ps3links","files":33,"time":1367732791,"description":"*******************************************************************************\n                              PSP on PS3 Vol. 03 [51-75] \n*******************************************************************************\n\n------------------------------------------------------------------------------- \n                              General Information \n------------------------------------------------------------------------------- \nType.................: PSP PKG Files (ReActPSN NOT Req.) \nPlatform.............: Playstation 3 \nCompression Format...: None \nImage Format.........: ISO &amp; PSN PKG's \nImage Created with...: PC &amp; PSN \nReader...............: PSP UMD Optical Drive \nSource...............: UMD Disc &amp; PSN PKG Files \n\n\n------------------------------------------------------------------------------- \n                              Post Information \n------------------------------------------------------------------------------- \nPosted by............: atreyu187 (http://www.blackcats-games.net/) \nPosted on............: 4/29/2013 \n\n------------------------------------------------------------------------------- \n                                Release Notes \n------------------------------------------------------------------------------- \nHere we go with another pack for you, some are Remasters and others are Mini's \nbut all work 100%. I tried to use PSP Remastering with all new games first due to \nthe upscaling and full screen capabilites but if that failed I fell back on the old method \nas it would make some games work unlike the PSP Remaster PKG's. I am trying to do \nas many request as you guys send to me but some simply do not work. So I will keep \ntrying as methods evole so if you don't see the game you want now there are 73 now \nyou can play (two were repacked but now fixed, sorry. One had to be PSP Remastered \nthe other was a hiccup making the last PKG file) anyhow I am well on my way to pack 4 \nso it will be up soon after this completes. So Till then I hope you enjoy!! Also on Remasters \nopen your XMB duuring a game and go to settings and choose &quot;Game Settings&quot; and turn \non the upscaling as well as full screen for Remasters. \n\nAll retain their orignal Content ID given by Sony so \nno conflicts will happen during install and all can be installed at one time no \nproblems there. Saves work on all games and test using Rebug 4.30.2 CFW but will \nwork on any CFW. \n\nI have been told however 3.41 &amp; 3.55 saves will not work but \nany 4.XX CFW they will save just fine. I made this pack as I had so many I \nneeded to catch up and by the time this is seeded hopefull the next pack will be \nready. So stick with it and you will get some great games to play on your PS3. \n\nAkiba's Trip \nAlien Syndrome \nAliens vs. Predator Requiem \nBurnout Dominator \nCastlevania The Dracula X Chronicles \nCorpse Party Book of Shadows \nGradius Collection \nHellboy The Science of Evil \nLumines II \nLunar Silver Star Harmony \nMetal Gear AC!D 2 (3D enabled and working, all proper patches applied) \nMetal Gear AC!D \nMetal Gear Solid Portable OPS Plus \nMonster Hunter Freedom Unite (Ad-Hoc and camera mapped to d-pad. \nPrinny Can I Really be the Hero \nPrinny 2 - Operation Panties Dood! \nPuzzle Bobble Pocket \nRatchet &amp; Clank Size Matters \nSamurai Warriors - State of War \nStar Ocean First Departure v2 (Confirmed working now, sorry for the last one) \nStar Wars The Force Unleashed \nTales of the World - Radiant Mythology v2 (Saves working now) \nThe 3rd Birthday \nTom Clancys End War \nUltimate Ghosts'n Goblins \n\n\n                                              ##Notes## \n\nMonster Hunter Freedom Unite - PSN PKG used so freeze is gone and all  extra downloads/quest work from game even on banned PS3. \n\nThe 3rd Birthday - Loads to a black screen simply press X button to get into the game and works flawlessly after that. \n\nUltimate Ghosts'n Goblins - PSP Remasterd to fix the 2x speed that happens when converted to a Mini. If anything it runs a tad slow and removing full screen option seems to help get it &quot;just right&quot; but hopefully the updates to the emulators in 4,41 OFW will fix a lot of these issues and maybe we could even &quot;inject&quot; into a 4.30 etc. CFW like we do to disable Cinavia. \n\nStar Ocean First Departure - Still a &quot;Mini&quot; but it does not black screen anymore. Not sure what happened with the re-PKG'ing after updating art as it worked on my PS3. Anyhow it is fixed and working now. \n\nMetal Gear Games - All have 3D enabled \n\nTales of the World - Radiant Mythology - Was converted from a &quot;Mini&quot; to a &quot;Remaster&quot; version and now it works all the way through after character creation. \n\nCastlevania The Dracula X Chronicles - Has GFX glitching when the level loading signs come up but during actual game play it run flawless. So nothing will effect the actual game play at all. Just a little lag like on the Dreamcast with Echelon's rip of Skies of Arcadia if anyone recalls that. I have also patched out the border when Symphony of the Night is unlocked. This is how it was programmed but thanks to helpful folks I wa sable to patch it out. Now if it works I do not know as I have not had enough time to make it that far but I did decrypt and and re-sign the binary so in theory the two other unlockable games should be just fine. \n","torrent":{"xt":"urn:btih:3c762d8b0ce174f75369de2081c33083d80673cd","amp;dn":"PSP+on+PS3+Volume+3+%5B51-75%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c762d8b0ce174f75369de2081c33083d80673cd","infoHashBuffer":{"type":"Buffer","data":[60,118,45,139,12,225,116,247,83,105,222,32,129,195,48,131,216,6,115,205]},"announce":[],"urlList":[]}}