{"title":"Descent XXX DVDRiP","uid":8396324,"size":1726740422,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:3efb398c03335d63ef7b8e12551dc7ac691dab0c&amp;dn=Descent+XXX+DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1366579349,"description":"Category Feature \n  \nDirector Dana Vespoli \nStarring Dana Vespoli, James Deen, Mark Davis, Alec Knight, Danny Wylde, Karlie Montana \n\nShe Is Dying To Understand What Is Happening To Her!\n\nA Marriage In Jeopardy... Bizzare Home Break-In... And One Depraved Sexual Encounter After Another As Dana Descends Into Madness!\n\nFor her third production as an Evil Angel director, veteran performer Dana Vespoli stars in 'Descent,' a feature-length, hard-core psychological mystery that spins a spooky yet erotic tale of a gorgeous housewife's spiral into madness. With her husband out of town, Dana is shocked to receive an anonymous disc which reveals that someone has been trespassing in her home, and spying on her.\n\nSeeking help and distraction from various people -a pair of strange detectives (Danny Wylde and Alec Knight), a handsome yet erratic artist (James Deen), a beautiful and spectral redhead (Karlie Montana) and a cold, intense and unpredictable therapist (Mark Davis) - Dana experiences one depraved sexual encounter after another, unable to tell what is a dream, what is hallucination... and who is a genuine threat. Lost in her own subconscious, her marriage in jeopardy, the beautiful woman struggles to put the pieces of her life in place and make sense of her taboo compulsions before the horrifying truth is revealed. Once again, this interesting director has created a fragmentary but alluring world of twisted dominance and submission. Dana's nasty, passion-filled porn scenes within the context of a coherent story suck the viewer into the maelstrom of her character's broken mind. 'Descent' shows what terrible secrets lie in the dark! \n\n\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=dascentf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=dascentf.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=dascentfb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=dascentfb.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=pldescentm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=pldescentm.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3efb398c03335d63ef7b8e12551dc7ac691dab0c","amp;dn":"Descent+XXX+DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3efb398c03335d63ef7b8e12551dc7ac691dab0c","infoHashBuffer":{"type":"Buffer","data":[62,251,57,140,3,51,93,99,239,123,142,18,85,29,199,172,105,29,171,12]},"announce":[],"urlList":[]}}