{"title":"POtHS - End Times - 30 - Truth Can Be Scary","uid":8252634,"size":9768775984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3feb3fa488ad91d0383dee369dcba643555e060c&amp;dn=POtHS+-+End+Times+-+30+-+Truth+Can+Be+Scary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"POtHS11","files":-1,"time":1363192837,"description":"\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nEnd Times\n\nVolume 030\n\nTruth Can Be Scary\n\n\n\n\nPOtHS - End Times - 30 - Truth Can Be Scary\n\n\nPOtHS Comment:    The test is coming for all of us.\n\nDescription\n\nTruth can be scary - test your knowledge of reality:\nPosted from Youtube user gloomylunatic. His description is as follows...\n\nWell guess what? People will SEE THE TRUTH. They will KNOW THE TRUTH.They will BE HEARD. The victims will ECHO for ETERNITY and HAUNT those who have HARMED THEM and KILLED THEM. This abuse must be countered. There is always balance in nature. For every action, there is a reaction.\n\nWhen will YOU draw YOUR LINE?\nPlease don't confuse the message here. I'm not saying to go harm Police Officers or Law Enforcement Agents.... NO, that is NOT the message by ANY MEANS.\n\nHOWEVER -- there is MUCH TRUTH to the fact that Police Officers and many, many Law Enforcement Officers are NOT QUALIFIED to even be in the position they are in with the authority and virtual power to cause physical harm to another human being just because they &quot;feel like it&quot; (it's the Police Officer's discretion which usually supersedes everything else unfortunately, so to let sociopath's and emotionally desensitized human beings become Police Officer's is ABSURD and unreasonable at the very least)\n\nI know that there are good men and women out there... but these men and women have voices, no? Please don't be silent anymore. Please wake up. Please speak up. Please let the truth be known, WHEREVER YOU ARE, and WHOEVER YOU ARE, and DO NOT let the social stigma or societal hierarchy change the decisions you would make in any given situation. Do not let your integrity become jeopardized because of your own fear or apathy/ignorance.\n\nIt is time we all become responsible men and women. It is time we all make the changes necessary in our own lives to reflect the well-being and positive change that this society needs in each and every single one of us, individually. Look in the mirror. The change starts at home, it starts with YOU... and me.\n\nGod bless all of you\n\nI pray for those involved in this video, both Law Enforcement, Public Sheeple and Victim alike... God will prevail, Truth will prevail\n\nPeace&amp;Love\nChris\n---------------------------------------------------------------------------------\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:3feb3fa488ad91d0383dee369dcba643555e060c","amp;dn":"POtHS+-+End+Times+-+30+-+Truth+Can+Be+Scary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3feb3fa488ad91d0383dee369dcba643555e060c","infoHashBuffer":{"type":"Buffer","data":[63,235,63,164,136,173,145,208,56,61,238,54,157,203,166,67,85,94,6,12]},"announce":[],"urlList":[]}}