{"title":"Bread - Series 6","uid":8444137,"size":4323905848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:40c7d9a6a5b17e4258e55300700e4b027ab94a84&amp;dn=Bread+-+Series+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"theleatherjacket","files":11,"time":1367848442,"description":"Bread is a British television sitcom, written by Carla Lane, produced by the BBC and screened on BBC1 from 1 May 1986 to 3 November 1991.\n\nThe series focused on the devoutly-Catholic and extended Boswell family of Liverpool, in the district of Dingle, led by its matriarch Nellie (Jean Boht) through a number of ups and downs as they tried to make their way through life in Thatcher's Britain with no visible means of support.\n\nNellie's feckless and estranged husband, Freddie (Ronald Forfar), left her for another woman known as 'Lilo Lill' (Eileen Pollock). Her children Joey, Jack, Adrian, Aveline and Billy continued to live in the family home in Kelsall Street and contributed money to the central family fund, largely through benefit fraud and the sale of stolen goods.\n\nBread is a really difficult series to obtain, all episodes are recorded from television broadcasts, quality is very good, just don't expect DVD perfection.  Enjoy, and please remember if you do enjoy this series let others enjoy it by seeding back, that way I can upload other series and everybody wins !!!\n\nSeed it or lose it! :-))\n\nSeries 6 (1990)\n1. First Broadcast: Sun 9th September 1990\n\nWhen Leonora arrives to take up residence in Billy's former home, Jack and Adrian are besotted but Billy is horrified as Julie neglected to tell him she was moving. Shifty returns full of apologies and gets a final chance from the family. To add to an eventful 24 hours, their pet dog Mongi has died and the family buries its ashes - then Aveline is rushed to hospital as she is about to give birth...\n\n2. First Broadcast: Sun 16th September 1990\n\nA double celebration for the Boswells when Aveline brings her baby home in style and Leonora offers Adrian a job as her chauffeur - even though it is Jack she is interested in. Lilo Lill returns to put another spanner in the Boswell works, just as Joey sets his dad up in business.\n\n3. First Broadcast: Sun 23rd September 1990\n\nTo everyone's amazement Shifty has got a job as a bus driver, while Jack and Leonora's relationship is growing ever stronger. Lilo Lill confides in Freddie that she is suffering an incurable illness and hasn't got long to live!\n\n4. First Broadcast: Sun 30th September 1990\n\nShifty tries to convince Martina that he has changed but ends up taking his passengers on an unexpected trip. Adrian and Jack are both competing for Leonora's affections...\n\n5. First Broadcast: Sun 7th October 1990\n\nBilly's van has been broken in to and Joey's new shop has been vandalised - the culprits are unknown. Aveline has decided to leave Oswald and return home to her mother, with her baby. The sibling rivalry over Leonora comes to a head when Jack tells Adrian that he has slept with her...\n\n6. First Broadcast: Sun 14th October 1990\n\nBilly's constant complaint of being neglected forces him to make an important decision. Nellie makes plans to go away with Derek, Shifty pledges his love to Martina and Lilo Lill plans a candlelit supper for Freddie.\n\n7. First Broadcast: Sun 21st October 1990\n\nNellie is away with her &quot;friend&quot; and finding the experience very uncomfortable; meanwhile, the family try to manage without her. Her absence becomes more acute when Grandad has a fall and breaks his leg!\n\n8. First Broadcast: Sun 28th October 1990\n\nAdrian has become successful and his new found wealth has gone to his head and the distribution of his unwanted goods is not altogether welcome. Grandad worries about his lost pigeon but a visit from the sister of an old acquaintance brings hope for the future for both he and Adrian.\n\n9. First Broadcast: Sun 4th November 1990\n\nAdrian's new relationship with Irene has already hit a snag, Nellie becomes more concerned about Grandad when he starts becoming forgetful and Aveline is given a reality check by her agent.\n\n10. First Broadcast: Sun 11th November 1990\n\nGrandad's visit to the doctor takes an unexpected turn when he makes a break for freedom in a taxi and heads for Wales. Jack is having doubts about moving in with Leonora, and Aveline shares a romantic lunch with Oswald.\n\nChristmas Special: Tue 25th December 1990\n\nMrs Boswell finds that little things can cause enormous problems when all should be peace and tranquility.","torrent":{"xt":"urn:btih:40c7d9a6a5b17e4258e55300700e4b027ab94a84","amp;dn":"Bread+-+Series+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40c7d9a6a5b17e4258e55300700e4b027ab94a84","infoHashBuffer":{"type":"Buffer","data":[64,199,217,166,165,177,126,66,88,229,83,0,112,14,75,2,122,185,74,132]},"announce":[],"urlList":[]}}