{"title":"Dhooli (1954) Bengali VCD_No Subs [DDR]","uid":8460255,"size":1586148164,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41f2b233c3a2c9c0066c2dacaba8086c3cae7d2e&amp;dn=Dhooli+%281954%29+Bengali+VCD_No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1368215808,"description":"Dhooli (1954) Bengali VCD_No Subs [DDR]\n\nCast: Suchitra Sen, Mala Sinha, Prashanta Kumar, Chhabi Biswas, Pahadi Sanyal, Bikash Roy, Anil Chatterjee, Jahar Ray, Ajit Chatterjee, Nitish Mukherjee, Tapati Ghosh, Mani Srimani\n\nDirector:Pinakhi Mukherjee\nProducer:Aj Production\nMusic Director: Rajen Sarkar\nLyrics: Bimal Chandra Ghosh, Pranab Ray, Pandit Bhushan, Narayan Gangopadhyay, Malik\nPlayback Singers:-  AT Kanan, Hemanta Mukherjee, Dhananjaya Bhattacharya, Prasun Bandyopadhyay, Pratima Bandyopadhyay, Juthika Ray\nMusicians: Keramatullah Khan, Sagiruddin Ahmed, Himangshu Biswas, Jiten Santra, Kshirod Natta, Balram Pathak\n\nSongs are included in MP3s\nDhooli (1954) Bengali 00. Title Music and Screen Credits, Rajen Sarkar\nDhooli (1954) Bengali 01. Trinayani Durga 1, Dhananjoy Bhattacharjee, Bimal Ghosh, Rajen Sarkar\nDhooli (1954) Bengali 02. Song Unknown\nDhooli (1954) Bengali 03. Bhanganer Teere Ghar, Dhananjay Bhattacherjee, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 04.O Amar Bangla Mago, Hemanta Mukhopadhyay,Narayan Gangopadhyay, Rajen Sarkar\nDhooli (1954) Bengali 05. Jibon Je Re Swapnamaya, Hemanta Mukhopadhyay, Bimal Ghosh, Rajen Sarkar\nDhooli (1954) Bengali 06. Short Song\nDhooli (1954) Bengali 07. Song Unknown\nDhooli (1954) Bengali 08. Ganga Dhara\nDhooli (1954) Bengali 09. Ningadia Neel Shaari, Pratima Banerjee, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 10. Ei Jamunari Teere, Juthika Roy, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 11. Bhanganer Teere Ghar, Dhananjay Bhattacherjee, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 12. Short Song\t\nDhooli (1954) Bengali 13. Chupi Chupi Elo Ke, Pratima Banerjee, Prasun Banerjee, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 14. Song Unknown\nDhooli (1954) Bengali 15. Ras Ke Bhare More Nain, Pratima Bandopadhyay, PT. Bhushan, Rajen Sarkar\nDhooli (1954) Bengali 16. Trinayani Durga 2, Dhananjay Bhattacherjee, Bimal Ghosh, Rajen Sarkar\nDhooli (1954) Bengali 17. Bhanganer Tire Ghar, Dhananjay Bhattacherjee, Pronab Roy, Rajen Sarkar\nDhooli (1954) Bengali 18. Short Verse\nDhooli (1954) Bengali 19. Prabhuji Jeevan- Jyot Jagao, Juthika Roy, PT. Bhushan, Rajen Sarkar\nDhooli (1954) Bengali 20. Song Unknown\n\nSYNOPSIS:- Dhooli (1954) Bengali\nParashar (Prashant Kumar), the young grandson of a drummer (low caste), is a talented singer who is taken in as a student by a renowned singer Ganesh. When Ganesh finds him extraordinarily talented, he sends him on to his own Guru (Pahadi Sanyal). Thee Parashar also meets the Guru's daughter, Minati (Suchitra Sen). When guruji dies, Parashar starts to take care of Minu and also gives music lessons.\n\nOne day, in a competition they come across Ratri (Mala Sinha) daughter of a rich man and also a talented singer. She is no match for Minu. Enter her fiance (Bikash Ray), the schemer. Who hits upon the idea to hire Parashar as the teacher of Ratri, and then manipulates so that Parashar becomes the full time, live-in teacher. Minu is left behind as Parashar blinded by Ratri's talent takes on the job.\n\nOne day, Ratri, against the advice of Parashar takes part in a competition in Delhi, and corners glory. The two have a fight and Ratri insults Parashar for being a low caste man with vaulting ambition. She has no further need for him amd he is thrown out into the streets. He falls desperately ill. Minati gets to know and rushes there and tries to save him with all the love and resources at her command...\n\nComments by Debpk\nAs a film this one has very little to recommend it. The lead actor is wooden in the extreme (he disappeared without a trace subsequently), the story line is implausible and the dialogues are stilted. The characters are cardbord pieces - entirely predictable and stereotyped. Almost the only actor who does some justice to his role is Bikash Ray, as the wily fiance. Even Suchitra Sen's acting is only passable as is Mala Sinha's. The characters and settings are theatrical, as was common in the early 50's.\n\nWhat sets it apart is the music and the songs. This movie contains some of the greatest short classical pieces ever recorded for Bangla films. Just take a look at the galaxy of musicians that lent their voices or played instruments in this film..\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1119 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Bengali\nRunTime: 2:25:02\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: 2:25:02","torrent":{"xt":"urn:btih:41f2b233c3a2c9c0066c2dacaba8086c3cae7d2e","amp;dn":"Dhooli+%281954%29+Bengali+VCD_No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f2b233c3a2c9c0066c2dacaba8086c3cae7d2e","infoHashBuffer":{"type":"Buffer","data":[65,242,178,51,195,162,201,192,6,108,45,172,171,168,8,108,60,174,125,46]},"announce":[],"urlList":[]}}