{"title":"coast to coast am May 03, 2013 National Magic and Predictions","uid":8438465,"size":55646866,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:42b354d98549b4816483ee4052f8088800c94571&amp;dn=coast+to+coast+am+May+03%2C+2013+National+Magic+and+Predictions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1367700115,"description":"Coast to Coast AM for May 03, 2013.  Natural Magic and Predictions\nNote: This ese are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow for: May 03, 2013\nShow description:\nGuests:\nEvelyn Paglini, Open Lines\nIn the first half, natural magic practitioner Dr. Evelyn Paglin offered predictions, insights on the state of the world and tools for coping with the wild days ahead. The Earth is entering into a mini-cleansing cycle, Paglini revealed, noting deadly heat waves, uncontrollable fires, massive flooding, and intense tornado activity among the extreme events to strike the planet. Strong earthquakes will hit Mexico and California as well as Japan, where it could affect the already battered Fukushima Daiichi nuclear plant, she forecasted. Paglini senses a massive earthquake around Israel in the not so distant future. There will be so much destruction from these events that rebuilding efforts will contribute to improving the economy, she said. \nRegarding troublesome world events, Paglini sees North Korean leader Kim Jong-un as a grave threat to the United States and predicted the nation will someday have to face him in a violent confrontation. He is a dangerous man and North Koreas is a dangerous country, she warned. For those listeners struggling in the current financially difficult times with money and employment, Paglini suggested relying on instincts which may be prodding them to move to a different city or start a new business endeavor. She recommended utilizing meditation, visualization and ritual to break negative cycles and increase good fortune. \nAccording to Paglini, meditation and visualization can be used to dissolve anxiety and stress, and even physically heal the body. She detailed a simple ritual that uses cleansing oil and a black image candle, in the gender of the subject, to remove negativity, a green image candle to invite in prosperity, and Kamyar oil and the herb Angelica to attract wealth and success. Paglini also outlined a technique for communicating with spirit guides, in which a person imagines a cozy room with three chairs and a cylindrical elevator. When the subject pushes a button on the chair, the elevator will open to reveal a female spirit guide, she explained, noting how the guide is to be welcomed and seated. One simply pushes the button again to receive the male spirit guided, she noted. \nGeorge hosted live Open Lines in the third hour of the program. The final hour featured a replay from January 20, 2012. \nNews segment guests: Michael Shedlock / Peter Breggin\nWebsite(s):\nmysticalblend.com","torrent":{"xt":"urn:btih:42b354d98549b4816483ee4052f8088800c94571","amp;dn":"coast+to+coast+am+May+03%2C+2013+National+Magic+and+Predictions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b354d98549b4816483ee4052f8088800c94571","infoHashBuffer":{"type":"Buffer","data":[66,179,84,217,133,73,180,129,100,131,238,64,82,248,8,136,0,201,69,113]},"announce":[],"urlList":[]}}