{"title":"FakeAgent - Betty c1078_betty_720 ImgZilla","uid":8334045,"size":437281599,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:42b58a1acf5f2a11221ea5863f5a2fd8fa9f07ed&amp;dn=+FakeAgent+-+Betty+c1078_betty_720+ImgZilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":-1,"time":1364943834,"description":"Size: 437281599 bytes (417.02 MiB), duration: 00:29:48, avg.bitrate: 1957 kb/s\nAudio: aac, 44100 Hz, mono (eng)\nVideo: h264, yuv420p, 1280x720, 25.00 fps\n\n\nBetty (30 mins) As soon as I clapped eyes on the timid student Betty, I knew this girl was young and inexperienced. She was a first timer and it became strikingly obvious that she out of her depth in this casting. In her email she came across quite well, however, in person, she was so shy I had trouble coaxing any sort of response by her. I don't think she really knew what she was letting herself in for. On the plus side, she had a great body and a lovely set of perky tits, but unfortunately didn't know how to work them to her advantage. Her pussy was freshly shaven that. I tried to put my dick in it, but she wasn't having any of it, adamant that a blowjob was the maximum. I couldn't get the girl to loosen up, she was so uptight the entire time she was in my office. Her socks were a bit of a turn off. Don't get me wrong, I don't mind if they're wearing a sexy pair like Adrian did in a previous casting, but a shitty little purple ones are not sexy at all. Her lack of experience shone through when it came to sucking cock, her reaction when I told her to spit on my dick was one of disgust. It was becoming more and more clear this girl was not cut out for anything in this business. At the end of the blowjob she said she would swallow my spunk, but, the girl reacted as if she'd never had a mouthful of spunk in her life. I don't think I' d get her work even if I could. Betty take my advice go looking for something other than the adult industry.","torrent":{"xt":"urn:btih:42b58a1acf5f2a11221ea5863f5a2fd8fa9f07ed","amp;dn":"+FakeAgent+-+Betty+c1078_betty_720+ImgZilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b58a1acf5f2a11221ea5863f5a2fd8fa9f07ed","infoHashBuffer":{"type":"Buffer","data":[66,181,138,26,207,95,42,17,34,30,165,134,63,90,47,216,250,159,7,237]},"announce":[],"urlList":[]}}