{"title":"Tyree in... Period Piece a film by Giuseppe Andrews.avi","uid":8391179,"size":831439302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4401b3feb3ea403b70955c71b3dc732298145477&amp;dn=Tyree+in...+Period+Piece+a+film+by+Giuseppe+Andrews.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"metanoia3000","files":1,"time":1366432170,"description":"Watching it expecting anything at all is not advised. you must dive into this movie blindfolded, and remain blindfolded for 80 minutes. i'm going to jump to my own conclusion and say there's no message, nor a theme one may glean from this film. however, i can say it is honestly unlike anything i've seen. it always takes me a few scenes to re-acclimate to his home video style. but it isn't as if Andrews is trying to make a polished indie - he holds a consistent aesthetic between technique and content, subject and style. he makes you cringe unlike any cringe you've experienced from any other movie (no gore nor sex can top what he achieves).\n\nAndrews will obviously never reach &quot;the masses&quot; with this style, and most of those he reaches will dismiss it as &quot;shock for shock's sake&quot;. however, he is making movies unlike anyone ever has before; he takes his audience on a no-class induced hallucination through motel room and trailers, unveiling a world utterly no one is accustomed to. now there's something to be said for that. he's taken &quot;verite&quot; to a whole new level, and all the founding fathers of cinema would, after a series of gag reflexes, applaud him enthusiastically (except Orson Welles, cause he lacked a sense of humor....), but that's just one man's opinion.","torrent":{"xt":"urn:btih:4401b3feb3ea403b70955c71b3dc732298145477","amp;dn":"Tyree+in...+Period+Piece+a+film+by+Giuseppe+Andrews.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4401b3feb3ea403b70955c71b3dc732298145477","infoHashBuffer":{"type":"Buffer","data":[68,1,179,254,179,234,64,59,112,149,92,113,179,220,115,34,152,20,84,119]},"announce":[],"urlList":[]}}