{"title":"Gordon Giltrap - Visionary [1976][FLAC]","uid":8469793,"size":362014203,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44a6c9eae795707e45ac41285d30c1d921b46d4f&amp;dn=Gordon+Giltrap+-+Visionary+%5B1976%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":26,"time":1368458527,"description":"Artist: Gordon Giltrap\nRelease: Visionary\nReleased: 1976\nLabel: La Cooka Ratcha\nCatalog#: LCVP114CD \nFormat: FLAC / Lossless / Cue\n[color=blue]Country: UK\nStyle: rock\n\n\n\n\n\nAwakening\nRobes and Crowns\nFrom the Four Winds\nLucifer's Cage\nRevelation\nThe Price of Experience\nThe Dance of Albion\nThe Tyger\nThe Ecchoing Green\nLondon\nNight\nOn Wings of Hope\nJerusalem\nVisionary (original version)\n\nThis album was originally released as around 30 mins worth(that's up to and including track 11, and I urge you to treat that as a separate entity.\nDon't ignore the extra tracks, we'll return there in a moment. The idea was a series of music paintings exploring the canvasses of William Blake. If that sounds heavy, it could get worse-most intellectuals(not me-haven't the IQ!!) consider Blake to be the only true English mystic ever!\n\nHowever, Giltrap's guitar virtuosity and the accompanying sweeping synth-dominated backing tracks hit the right note every time. Each track is memorable, they run together somehow AND every time you are guided into the start of the spiritual pathways in Blake's forest of the night.\n\nThere, however, you are left with your imagination and that's how the album succeeds-giving you the initial insight only, but enough of a key to want to unlock the door further. Unlike Huxley, you won't need mescalin to do it, either!\n\nThe extra tracks, the first 2 anyway, just don't fit in with the album as it originated or developed. This is in spite of Jerusalem being the first thing most people associate now with Blake, or perhaps because of it-don't always do the obvious, it seems-and here Giltrap was correct.\n\nBut beware the last track-Visionary original version WILL surprise you-it's the Unplugged/Acoustic/Demo version of the whole resulting album. See how refined the raw seed became before it blossomed into the final work of genius that is Visionary and realise this is one of the most criminally-neglected albums of all time.\n\nI'm not one for encouraging criminality in any body, so please salve your conscience, end this scandal, buy it now and savour genius again.","torrent":{"xt":"urn:btih:44a6c9eae795707e45ac41285d30c1d921b46d4f","amp;dn":"Gordon+Giltrap+-+Visionary+%5B1976%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a6c9eae795707e45ac41285d30c1d921b46d4f","infoHashBuffer":{"type":"Buffer","data":[68,166,201,234,231,149,112,126,69,172,65,40,93,48,193,217,33,180,109,79]},"announce":[],"urlList":[]}}