{"title":"torrent - avril lavigne music star app for android","uid":8289068,"size":5430884,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:4844ec949d3290a7d5d1a4be766db6f29947c4c4&amp;dn=torrent+-+avril+lavigne+music+star+app+for+android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"danevans","files":2,"time":1363999512,"description":"Avril Lavigne Wallpapers app is free, featuring a lot more than android wallpapers:\n- Hot Photos of Avril Lavigne to Save or Set As Wallpaper!\n- Option to share the photos viasend to friends (or use eMail &amp; other social sharing apps, messaging)\n- Access to a daily updated beautiful Avril Lavigne photos gallery online\n- Direct access to Avril Lavigne music and interview videos online, so you stay up to date with her latest hit songs, comments &amp; tour info!\n- Picture Memory Game with photos of Avril and symbols that are her signature, see if you can finish it faster than your friends or family!\n\nEnjoy the app, share with friends and please give it a good rating (and provide feedback for next update we release :) .\n\nIn case you stumbled upon this app, here's a short bio/wiki about her:\nAvril Lavigne was born in Belleville, Ontario, Canada on September 27, 1984. At 16, she moved to Manhattan and began work on her debut album. She dropped out of high school after \n\nthe 11th grade when she secured a record deal. When Avril was almost 18, she released &quot;Complicated&quot; from her debut album titled: &quot;Let Go,&quot; which went 6x platinum. As a petite \n\nskater girl from a small town, Avril has shown she is independent, full of confidence and determination, providing a good combination to make &quot;Complicated&quot; and Avril a musical \n\nbreakthrough. &quot;Complicated&quot; went to number #1 on Billboards Top 100 while also earning her 5 Grammy nominations, MTV music awards, MTV European music awards and many more. (source \n\nimdb.com)\n\nInstall the latest version from Google play: https://play.google.com/store/apps/details?id=com.celebreetee.clb_britneyspears\n\nBeside the torrent, you can download the .apk file directly if you don't have a google play account, on developers' website:  &lt;a href=&quot;\nhttp://www.celebreetee.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.celebreetee.com/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:4844ec949d3290a7d5d1a4be766db6f29947c4c4","amp;dn":"torrent+-+avril+lavigne+music+star+app+for+android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4844ec949d3290a7d5d1a4be766db6f29947c4c4","infoHashBuffer":{"type":"Buffer","data":[72,68,236,148,157,50,144,167,213,209,164,190,118,109,182,242,153,71,196,196]},"announce":[],"urlList":[]}}