{"title":"VA - Dubstep and Drum N Bass EPs Vol. 08 by Geloso (2013)","uid":8447402,"size":1039511303,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48bb52f7d091258e686616c2eb919a4c7aac68ba&amp;dn=VA+-+Dubstep+and+Drum+N+Bass+EPs+Vol.+08+by+Geloso+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geloso","files":93,"time":1367926192,"description":"Compilation of singles and eps in one torrent grouped for easy upload and download. Most released in April of 2013. As always perfectly labeled. In Mp3 320 Kbps.\n\n #. Artist  _EP Title-  Track Title                  -Genre-         Record Label\n\n01. Arkasia -Phoenix- Eternal Wonders (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n02. Arkasia -Phoenix- Ignorance (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n03. Arkasia -Phoenix- Detonate (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n04. Arkasia -Phoenix- Revelation (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n05. Arkasia -Phoenix- Kill The Evil Bear (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n06. Arkasia -Phoenix- Ashes (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n07. Arkasia -Phoenix- Phoenix, Pt. 1 (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n08. Arkasia -Phoenix- Phoenix, Pt. 2 (Original Mix) -Dubstep/Grime- Heavy Artillery Recordings (HAR224)\n09. Audio Sleaze &amp; Genetix -Cydrone EP-(BASS024)- Cydrone (Original Mix) -Bass- Bassclash (BASS024)\n10. Audio Sleaze -Cydrone EP-(BASS024)- Rinse It (Original Mix) -Bass- Bassclash (BASS024)\n11. Audio Sleaze -Cydrone EP-(BASS024)- The Unknown (Original Mix) -Bass- Bassclash (BASS024)\n12. Audio Sleaze -Cydrone EP-(BASS024)- The Guardian (Original Mix) -Bass- Bassclash (BASS024)\n13. Audio Sleaze -Cydrone EP-(BASS024)- Age Of Sound (Original Mix) -Bass- Bassclash (BASS024)\n14. ASA -Arcane EP- Arcane -Deep Dubstep- Fent Plates (FPL005)\n15. ASA -Arcane EP- You Don't Have To Be Sorry -Deep Dubstep- Fent Plates (FPL005)\n16. ASA -Arcane EP- Ebony (Sorrow remix) -Deep Dubstep- Fent Plates (FPL005)\n17. ASA -Arcane EP- Omega (with Sorrow) -Deep Dubstep- Fent Plates (FPL005)\n18. ASA -Arcane EP- Omega (with Sorrow - feat MIK) -Deep Dubstep- Fent Plates (FPL005)\n19. Aggresivnes -Dance Or Die- Dance or Die (Original Mix) -Glitch Hop- Elektroshok Records\n20. Aggresivnes -Dance Or Die- Dance or Die (Royal Blood Remix) -Glitch Hop- Elektroshok Records\n21. Amit -Acid Trip/Don't Forget Your Roots- Acid Trip -Dubstep- Tempa\n22. Amit -Acid Trip/Don't Forget Your Roots- Don't Forget Your Roots feat. Rani -Dubstep- Tempa\n23. Cottonmouth -Wrath Of Khan- Wrath of Khan (Original Mix) -Dubstep- Dubsaw\n24. Cottonmouth -Wrath Of Khan- Atlantis (Original Mix) -Dubstep- Dubsaw\n25. Cottonmouth -Wrath Of Khan- Energise Me (Original Mix) -Dubstep- Dubsaw\n26. Cottonmouth -Wrath Of Khan- Atlantis (Professor Peng Remix) -Dubstep- Dubsaw\n27. Debian Blak &amp; Aaliyah -Aaliyah EP- Have Your Way - Dubstep- Future Soul\n28. Debian Blak &amp; Aaliyah -Aaliyah EP- Be Heard -Dubstep- Future Soul\n29. Debian Blak &amp; Aaliyah -Aaliyah EP- Chemistry -Dubstep- Future Soul\n30. DEE:SEE -Riddim EP- Riddim (Original Mix) -Drum &amp; Bass- Dank 'N Dirty Dubz (DANK007)\n31. DEE:SEE -Riddim EP- Riddim (ENiGMA Dubz Remix) -Drum &amp; Bass- Dank 'N Dirty Dubz (DANK007)\n32. DEE:SEE -Riddim EP- Riddim (Aftee Remix) -Drum &amp; Bass- Dank 'N Dirty Dubz (DANK007)\n33. DEE:SEE -Riddim EP- Riddim (P-Note Remix) -Drum &amp; Bass- Dank 'N Dirty Dubz (DANK007)\n34. Epicure -Foreplay- Direct Seduction -Dubstep- Kalamazoo\n35. Epicure -Foreplay- Bike Ride -Dubstep- Kalamazoo\n36. Epicure -Foreplay- Elsewhere -Dubstep- Kalamazoo\n37. Epicure -Foreplay- I can Tell you Wanna be Mine -Dubstep- Kalamazoo\n38. Eptic -Mastermind EP- Bust 'em Out Ft. Virus Syndicate -Dance- Never Say Die Records\n39. Eptic -Mastermind EP- Mastermind -Dance- Never Say Die Records\n40. Eptic -Mastermind EP- Space Business -Drum &amp; Bass- Never Say Die Records\n41. Eptic -Mastermind EP- Bust 'em Out Ft. Virus Syndicate (MRK1 Trap Rmx) -Dance- Never Say Die Records\n42. Ghosts Of Paraguay -Into The Light EP- Deep Six -Deep Dubstep- Solace\n43. Ghosts Of Paraguay -Into The Light EP- Bitter End (feat. Jett) -Deep Dubstep- Solace\n44. Ghosts Of Paraguay -Into The Light EP- Morning Light (feat. Jett) -Deep Dubstep- Solace\n45. Ghosts Of Paraguay -Into The Light EP- Mirrors (feat. LaMeduza) -Deep Dubstep- Solace\n46. High Rankin -Rebel Without Applause EP- Shouting At The Sky w/ Tigerlight -Dubstep- Subverted Records\n47. High Rankin -Rebel Without Applause EP- Destination Unknown feat Tigerlight -Dubstep- Subverted Records\n48. High Rankin -Rebel Without Applause EP- Are You Ready For The Hardcore -Dubstep- Subverted Records\n49. High Rankin -Rebel Without Applause EP- The Eye feat Paul McLaney -Dubstep- Subverted Records\n50. High Rankin -Rebel Without Applause EP- Babylon -Dubstep-  Subverted Records\n51. MRK1 &amp; Virus Syndicate -Renegade- Renegade -Dubstep- Midication Recordings (MDCTN005)\n52. MRK1 &amp; Jamakabi -Renegade- Deeper Then You -Dubstep- Midication Recordings (MDCTN005)\n53. MRK1 &amp; Doctor -Renegade- Badman -Dubstep- Midication Recordings (MDCTN005)\n54. MRK1 -Renegade- My Money -Dubstep- Midication Recordings (MDCTN005)\n55. MRK1 -Renegade- Deeper Then You (Instrumental) -Dubstep- Midication Recordings (MDCTN005)\n56. MRK1 -Renegade- Badman (Instrumental) -Dubstep- Midication Recordings (MDCTN005)\n57. Newham Generals -5 Star General- Darren &amp; Dan (Original Mix) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n58. Frisco, Newham Generals, P Mon -5 Star General- Boom Boom (Original Mix) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n59. Footsie -5 Star General- Chill Out &amp; Relax (Original Mix) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n60. Newham Generals -5 Star General- W.Y.P (Whats Your Problem) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n61. D Double E -5 Star General- Percy (Original Mix) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n62. Newham Generals -5 Star General- Spaz (Original Mix) -Dubstep, Grime- Dirtee Stank (STANK020DB)\n63. Rameses B -Pure EP- Meaning of life -Liquid Chill- Nu Venture Records\n64. Rameses B -Pure EP- Safe Haven -Liquid Chill- Nu Venture Records\n65. Rameses B -Pure EP- Pure -Liquid Chill- Nu Venture Records\n66. Rameses B -Pure EP- Sanctified -Liquid Chill- Nu Venture Records\n67. Spooky -Coolie Joyride EP- Coolie Joyride -UK Funky- Oil Gang\n68. Spooky -Coolie Joyride EP- Electric Fence -Grime- Oil Gang\n69. Spooky -Coolie Joyride EP- Rhythm &amp; Slags (Part 2) -Grime- Oil Gang\n70. Kaos -Dark Path- I'm comming home -Dubstep- Kanaha\n71. Kaos -Dark Path- Dark path -Dubstep- Kanaha\n72. Kaos -Dark Path- Turn it up -Dubstep- Kanaha\n73. Kaos ft. Doktor'n -Dark Path- Halloween -Dubstep- Kanaha\n74. Kaos -Dark Path- Get down -Dubstep- Kanaha\n75. Kaos -Dark Path- Killer within -Dubstep- Kanaha\n76. Kaos -Dark Path- Underworld -Dubstep- Kanaha\n77. Kaos -Dark Path- Dark path (Orginal) -Dubstep- Kanaha\n78. Kaos -Dark Path- Get down (Orginal) -Dubstep- Kanaha\n79. Static Revenger -Music In Motion- Movement In Motion -Dance- Scion AV\n80. Static Revenger -Music In Motion- Shut 'Em Down ft. J-Pak -Dance- Scion AV\n81. Static Revenger -Music In Motion- Units ft. ProtoHype &amp; Kezwik -Dance- Scion AV\n82. Static Revenger -Music In Motion- Movement In Motion (Starborn Remix) -Dance- Scion AV\n83. Static Revenger -Music In Motion- Movement In Motion (Doc Brown Remix) -Dance- Scion AV\n84. Synthetic Epiphany, CoMa -Beauty in Errors EP- Beauty in Errors (Original Mix) -House- DANK 'N' DIRTY DUBZ (DANK015)\n85. Synthetic Epiphany, CoMa -Beauty in Errors EP- Acquiescence (Original Mix) -House- DANK 'N' DIRTY DUBZ (DANK015)\n86. Synthetic Epiphany, CoMa -Beauty in Errors EP- Interlude -House- DANK 'N' DIRTY DUBZ (DANK015)\n87. Synthetic Epiphany, CoMa -Beauty in Errors EP- Pistol (Original Mix) -House- DANK 'N' DIRTY DUBZ (DANK015)\n88. Synthetic Epiphany, CoMa -Beauty in Errors EP- Beauty in Errors (Mellow Edit) -House- DANK 'N' DIRTY DUBZ (DANK015)\n89. Tunedef -Skyward- Chromatic -Dubstep- Epic Network Records\n90. Tunedef -Skyward- Double-Take -Dubstep- Epic Network Records\n91. Tunedef -Skyward- Skyward -Dubstep- Epic Network Records\n92. Tunedef -Skyward- Fleeting -Dubstep- Epic Network Records","torrent":{"xt":"urn:btih:48bb52f7d091258e686616c2eb919a4c7aac68ba","amp;dn":"VA+-+Dubstep+and+Drum+N+Bass+EPs+Vol.+08+by+Geloso+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48bb52f7d091258e686616c2eb919a4c7aac68ba","infoHashBuffer":{"type":"Buffer","data":[72,187,82,247,208,145,37,142,104,102,22,194,235,145,154,76,122,172,104,186]},"announce":[],"urlList":[]}}