{"title":"E-Man (First Comics)","uid":8445159,"size":252443358,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:49e4a9178c7a05a28b89fe60cee0924c29025626&amp;dn=E-Man+%28First+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ichthypod_Crane","files":26,"time":1367869858,"description":"'E-Man' is our next FCUP series. According to Wiki:\n\nE-Man is a fictional comic book superhero created by writer Nicola Cuti and artist Joe Staton for Charlton Comics in 1973. Though the character's original series was short-lived, the lightly humorous hero has become a cult-classic sporadically revived by various independent comics publishers.\n\nThe character premiered in E-Man #1, the first of ten issues (Oct. 1973 - Sept. 1975) published by the Derby, Connecticut-based Charlton Comics. The stories were humorous and lighthearted, in the style of Plastic Man, especially as E-Man could form himself into anything he wanted. In 1983, during a period of financial uncertainty for Charlton, the company sold independent publisher First Comics the rights to E-Man. First's E-Man ran 25 issues (April 1983 - Aug. 1985). Staton did the artwork, with stories written by Martin Pasko, Paul Kupperberg, Cuti, and Staton himself. In the course of the run, Staton acquired the copyright to the character from First, although First Comics retained ownership of those stories that had been published by them.\n\nThis torrent contains ONLY the E-Man issues from First, and they were hard as hell to find! If anyone else has the remaining E-Man oeuvre, please upload them!\n\n\nEach of my First Comics uploads contains a .txt file called 'First Missing'. If you have ANY of the scans listed, please contact me at the listed email. I want to make these uploads as complete as possible. Thanks!\n\nTHANK YOU creators and scanners! Get it, seed it!\n","torrent":{"xt":"urn:btih:49e4a9178c7a05a28b89fe60cee0924c29025626","amp;dn":"E-Man+%28First+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49e4a9178c7a05a28b89fe60cee0924c29025626","infoHashBuffer":{"type":"Buffer","data":[73,228,169,23,140,122,5,162,139,137,254,96,206,224,146,76,41,2,86,38]},"announce":[],"urlList":[]}}