{"title":"Devicebondage------DB-29540 Josi Valentine WMV.","uid":8367294,"size":956821248,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4d7d6d065b45853d630bf5e9b4fef08c803a1123&amp;dn=Devicebondage%5C------DB-29540+Josi+Valentine+WMV.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1365805919,"description":"Devicebondage------DB-29540 Josi Valentine WMV.\n\n\nWMV only. MP4 + Pics later.\n\n\nWhat do you do with pretty girls? Especially girls that know they are pretty? The instinct is to defile them, subject them to painful and humiliating interludes that give them pause. Even after the orgasms are had and the shoot is done, you want that memory of touching them emotionally to stay with them... for them to know that behind the pretty veneer, someone can genuinely destroy them. Vanity is only skin deep, but emotions can last a lifetime.\n\n\n\nJosi Valentine is a tough one. In the beginning, her neck is trapped between two pipes. In fact in the interview, we have her walk over to the prop and demonstrate that it is genuinely inescapable. Bitch is fucked. Immediately, she is gone after with the cane. All over her body she feels the cruel lashes of pain sear through her skin like a knife cutting butter. I no longer desire to look at her. If her face is covered, no one can tell how beautiful she is. That is the goal. Taking the beauty from the flesh instead of the vanity. Second, she is prostrated on her knees. Again head trapped in the stock. Controlling, manipulating, destroying. She dislikes what I have in store, but determined to see it through to the end, she resigns herself to pain and ordeal. Bitch is taken down to the ground and then flipped into an unforgiving and extreme back arch. Again, its no longer about her looks, just her body. I want her body... and I want to see it cum all over my hands with cum juice dripping onto the floor in a messy pile.\n\n\n\nFinally, its just about her cunt, and nothing else. She is no longer a person, she is a cunt. Her waist is trapped into the bifurcation wall and her feet are elevated and bound together, exposing her ass and pussy. Helpless, vulnerable, exposed. Orgasm after orgasm are repeatedly taken from her, whether or not she wants it... thats all she is going to get, and she better be grateful. A desperate whore is a good whore.\n\n\n\nScreens  &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29540&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29540&lt;/a&gt;\n\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\t\t","torrent":{"xt":"urn:btih:4d7d6d065b45853d630bf5e9b4fef08c803a1123","amp;dn":"Devicebondage%5C------DB-29540+Josi+Valentine+WMV.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d7d6d065b45853d630bf5e9b4fef08c803a1123","infoHashBuffer":{"type":"Buffer","data":[77,125,109,6,91,69,133,61,99,11,245,233,180,254,240,140,128,58,17,35]},"announce":[],"urlList":[]}}