{"title":"Psych.S07E12.Dual.Spires.720p.HDTV.x264-IMMERSE","uid":8478882,"size":1301309785,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4f7c263ab152fa5b8e2df8087870714614e7abd6&amp;dn=Psych.S07E12.Dual.Spires.720p.HDTV.x264-IMMERSE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"R0thschild","files":2,"time":1368681358,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n    \n              ***********************************************\nGenre: Comedy, Crime, Mystery\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Mel Damski\nCast: James Roday, Dule Hill, Timothy Omundson, Corbin Bernsen, Liam James\n\n.: Plot :.\nPsych is a USA Network series that follows the highly-comical detective endeavors of fake psychic Shawn Spencer. Shawn, brought up by his cop father, Henry Spencer, was trained, given powers of acute observation and other skills needed to solve mysteries in Henry's hopes that Shawn would one day join the long line of cops in the family. However, Shawn soon strayed from Henry's vision and spent many years of his young-adult life working various odd jobs. Shawn's hobby was calling in tips to the police on high-profile crimes that he caught on the news. One day, however, Shawn's hobby smacked him in the face, as he was brought to the police station as a suspected accomplice to a recent murder.\n\nThen and there, Shawn made up the lie that he was psychic, and through some highly convincing theatrics, it worked. The police then hired him as the &quot;Head Psychic&quot; and began to bring him in on difficult cases that usually had the police stumped. Along for all the adventures is Shawn's reluctant but loyal best friend, Burton &quot;Gus&quot; Guster, who has a straight, narrow, and secure job as a pharmaceutical sales representative. Disbelieving of Shawn's psychic charade is Head Detective Carlton Lassiter, who would sooner cuff Shawn than follow a &quot;vision.&quot; Other central characters include Lassiter's partner, Juliet O'Hara, and Interim Police Chief Karen Vick, both of whom are often amused by Shawn's &quot;psychic&quot; influence.","torrent":{"xt":"urn:btih:4f7c263ab152fa5b8e2df8087870714614e7abd6","amp;dn":"Psych.S07E12.Dual.Spires.720p.HDTV.x264-IMMERSE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7c263ab152fa5b8e2df8087870714614e7abd6","infoHashBuffer":{"type":"Buffer","data":[79,124,38,58,177,82,250,91,142,45,248,8,120,112,113,70,20,231,171,214]},"announce":[],"urlList":[]}}