{"title":"WILDC.A.T.S / X-MEN trade paperback (1998) (Bchry-DCP)","uid":8342698,"size":165838533,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5388d241d0420c6a47ca00428f4f09fca28d6f93&amp;dn=WILDC.A.T.S+%2F+X-MEN+trade+paperback+%281998%29+%28Bchry-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1365125853,"description":"English\nCBR\n181 pages\n158.16 MB\n\n------\n\nmirrormaster82 posted a scan of this trade paperback a couple of years ago, and I also included that file in one of my graphic novel megatorrents. However, this is a higher-quality scan by Bchry-DCP, who is a prolific master of trade paperback scanning.\n\nEven 15 years later, I'm amazed by the creators assembled for this project, but still disappointed that it was so plagued by delays. (It took almost a year and a half for 4 issues.)\n\nEnjoy and please seed to share with all our friends here on TPB! --STFmaryville\n\n------\n\nFrom Wikipedia, with a few corrections by me:\n\nWildC.A.T.s/X-Men was a crossover event from Jim Lee's WildStorm and published by Image Comics and Marvel Comics in 1997 and 1998. Featuring the WildC.A.T.s meeting the X-Men, it was originally released in four individual comics, each by a different creative team and each representing a different &quot;age.&quot; The miniseries was collected by Image Comics/WildStorm as a trade paperback in December 1998.\n\nThe four stories all occur in a unique continuity which appears to follow Earth's history as defined by the Marvel Universe, but an Earth where events central to the WildC.A.T.s universe have also occurred.\n\n\nThe Golden Age\nStory: Scott Lobdell\nArt: Travis Charest\nComputer Colors: Wildstorm FX\nLetters: Richard Starkings &amp; Comicraft's Dave Lanphear\nEditor: Mike Heisler\nConsulting Editor: Bob Harras\nOriginally published: February 1997\n\nSet in Nazi Germany, this story revolves around Logan and Zannah, who are independently working to recover an ancient artifact called the Lazarus Scroll from a group of Nazis who have allied with the Daemonites.\n\n\nThe Silver Age\nStory: Scott Lobdell\nPencils: Jim Lee\nInks: Scott Williams, Sal Regla\nColors: Joe Chiodo, Martin Jiminez\nLetters: Richard Starkings &amp; Comicraft's Dave Lanphear\nEditor: Scott Dunbier\nConsulting Editor: Bob Harras\nOriginally published: June 1997\n\nThis story takes place in the early days of the original X-Men and before the formation of the WildC.A.T.s. After being released from a South American prison by Nick Fury, Cole Cash is drafted by S.H.I.E.L.D. to work as a field agent to investigate what appears to be an &quot;alien invasion&quot; and to recover an operative who has been captured in Sydney. At the same time, Jean Grey, on a flight to a modeling shoot in Sydney, is psionically accosted by the &quot;aliens,&quot; who reveal themselves to be hybrids of the Brood and the Daemonites.\n\n\nThe Modern Age\nStory: James Robinson\nPencils: Adam Hughes\nInks: Mark Farmer\nColors: Joe Chiodo, Martin Jiminez\nLetters: Richard Starkings &amp; Comicraft's Dave Lanphear\nEditor: Scott Dunbier\nConsulting Editor: Bob Harras\nOriginally published: August 1997\n\nThis story takes place after the formation of the second X-Men team and the WildC.A.T.s, but before the Dark Phoenix Saga. The X-Men are investigating the disappearance of a young mutant boy which appears to be connected to a British branch of the Hellfire Club. At the same time, the WildC.A.T.s are investigating a suspected allegiance between this branch of the Club and the Daemonites.\n\n\nThe Dark Age\nStory: Warren Ellis\nPencils: Mat Broome\nInks: Stan Parsons\nColors: Wendy Fouts\nLetters: Richard Starkings &amp; Comicraft's Dave Lanphear\nEditor: Scott Dunbier\nConsulting Editor: Bob Harras\nOriginally published: May 1998\n\nThis story takes place in Manhattan in 2019. North America is a wasteland ruled by the Daemonites. It is revealed that the Daemonites on Earth went insane in anger and grief after learning that their homeworld had been conquered by the Kherubim. Still intent on conquering Earth, they stole Sentinel technology from the US government and fused the technology with themselves, turning themselves into monstrous cyborgs who easily overpowered the combined human/superhuman/Kherubim forces which tried to stop them.","torrent":{"xt":"urn:btih:5388d241d0420c6a47ca00428f4f09fca28d6f93","amp;dn":"WILDC.A.T.S+%2F+X-MEN+trade+paperback+%281998%29+%28Bchry-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5388d241d0420c6a47ca00428f4f09fca28d6f93","infoHashBuffer":{"type":"Buffer","data":[83,136,210,65,208,66,12,106,71,202,0,66,143,79,9,252,162,141,111,147]},"announce":[],"urlList":[]}}