{"title":"Overexposed (Deluxe Version)","uid":8280922,"size":205605501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:54f2ccc32717373f29b1dd8d0d8c7803c555dc97&amp;dn=Overexposed+%28Deluxe+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Learkeal","files":23,"time":1363829539,"description":"Overexposed is the fourth studio album by the American pop rock band Maroon 5. The album was recorded between 2011 and 2012 and was driven after the moderate success of their third album Hands All Over (2010) and later by the enormous success of re-release single &quot;Moves like Jagger&quot;. The album was released on June 26, 2012 in the United States by A&amp;M/Octone Records. The band worked with different producers, such as Max Martin, who serves as the album's executive producer, Ryan Tedder, Shellback and Benny Blanco. Levine's usual co-writer and lead guitarist James Valentine only has four credits on the album. The band has said that it is their poppiest album, featuring mostly pop oriented tracks, combined with pop rock, dance-pop disco and reggae sounds.\nThe accompanying artwork, created by LA artist Young &amp; Sick, is a colourful collage of illustrations seemingly inspired by the likes of Picasso and a range of modern cartoonists. Its title is a smirking allusion to Levine's ubiquity, while its sound is a reflection of how the group wishes to retain the large audience they won once again with &quot;Moves Like Jagger&quot;. The album's lead single &quot;Payphone&quot;, featuring rapper Wiz Khalifa, produced by Shellback and Benny Blanco, was released and performed on The Voice on April 16, 2012. The song was a success, reaching number two on the Billboard Hot 100 chart, as well as on the ARIA Charts, while it topped the UK Singles Chart, Canadian Hot 100 and Italian Singles Chart. A second single &quot;One More Night&quot; was released on June 19, 2012. The song has topped the Billboard Hot 100 for nine weeks, becoming their longest Hot 100 reign.\nThe album received a mixed reception from music critics. Some critics praised the album, calling it their strongest album. However, many criticized the direction that the band decided to take, calling it a failed tentative to become mainstream and noting that the other members have small roles on the album. It debuted at number 2 on the UK Albums Chart, selling 38,000 copies, and on the US Billboard 200 chart, selling 222,000 copies. Total worldwide sales of the album by the end of 2012 stood at 2.2 million copies.[2] To promote the album, the band started the &quot;Overexposed Tour&quot; with shows in South America. Through September and October, they will visit East Asia and they will also play two shows in Australia during October, 2012","torrent":{"xt":"urn:btih:54f2ccc32717373f29b1dd8d0d8c7803c555dc97","amp;dn":"Overexposed+%28Deluxe+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54f2ccc32717373f29b1dd8d0d8c7803c555dc97","infoHashBuffer":{"type":"Buffer","data":[84,242,204,195,39,23,55,63,41,177,221,141,13,140,120,3,197,85,220,151]},"announce":[],"urlList":[]}}