{"title":"Bass.Booster.Pro.2.0.2.Full","uid":8440271,"size":735525,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:56685eecf57fae855241a90efadd1b18fe28b7d3&amp;dn=Bass.Booster.Pro.2.0.2.Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"saifi2649","files":2,"time":1367753246,"description":"Disclamer : \nWe are not responsible for anything that might happen to your phone, your audio device or yourself ! Do not listen at full volume or with bass boost for too long. This app can damage your devices or hearing. Use it wisely ! \nBy downloading this application, you accept that in no case we could be held responsible for any kind of damage resulting of the use of this app in any way. \nThis software is provided by the copyright holders and contributors &quot;as is&quot; and any express or implied warranties, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose are disclaimed. In no event shall the copyright owner or contributors be liable for any direct, indirect, incidental, special, exemplary, or consequential damages (including, but not limited to, procurement of substitute goods or services; loss of use, data, or profits; or business interruption) however caused and on any theory of liability, whether in contract, strict liability, or tort (including negligence or otherwise) arising in any way out of the use of this software, even if advised of the possibility of such damage. ","torrent":{"xt":"urn:btih:56685eecf57fae855241a90efadd1b18fe28b7d3","amp;dn":"Bass.Booster.Pro.2.0.2.Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56685eecf57fae855241a90efadd1b18fe28b7d3","infoHashBuffer":{"type":"Buffer","data":[86,104,94,236,245,127,174,133,82,65,169,14,250,221,27,24,254,40,183,211]},"announce":[],"urlList":[]}}