{"title":"Henry Jerome","uid":8391303,"size":166933621,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:56b823e225a1cd03f26eb5625dfd66a22598fb58&amp;dn=Henry+Jerome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"teacherdan","files":24,"time":1366436934,"description":"The &quot;Brazen Brass&quot; man. Jerome started as a bandleader in high school, and went to work full-time with a cadre of his classmates (including future Federal Reserve chairman Alan Greenspan) after graduation. From the mid-1930s through the end of the 1940s, Jerome ran the band in some form continuously, working steamships, hotels, and circuits. In its various guises, the Jerome band was a &quot;sweet&quot; band, specializing in light ballads and moderate tempos.\n\nAfter breaking up the band, Jerome went into record producing, and ended up forming a new studio band to release a series of LPs for Decca under the moniker of &quot;Brazen Brass.&quot; While Jerome was inspired by the success of Enoch Light's &quot;Persuasive Percussion&quot; album and sound, he deserves credit at least for dumping the sweet sound for something bold, splashy, and, well, brazen. The trademark &quot;brazen&quot; sound was enhanced through stereo by recording an equal number of trumpets on each channel, muted horns on the right and open horns on the left. According to Jerome, the technique was &quot;To have my open brass section on left speaker talk musically to the muted brass section on the right speaker in musical phrases and be able to reverse them which was unheard of in those days and was one of the reasons for its tremendous sale--Worldwide #1 (4 of them in the top 10 at the same time).&quot; Jerome produced and conducted nine Brazen Brass albums for Decca, as well as several more conventional sweet albums, until he left to become an A&amp;R man for Coral in 1959. He released one more &quot;brazen&quot; style album in the late 1960s, for United Artists. ","torrent":{"xt":"urn:btih:56b823e225a1cd03f26eb5625dfd66a22598fb58","amp;dn":"Henry+Jerome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b823e225a1cd03f26eb5625dfd66a22598fb58","infoHashBuffer":{"type":"Buffer","data":[86,184,35,226,37,161,205,3,242,110,181,98,93,253,102,162,37,152,251,88]},"announce":[],"urlList":[]}}