{"title":"DeviceBondage---DB-31388 Siouxsie Q MP4","uid":8486646,"size":2608200630,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5725e1bf8363cf15ebe22c43d4a0709ebc1f2e4d&amp;dn=DeviceBondage---DB-31388+Siouxsie+Q+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1368885153,"description":"Siouxsie Q vs Claire Adams\n\nMay 17, 2013 - Performers: Siouxsie Q \n \n\nMP4 + Pics.\n\n\nRaven haired and American Sioux Indian Siouxie Q signs up to be mercilessly tormented by Claire Adams. Be careful what you wish for, or you just may get it.\n\n\n\nSCENE 1\nSiouxsie is bound kneeling in a latex box tie arm binder, latex posture collar, latex head harness, leather straps, thigh high stockings, and high heels. She mentions breast bondage scares her, so we fully exploit her fears and aggressively try to push her off balance and out of her comfort zone. Breast and genital caning are quickly followed by clothespins all over her torso. A blindfold is added and the clothespins are single tailed off until she can't take it any more. To reward her pain journey, the vibrator and punishing hand fucking enter the picture. We find out that she is a squirter... and what kind of cum slut she is going to be.\n\n\n\nSCENE 2\nShe is in a chain dog house. Her neck is pulled in four directions by chain in a metal collar. Her ass is held up in doggy by chains around her legs and her wrists and ankles are screwed into the platform, entirely preventing her from escaping. A speculum is inserted into her asshole, going deep into her. A dick on a stick enters the picture and fucks her through the anal speculum. Claire goes after her feet with the cane. Her body is greased down like a pig and then layered with sheets of wax. The dick re-enters, fucking her pussy now. The bitch cums and cums. Unable to free herself, she has no choice but to submit.\n\n\n\nSCENE 3\nFinally, she is bound sitting on a vintage metal tractor seat. Her ankles are bound in cruel metal shackles and her wrists wrapped around her legs, secured in handcuffs, and attached to her neck. Tape is added to her hands and they ares shaped into balled fists, so there is no way she can help or alleviate her suffering. The only way Claire is going to hurt Siouxsie is if she begs for it. Her feet and ass are caned. The thighs earn nice red stripes against her creamy skin. She squirms and tries desperately to get away, which only makes Claire want to cane her harder and hurt her more. The cunt is on display for us to see, and ripe for the pickings. Since our slut cums so easily, its time to see just how many we can get out of her... \n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=31388&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=31388&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:5725e1bf8363cf15ebe22c43d4a0709ebc1f2e4d","amp;dn":"DeviceBondage---DB-31388+Siouxsie+Q+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5725e1bf8363cf15ebe22c43d4a0709ebc1f2e4d","infoHashBuffer":{"type":"Buffer","data":[87,37,225,191,131,99,207,21,235,226,44,67,212,160,112,158,188,31,46,77]},"announce":[],"urlList":[]}}