{"title":"The Flame Golden Age Fox Syndication almost Complete","uid":8413447,"size":1219086258,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5800d0adf52dcb431e07ee95b638810111d5963d&amp;dn=The+Flame+Golden+Age+Fox+Syndication+almost+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mothra67","files":-1,"time":1366974528,"description":"All the books I could find of the 3 series this Golden Age Mystery Man was in!\n\nWhen Gary was a baby, his father, Charteris Preston, worked as a missionary in China. The elder Preston was washed away in a flood but managed to save baby Gary by placing him in a basket. The basket was washed downstream to Tibet, where Gary was rescued by a group of lamas. They raised Gary in the lamasery, where they trained him in their mystical ways. Through this training, Gary obtained the ability to control fire and heat. He can raise his own body temperature to the point where he can burst into flames or melt bullets. He can control and direct any flame in his presence. He can also teleport from place to place by appearing inside of any fire source, no matter how small. The Flame's one weakness is water, which can severely weaken him. In order to provide fire whenever he needs it, the Flame carries a small, pistol-sized flame thrower.\n\n\nAfter the Flame was injured battling the Octopus, he instructed Linda Dale, his girlfriend, to use a secret formula that gave her the secret powers of the flame people, making her into Flame Girl\n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:5800d0adf52dcb431e07ee95b638810111d5963d","amp;dn":"The+Flame+Golden+Age+Fox+Syndication+almost+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5800d0adf52dcb431e07ee95b638810111d5963d","infoHashBuffer":{"type":"Buffer","data":[88,0,208,173,245,45,203,67,30,7,238,149,182,56,129,1,17,213,150,61]},"announce":[],"urlList":[]}}