{"title":"The Triumph of the Nerds (Greek subtitles) (1996)","uid":8450120,"size":435321582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:59ba5786a88ed79bf654a29923618d7bf967eae6&amp;dn=The+Triumph+of+the+Nerds+%28Greek+subtitles%29+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mario.ath","files":-1,"time":1367977858,"description":"Triumph of the Nerds: The Rise of Accidental Empires (1996)\n\n\nH istoria tvn proswpikwn ypologistvn 1974-1995\n\n\nSunoptika:\n\n1975. Ton Ianoyario to periodiko &quot;Popular Electronics&quot; kanei tin paroysiasi toy Altair 8800 basismenoy ston mikroepexergasti tis Intel 8080.\n\n1976. O Stib Bozniak sxediazei ton ypologisti Apple I. O ypologistis einai kataskeyasmenos ex olokliroy pano se mia monadiki plaketa kyklomaton.\n\n1977. I Apple Computers paroysiazei ton Apple II.\n\n1977. I Commodore paroysiazei ton PET 2001 (Personal Electronic Transactor).\n\n1979. I Motorola paroysiazei ton mikroepexergasti 68000.\n\n1981. I Xerox paroysiazei ton &quot;The Star&quot;, ton proto prosopiko ypologisti me Grafiko Periballon Xristi (Graphical user interface, GUI).\n\n1981. I IBM paroysiazei ton IBM PC kai katakta tin agora. O IBM PC einai o progonos olon ton simerinon prosopikon ypologiston (PC). Diathetei os leitoyrgiko systima to PC-DOS, dimioyrgia tis Microsoft, tis ekkolaptomenis tote etaireias toy Mpil Gkeits.\n\n1983. H Compaq Computer Corp. paroysiazei ton proto Â«klonoÂ» toy IBM PC.\n\n1984. Paroysiazetai apo tin Apple Computers o ypologistis Apple Macintosh. Diathetei pontiki kai GPE. I etaireia dapana ston teliko toy Super Bowl $1.5 ekatommyrio dolaria gia ti diafimisi toy.\n\n1984. H IBM paroysiazei ton IBM PC-AT (PC Advanced Technology), o opoios einai 3 fores taxyteros apo ton arxiko PC kai basizetai sto neo mikroepexergasti tis Intel, ton 286. O AT diathetei diaylo (bus) ISA ton 16-bits kai einai o pleon sygxronos gia tin epoxi toy ypologistis.\n\n\n1986. I Compaq anakoinonei ton ypologisti Deskpro 386.\n\n1986. Emfanizetai o protos Amstrad PC, o PC1512, akoloythoymenos apo ton PC1640. Einai oi fthinoteroi prosopikoi ypologistes stin Eyropi me dynatotites idies me toys poly akriboteroys tis IBM kai allon kataskeyaston. I emfanisi toys dinei megali othisi stin agora prosopikon ypologiston.\n\n1987. H IBM paroysiazei toys mikroYpologistes PS/2, oi opoioi diathetoyn disketa 31/2 intson kai karta othonis VGA. Paroysiazetai, episis, i texnologia Micro Channel Architecture (MCA) kai o protos diaylos &quot;Plug and Play&quot; gia mikroYpologistes.\n\n1988. O synetairos kai synidrytis tis Apple Steve Jobs egkataleipei tin etaireia kai dimioyrgei diki toy, tin opoia onomazei &quot;NeXT&quot;\n\n1990. Dimioyrgeitai i ypiresia toy Pagkosmioy Istoy me tin kathoristiki symboli toy Tim Mperners Li (Tim Berners-Lee), ereyniti toy CERN. O Li dimioyrgei to protokollo http, ti dieythynsiodotisi istoselidon (URI, prodromo toy simerinoy URL) kai ti glossa simansis istoselidon HTML.\n\n1991. Arxizei i anaptyxi toy leitoyrgikoy systimatos Linux apo ton Linoys Torbalnts.\n\n1993. I Intel paroysiazei ton mikroepexergasti Pentium (P5). Oi epexergastes tis pia den pairnoyn onomata arithmon alla kodikes onomasies.\n\n1995. H Microsoft paroysiazei ta Windows 95, to proto leitoyrgiko systima gia klonoys prosopikon ypologiston, basismeno sto MS-DOS, alla me Grafiko Periballon Epexergasias (GPE).\n","torrent":{"xt":"urn:btih:59ba5786a88ed79bf654a29923618d7bf967eae6","amp;dn":"The+Triumph+of+the+Nerds+%28Greek+subtitles%29+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ba5786a88ed79bf654a29923618d7bf967eae6","infoHashBuffer":{"type":"Buffer","data":[89,186,87,134,168,142,215,155,246,84,162,153,35,97,141,123,249,103,234,230]},"announce":[],"urlList":[]}}