{"title":"IntelliJ IDEA 12.1.2","uid":8463305,"size":220073984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e8e32a44d9e2f267a68fdbcceaf1b3f271163ad&amp;dn=IntelliJ+IDEA+12.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LoneWalker","files":-1,"time":1368296396,"description":"IntelliJ IDEA Features\n\nIn addition to being the most intelligent Java IDE, IntelliJ IDEA does provide out-of-the-box support for web, enterprise and mobile frameworks, which all together bring you an unparalleled user experience.\n\n\nProductivity-Boosting Features\nIntelliJ IDEA is focused on raising your productivity by providing the most intelligent code assistance for all supported languages and frameworks.\n\nSmart Code Completion is always aware of the context so you can code faster than ever.\nOn-the-fly Code Analysis ensures code quality as you type and suggests handy quick-fixes.\nAdvanced Refactorings takes care of applying complicated changes to the code safely.\nDeveloper Tools\nIntelliJ IDEA offers an amazing set of integrated tools that make development more productive.\n\nDatabase Tools including a full-featured database editor and SQL support.\nUML Designer for analysing and designing classes.\nVersion Control Tools with a unified interface for Git, SVN, Mercurial and others.\nBuild Tools with support for Maven, Ant, Gradle and Gant.\n\n\nWeb Development\nIntelliJ IDEA offers advanced support for the most important web frameworks and standards.\n\nDevelop easily with Spring MVC, Webflow, Play, Grails, Web Services, JSF, Struts, Flex and other frameworks.\nIncludes ultimate code assistance for HTML5, CSS3, SASS, LESS, JavaScript, CoffeeScript, Node.js, ActonScript and other languages.\n\nEnterprise Development\nIntelliJ IDEA offers an out-of-the-box tool set for building enterprise applications.\n\nWith support for Spring, including Data, Web Services, Security, Batch, Roo, Integration and other frameworks.\nCode assistance and deployment tools Java EE, including EJB, CDI, JPA, Hibernate and support for the most popular application servers.","torrent":{"xt":"urn:btih:5e8e32a44d9e2f267a68fdbcceaf1b3f271163ad","amp;dn":"IntelliJ+IDEA+12.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8e32a44d9e2f267a68fdbcceaf1b3f271163ad","infoHashBuffer":{"type":"Buffer","data":[94,142,50,164,77,158,47,38,122,104,253,188,206,175,27,63,39,17,99,173]},"announce":[],"urlList":[]}}