{"title":"Alex Jones Show - 2013 May 09 TH [sebaygo1]","uid":8458028,"size":87764233,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5f0363a7bd1cf6fe37bae2438e76d8baa1a98fd6&amp;dn=Alex+Jones+Show+-+2013+May+09+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":13,"time":1368150408,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 09 May 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Thursday, May 9 transmission of The Alex Jones Show, Alex continues to seek the truth behind the Benghazi debacle that left four Americans dead in Libya Sept 11, 2012, which the White House falsely claimed was fallout stemmed from an anti-Islamic YouTube video. \n\nAccompanied by guests Lord Christopher Monckton and author and psychological warfare expert Dr. Steve Pieczenik, Alex also analyzes Israel's and the US' increased efforts to invade Syria by funding, aiding and arming so-called rebels, many of which are affiliated with the al-Qaeda offshoot Jabhat al-Nusra. \n\nAlex also welcomes Member of the European Parliament for Yorkshire and the Humber for the United Kingdom Independence Party (UKIP) Godfrey William Bloom to discuss the party's strong showing in the local elections. \n\nDefense Distributed's Cody Wilson also pops in to speak about his group's development of the first fully 3D printed gun, the Liberator.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:5f0363a7bd1cf6fe37bae2438e76d8baa1a98fd6","amp;dn":"Alex+Jones+Show+-+2013+May+09+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f0363a7bd1cf6fe37bae2438e76d8baa1a98fd6","infoHashBuffer":{"type":"Buffer","data":[95,3,99,167,189,28,246,254,55,186,226,67,142,118,216,186,161,169,143,214]},"announce":[],"urlList":[]}}