{"title":"Tulsidas (1954) VCD - Hard-Coded Eng Subs - 0.978G {DDR}","uid":8474371,"size":1026220065,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61b230994c87f24bef554dc374d54d060e0f4e55&amp;dn=Tulsidas+%281954%29+VCD+-+Hard-Coded+Eng+Subs+-+0.978G+%7BDDR%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1368576658,"description":"Tulsidas (1954) VCD - Hard-Coded Eng Subs - 0.978G {DDR}\n\n............................................\nPLEASE NOTE:- This movie is a condensed version 96 minutes rather than the 140 minutes of the original version. It's a rare copy, and there may not be another copy of this movie to come for a long time. 'Tis for this \n\nreason that I have decided to release it. The story line is intact, however, about 5 songs have been deleted in this release version.\n..............................................\n\nCast:- Mahipal, Shyama, RajKumar, Dulari, Sunder, Ramesh Sinha, Uma Dutt, ChamanPuri, Priya Darshani\n\n\nProduced by Ratnadeep Pictures\nDirected by Balchandra, Harsukh Bhatt\nMusic by Chandragupta\nLyrics by Pt. Madhur, Indiver\nPlayback Singers:- Rafi, Asha\n\nHere are the 8 songs from the original movie bitrate 128kbps compliments of SurjitSingh. Only three of these are in the movie\nThese were considered some of Rafi's best songs of the Golden Years.\n\nSongs are included in MP3s\n01. Tulsidas 1954_He Mahadev Meri Laaj Rahe_Rafi\n02. Tulsidas 1954_Jeevan Bhar Aansoo Mein Doobi_Asha\n03. Tulsidas 1954_Kahan Chhupe Ho Raja Ram_Rafi\n04. Tulsidas 1954_Mujhe Apni Sharan Me Lelo Ram_Rafi\n05. Tulsidas 1954_Naiya Jaldi Le Chalo Mujhe Sainya Ke Angana_Asha\n06. Tulsidas 1954_Naiya Jaldi Le Chalo Mujhe Sainya Ke Angana_Rafi\n07. Tulsidas 1954_Radha Ji Ke Kuwar Kanhaiya_Rafi_Asha\n08. Tulsidas 1954_Rahu Kaise Main Tumko Nihare Bina_Rafi\n\nTULSIDAS Mini Biography:-\nTulsidas was one of the best poets ever to have graced Bharat. His verses were written in Hindi and accessible to everyone. He is well known for the work, which was referred to as the greatest book ever written by Gandhiji, 'Ramacharita manasa'\n\nTulsidas was born in the year 1532 to a brahmin family in the town of Rajapur. He suffered separation from his parents at a very young age and was not taken care of by his relatives. He came into contact with some saints who advised him to surrender to Lord Rama. Thus, he got associated with a Hanuman temple and ate whatever was given to him. Not much is known about Tulasi's guru, but he met him in Sukarkheta. Since tulasidas was not mentally equipped at that time for complex philosophies, his guru advised him to take up the path of devotion to Rama. As time grew on, Tulasi's love for Rama grew deeper and deeper.\n\nHowever, in his youth, he got married to a woman named Ratnavali. Once his wife went to stay with her parents for a while. Tulsi, not being able to bear the separation, went to meet her. Ratnavali is said to admonished Tulasi by saying 'I am just a bag of flesh and bones. Why are you so attracted to it ? Why don't you love Lord Rama with the same fervor?' This type of retort is not typical of Indian wives _at least during that time_. One wonders whether Ratnavali was itself spiritually inclined or whether God determined it was the appropriate time for Tulasi to leave the family life. Anyway, Tulsidas contemplated on this remark and left all connections with the family life.\n\nAfter bidding goodbye to family life, he lived in Chitrakuta for some time before 1564. He used to go around houses for alms. One day, he came to the house where his wife and father-in-law lived, but he did not recognize them. Though the wife recognized him, she just gave him alms and food. When she insisted that he partake spices like pepper, salt etc, he replied that he had his own supply of spices in his possession. \n\nEarly next morning, when Tulsidas was preparing to leave the house, his wife requested him to take her with him. But, he refused saying that he has renounced family life. Ratnavali was angered and remarked, 'You have spices in your possession, but not wife. What kind of renunciate are you ?.' Tulsidas recognized the folliness of being attached to food, and thanked his wife for the lesson and threw away all his remaining possessions. He, then, migrated to Kashi. Scholars have rightly pointed out that Ramacharita manasa would never have been written if not for Ratnavali's remarks. Though he made several pilgrimages throughout the country, his permanent residence was in Kashi. He commenced writing rama charita manasa in Ayodhya but came back to Kashi.\n\nNabhaji, the author of Bhaktamala (1600), writes that Tulsidas was an incarnation of Valmiki itself born again to explain Ramayana in the vernacular langauge. This raise in his fame naturally created many enemies,who attacked his caste, his asceticism etc, but Tulasi does not seem to have been bothered by this.\n\nTulsidas was a personification of humility. He declares in the Manasa that he is no poet and he is imperfect and only sings the excellence of Rama according to his poor wit and understanding. This is the case in his other works Gitavali (1571), Kavitavali (1612), Barvairamayana (1612) and one of the best works, Vinaya Patrika (request to Rama). Tulsi, should not, however, be considered partial to Rama in exclusion to others. He appreciated the diverse tenets of Saiva, advaita and samkhya philosophies. He authored 22 different works. He never became attracted to miracles or money. Once the powerful king Jahangir offered him money in return for the performance of some miracles. Tulasi retorted 'Who needs money when one has the love of / and for / Rama ? What use is miracles before his glory ?'\n\nIn Kashi, he became the head of the monastery in lolarka kunda and was designated 'Gosain.' Around 1612, he started to suffer from acute arm pain, boils causing uprooting of his hair and also seems to have suffered from the epidemic in the local area. Having dedicated his life to Lord Rama, these were considered to mere trifles and Tulasi passed away on the third day of the dark fortnight in the month of Shravana in 1623. \n\nNOSTALGIA 1954\n- Indian Film Festival held in the Soviet Union. Awaara (1951) was a major hit in the USSR.\n- Government published its decision on the S.K. Patil Enquiry Committee Recommendations.\n- The second song-less film Munna released.\n- Last ditch effort to save Bombay Talkies - Badbaan failed.\n- Due to doing repeated tragic roles in films Dilip Kumar got himself into depression. Psychiatrists suggested him to do comedy films. Then came Aazad, Kohinoor, Insaniyat etc.\n\nPOPULAR FILMS of 1954\n1. Taxi Driver : Chetan Anand _ Dev Anand, Kalpana Karthik\n2. Nagin : Nand Lal Jaswant Lal_Pradeep Kumar, Vyajayantimala\n3. Aar Paar : Guru Dutt_Guru Dutt, Shyama, Kumkum\n4. Nastik : I S Johar_I S Johar, Nalini Jaywant\n5. Boot Polish : Prakash Arora_Raj Kapoor, David, Baby Naaz\n6. Shart : B Mitra_I S Johar, Sulochana, Shashi Kala\n\nPOPULAR SONGS of 1954\n1. Babuji Dheere Chalna : Aar Paar_Geeta Dutt\n2. Aise Toote Taar Ke Mere : Gawaiya_Talat Mahmood\n3. Jayen To Jayen Kahan : Taxi Driver_Talat Mehmood\n4. Man Dole Mera Tan Dole : Nagin_Lata Mangeshkar\n5. Din Hai Suhana Aaj : Pehli Taarikh_Kishore Kumar\n6. Chandan Ka Palna Resham Ki : Shabab_Hemant Kumar, Lata Mangeshkar\n \t\nTotal Films Released : 278\nHindi : 118\nBengali : 48\nTamil : 38\nTelugu : 28\nMarathi : 18\nMalyalam : 9\nOthers : 19\n.\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1119 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 1:36:02\nSubtitles: Hard-Coded\nRipped by: Trinidad [DDR]    \nDuration: 1:36:02\n","torrent":{"xt":"urn:btih:61b230994c87f24bef554dc374d54d060e0f4e55","amp;dn":"Tulsidas+%281954%29+VCD+-+Hard-Coded+Eng+Subs+-+0.978G+%7BDDR%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61b230994c87f24bef554dc374d54d060e0f4e55","infoHashBuffer":{"type":"Buffer","data":[97,178,48,153,76,135,242,75,239,85,77,195,116,213,77,6,14,15,78,85]},"announce":[],"urlList":[]}}