{"title":"[XLGirls] Annemari (Packin 'The Melons / 03.14.2013)","uid":8258741,"size":386049964,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:64bf0367f48467adf833a40caa1d0d920dd13d2c&amp;dn=%5BXLGirls%5D+Annemari+%28Packin+%27The+Melons+%2F+03.14.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1363324832,"description":"[XLGirls] Annemari (Packin 'The Melons / 03.14.2013)\n\nThe wildest thing Annemari did in her life was having sex on a train. She found the experience hot yet scary at the same time, extremely nervous that a conductor would spot her being fucked by her husband and throw them off the train. It didn't happen. Annemari's first time with TSG was a solo pictorial in 2009. Annemari had never modeled before but she felt the urge to try it. A married lady, she saw a TV show about plus-size women and began investigating her options. She soon found one of our Prague, Czech Republic photographers and posed just that one time. She was a brunette back then. Our photographer reported that Annemarie wasn't nervous at all during their photo shoot. She enjoyed it but we didn't hear from her again. And now, over three years later, Annemari contacted us again. She's blonde now but she looks the same. Her tits are still huge. And she's hot for another round. This time to fuck a stranger for XLGirls. Annemari comes over to the bed where Steve is waiting. She pulls the sheet off him and glances mischievously at the camera. She leans over, gets between his legs, takes his dick in her hand and begins sucking him off. Steve hasn't met his porn-date yet and is impressed by the size of her tits. They are true face-pillows. Steve and Annemari take turns on each other. He feasts on her huge whoppers. She feasts on his boner. She squeezes her boobs together from the side and he slides his dick in and out of her cleavage-pussy. Annemari lies on her back and Steve gets between her legs to finger-bang and lick her wet hole. Annemari goes crazy when he does this and gets even crazier when Steve begins screwing her. When it was Steve's time to blow a load, Annemari did the right thing and jacked him off on her face. How did Annemari like Steve's pussy service overall? &quot;He had a good cock. I would fuck him again! Sex with a professional man is great. Every girl should try this.&quot;\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3fyl7whmekjva1k9fgrt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3fyl7whmekjva1k9fgrt.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=53g3bj91nr98dnwhu25e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=53g3bj91nr98dnwhu25e.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:64bf0367f48467adf833a40caa1d0d920dd13d2c","amp;dn":"%5BXLGirls%5D+Annemari+%28Packin+%27The+Melons+%2F+03.14.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64bf0367f48467adf833a40caa1d0d920dd13d2c","infoHashBuffer":{"type":"Buffer","data":[100,191,3,103,244,132,103,173,248,51,164,12,170,29,13,146,13,209,61,44]},"announce":[],"urlList":[]}}