{"title":"HomePlanSoft Easy Mail Plus v2.2.38.21 with Key [TorDigger]","uid":8415789,"size":5239224,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:69bbb1922535096cdfe5b680dc1ace2a64821d6c&amp;dn=HomePlanSoft+Easy+Mail+Plus+v2.2.38.21+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":9,"time":1367033252,"description":"Easy Mail Plus\n\nMailing List Software At Its Best!\n\nDo you need . . .\n\nAn easy way to produce great looking envelopes and labels?\nA simple way to manage your mailing lists?\nBetter ways to select names in your lists?\nA bullet-proof way to back up files with a single click?\nSoftware that is continuously maintained with free updates?\n\nInstall Easy Mail Plus now! Easy Mail Plus provides all of the above and much, much more.\n\nFrom the complexity of database management to the design of graphic layouts for envelopes and labels, Easy Mail Plus is more powerful and easier to use than is any other mailing list software available. We invite you to compare and see for yourself.\n\nType your message, and then just a few mouse clicks can fax it, print it, e-mail it, prepare an envelope, and print a label. Best of all, leave your printer settings alone. To mail your letter, just stick an envelope where the paper goes and let Easy Mail Plus handle the rest.\n\nYou can put a sheet of labels in the printer, print the ones you need immediately, and use the rest of the label sheet another time. Built-in importing uses easy drag-and-drop technology to make it a snap to create address files from your existing data files. Use our predefined envelopes and labels (metric and U.S.) or configure your own. Use one of our logos, or any BMP, GIF, JPEG, WMF, or ICO image. Drag and drop addresses, logos, and bar codes. Put post office bar codes on envelopes and labels. Print to the entire list, one at a time, or to selected addresses.\n\nPrint just one label or a few per sheet. Print a full sheet of the same or of different addresses. \n\nSupported OS:\n\nwindows 95/98/00/NT/ME/XP/Vista/Win7/Win8 desktop\n\nHomepage: http://www.easymailplus.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:69bbb1922535096cdfe5b680dc1ace2a64821d6c","amp;dn":"HomePlanSoft+Easy+Mail+Plus+v2.2.38.21+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69bbb1922535096cdfe5b680dc1ace2a64821d6c","infoHashBuffer":{"type":"Buffer","data":[105,187,177,146,37,53,9,108,223,229,182,128,220,26,206,42,100,130,29,108]},"announce":[],"urlList":[]}}