{"title":"FSX - Majestic Dash 8 Q400 [RAR]","uid":8453431,"size":385447816,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6ace67f2aa9ca337aa3087552da426ed0d2f5f38&amp;dn=FSX+-+Majestic+Dash+8+Q400+%5BRAR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RANDOOMSHIT","files":-1,"time":1368053331,"description":"The Majestic Software Dash 8 Q-400 for FSX is a highly realistic rendition of Bombardier's twin-engined turboprop regional airliner. Since entering service in 2000, over 450 Q-400 aircraft have been delivered to a diverse range of airlines around the world. Powered by two Pratt &amp; Whitney PW150A turboprop engines, the Q-400 can carry 78 passengers up to 1,500 miles at 360 knots, not much slower than its regional jet competitors.\n\nThis ground-breaking simulation features a flight dynamics engine that operates independently from FSX, providing you with incredibly realistic performance and behaviour, as well as accurate icing effects.\n\nA fully functioning virtual cockpit is included and features FMS, weather radar, TCAS, glass cockpit displays and an authentic autopilot system, all closely matching the real aircraft.\n\n19 high-resolution airline liveries are included, representing operators from every corner of the globe. Customisable automated cabin announcements and an independently operating 3D sound system make this the most immersive airliner to date! \n\nUncracked EXE FILE. Hoping one of you guys can get this thing going! This is my contribution, and my first upload.\n\nExtract by unpackaging it somewhere on your PC.\t\t","torrent":{"xt":"urn:btih:6ace67f2aa9ca337aa3087552da426ed0d2f5f38","amp;dn":"FSX+-+Majestic+Dash+8+Q400+%5BRAR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ace67f2aa9ca337aa3087552da426ed0d2f5f38","infoHashBuffer":{"type":"Buffer","data":[106,206,103,242,170,156,163,55,170,48,135,85,45,164,38,237,13,47,95,56]},"announce":[],"urlList":[]}}