{"title":"Bigasoft.AVCHD.Converter.v3.7.36.4825.Incl.Keymaker","uid":8343138,"size":11382137,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6af3052de3759d794e6b782bb7b9a74b0ac1e1ad&amp;dn=Bigasoft.AVCHD.Converter.v3.7.36.4825.Incl.Keymaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pspxxx","files":4,"time":1365136621,"description":"Bigasoft AVCHD Converter\n \nIt's that fast and easy to edit and convert AVCHD videos!\n\nBigasoft AVCHD Converter is easy to use, fast and omnipotent AVCHD video converter and AVCHD video editor software. It can convert AVCHD HD-camcorder video in MTS, M2TS, MOD, TOD to a broad video formats including convert AVCHD to QuickTime, convert AVCHD to AVI, convert AVCHD to MP4, convert AVCHD to WMV, convert AVCHD to MKV, MPG, RM, RMVB, DivX, XViD, WebM, VP8 and more, and convert AVCHD to HD videos. It fully supports HD camcorder of Canon, Hitachi, JVC, Leica Camera, Panasonic, and Sony and can performs as a Panasonic AVCHD converter, Sonny AVCHD converter and Canon AVCHD converter. \n\nMain Functions:\n\n1. Convert AVCHD to all general Video formats\n\nConvert AVCHD to MP4, AVI, MOV and other popular video formats with high quality.\n\n2. Convert AVCHD to HD Videos\n\nConvert camcorder and HDV AVCHD videos to HD videos like HD AVI, HD MPEG4, HD WMV, HD VOB, HD ASF, H.264/MPEG-4 AVC, MKV, HD WMV, etc.\n\n3. Convert AVCHD to portable devices \n\nOptimizes and presets ready video for a bulk of portable devices including AVCHD to iPad, AVCHD to iPod, AVCHD to iPhone, Zune, Zune HD, Xbox, PSP, PSP 2 and more.\n\n4. Convert AVCHD to media players\n\nConvert AVCHD to DivX/XivD players and convert AVCHD to QuickTime Players and more with high quality video footage and sound quality.\n\n5. Extract audio from AVCHD videos\n\nRip audio and music from recorded videos and save them as AAC, MP3, M4A, WMA, WAV, RA, AC3, OGG and more.\n\n6. AVCHD Editor\n\nEasily trim, crop, merge, rotate videos, add watermark to authorize videos, adjust video brightness, saturation and contrast, and add multiple sound tracks and subtitles and more.\n ","torrent":{"xt":"urn:btih:6af3052de3759d794e6b782bb7b9a74b0ac1e1ad","amp;dn":"Bigasoft.AVCHD.Converter.v3.7.36.4825.Incl.Keymaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af3052de3759d794e6b782bb7b9a74b0ac1e1ad","infoHashBuffer":{"type":"Buffer","data":[106,243,5,45,227,117,157,121,78,107,120,43,183,185,167,75,10,193,225,173]},"announce":[],"urlList":[]}}