{"title":"Free - The future of a radical Price - Chris Anderson","uid":8468732,"size":302357993,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6c16e84db5960cbe127f2ace9f8c0e7cdfbe4fd3&amp;dn=Free+-+The+future+of+a+radical+Price+-+Chris+Anderson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kukamonga","files":22,"time":1368428029,"description":"What happens when advances in technology allow many things to be produced for more or less nothing? And what happens when those things are then made available to the consumer for free?\n\nIn his groundbreaking new book, The Long Tail author Chris Anderson considers a brave new world where the old economic certainties are being undermined by a growing flood of free goods - newspapers, DVDs, T shirts, phones, even holiday flights. He explains why this has become possible - why new technologies, particularly the Internet, have caused production and distribution costs in many sectors to plummet to an extent unthinkable even a decade ago. He shows how the flexibility provided by the online world allows producers to trade ever more creatively, offering items for free to make real or perceived gains elsewhere. He pinpoints the winners and the losers in the Free universe. And he demonstrates the ways in which, as an increasing number of things become available for free, our decisions to make use of them will be determined by two resources far more valuable than money: the popular reputation of what is on offer and the time we have available for it. In the future, he argues, when we talk of the 'money economy' we will talk of the 'reputation economy' and the 'time economy' in the same breath, and our world will never be the same again.","torrent":{"xt":"urn:btih:6c16e84db5960cbe127f2ace9f8c0e7cdfbe4fd3","amp;dn":"Free+-+The+future+of+a+radical+Price+-+Chris+Anderson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c16e84db5960cbe127f2ace9f8c0e7cdfbe4fd3","infoHashBuffer":{"type":"Buffer","data":[108,22,232,77,181,150,12,190,18,127,42,206,159,140,14,124,223,190,79,211]},"announce":[],"urlList":[]}}