{"title":"Red Demon Collection in Black Cat Comics 1946","uid":8473612,"size":76240696,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6d0992dab32c242cdc76850b71162fa6bba54890&amp;dn=Red+Demon+Collection+in+Black+Cat+Comics+1946&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mothra67","files":-1,"time":1368554772,"description":"another obscure hero\n\n\nJudge Straight started out as an all-star lawyer who became the youngest jurist in the state. After the wife of the man he sentanced to death criticised him for too closely following the letter of the law instead of his heart and being out of touch with the downtrodden, Straight decides to wander the streets at night.\n\nComing across a black cat belonging to Bull Brewster, gang leader and murder victim of his last trial, he takes the cat to the victim's address and poses as a thief looking for refuge to a member of the Brewster gang living there to take a look around. After being put up in Brewster's old room for the night, Straight finds a demon costume Brewster was wearing when he was murdered and decides to wear it. Finding evidence of Brewster's real killer, Straight confronts the Eel, defeats him and rushes him to the police so the man wrongfully convicted of murder can be set free. Straight would later stuggle with the problem of harshly judging defendants in court, then feel guilty of his judgement to the point where he was compelled to investigate the case on his own, often proving his original judgement to be incorrect.\n\nHe had no powers, but was a skilled fighter and operated from a secret lair. \n\n\nSeed for all to enjoy    sharing is caring","torrent":{"xt":"urn:btih:6d0992dab32c242cdc76850b71162fa6bba54890","amp;dn":"Red+Demon+Collection+in+Black+Cat+Comics+1946","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0992dab32c242cdc76850b71162fa6bba54890","infoHashBuffer":{"type":"Buffer","data":[109,9,146,218,179,44,36,44,220,118,133,11,113,22,47,166,187,165,72,144]},"announce":[],"urlList":[]}}