{"title":"Swing.iso","uid":8393139,"size":220094464,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6fe3971038574336615fc4e6218534827acb19e8&amp;dn=Swing.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"irisjaak","files":1,"time":1366488992,"description":"Swing is a computer puzzle game, released for the PlayStation and PC, developed in Germany by the now defunct Software 2000. In the USA, a similar game was released under the name &quot;Marble Master&quot;. A downgraded version of the game was released for the Game Boy Color.\nReleased in 1997, the object of the game is to score points by dropping balls onto sets of see-saws, in rows of three or more of the same colour. The twist, however, is that each ball has a different weight, determined by the number written on the front of it. The higher the number, the heavier the ball. This means that if a ball is placed onto one side of the see-saw which is heavier than the total value of the balls on the other side, the balance would be upset, sending the top ball flying across the playing field to land on another column. Cascade 'throws' can be achieved, and you die if a column reaches too tall. A variety of bonus balls, all with special uses, also feature.\nDespite its originality, the game was not a commercial success. In the UK, the Official UK PlayStation Magazine gave the game 6 out of 10. According to them, the game was just 'another tetris clone'.[citation needed]\nIn 1999, a sequel was released: Swing Plus: Total Mind Control. The game was never released outside Germany.[1]\nIn 2008, a Java remake has been made: &quot;XSwing Plus&quot;.[2]\n\nDL Mount or burn \n\nMount or burn\n\nInstall\n\nPlay","torrent":{"xt":"urn:btih:6fe3971038574336615fc4e6218534827acb19e8","amp;dn":"Swing.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe3971038574336615fc4e6218534827acb19e8","infoHashBuffer":{"type":"Buffer","data":[111,227,151,16,56,87,67,54,97,95,196,230,33,133,52,130,122,203,25,232]},"announce":[],"urlList":[]}}