{"title":"Eisen - The Chosen People in America - A Study in Jewish Religio","uid":8417543,"size":1363275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70d1fde903737a38e33bad37f1123b3bd4ac1bc5&amp;dn=Eisen+-+The+Chosen+People+in+America+-+A+Study+in+Jewish+Religio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367086927,"description":"This is Arnold M. Eisen's amazing book The Chosen People in America - A Study in Jewish Religious Ideology (1983) which charts the attempts of American Jewish thinkers to adapt the notion of chosenness to an American context. Through an examination of sermons, essays, debates, prayer-book revisions, and theological literature, Eisen traces the ways in which American rabbis and theologians - Reconstructionist, Conservative, and Orthodox thinkers - effected a compromise between exclusivity and participation that allowed Jews to adapt to American life while simultaneously enhancing Jewish tradition and identity. Although for centuries the notion of &quot;The Chosen People&quot; sustained Jewish identity, America, by offering Jewish immigrants an unprecedented degree of participation in the larger society, threatened to erode their Jewish identity and sense of separateness.The Chosen People in America is a masterful study, based almost entirely on primary sources and a pioneering attempt to examine how a variety of thinkers - great and not-so-great - tackled what the author calls &quot;the essential dilemma facing American Jews&quot;: the problem of chosenness. As he poses it - the conflict over whether to remain apart as a &quot;chosen people&quot; or to participate fully in American life. In tracing the encounter of Jews (the chosen people) and America (the chosen nation), Eisen has given the American Jewish community a new understanding of itself. 230 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:70d1fde903737a38e33bad37f1123b3bd4ac1bc5","amp;dn":"Eisen+-+The+Chosen+People+in+America+-+A+Study+in+Jewish+Religio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70d1fde903737a38e33bad37f1123b3bd4ac1bc5","infoHashBuffer":{"type":"Buffer","data":[112,209,253,233,3,115,122,56,227,59,173,55,241,18,59,59,212,172,27,197]},"announce":[],"urlList":[]}}