{"title":"1Tap Cleaner Pro v2.10","uid":8458579,"size":1783762,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:72ea34e066422921b34c5eca41df235918890a36&amp;dn=1Tap+Cleaner+Pro+v2.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Doubzstep","files":-1,"time":1368167962,"description":"1-Tap to clean all cache, search histories and calls log. A default cleaner is also included.\nAre you running out of application storage?\nYou now can get more available storage space by clearing apps created cache/data files.\n\n    Cache Cleaner\n    History Cleaner\n    Call/Text log Cleaner\n    Default Cleaner\n\nThere are four cleaners included in this app. Cache Cleaner, History Cleaner and Call/Text log Cleaner help you to get more free space for the internal phone storage by clearing apps cached files, data files, or search/navigation history records. If you have selected to launch apps by default for some actions. Default Cleaner helps you to clear the default settings.\n\nAuto or 1-tap to clear all cache, search history, calls log and the best is you don't have to ROOT the phone anymore! This app is crucial to anyone who has memory management issues.\n\nFeatures:\n\n    1-tap to clear all cached files\n    1-tap to clear all search and browser navigation history records\n    1 tap to clear calls log (incoming, outgoing, missed, frequently contacted)\n    list all default apps and clear selected defaults\n    home screen widget shows cache and available size\n    auto clear all cache and history at a specified interval\n    auto clear cache when the device is low on internal storage space\n    clear cache or history for a specified application\n    notify you on startup if more than 500K bytes cache used\n    list applications by either cache, data, code, total size or app name\n    view application on Market\n    uninstall application\n    open application\n    show application details page\n\nWhat's in this version : (Updated : May 9, 2013)\n\n    new &quot;Cache checker&quot; function that periodically checks the cache size and notifies you when cache size greater than you specified value\n    added &quot;Clear all&quot; menu item to side menu\n    fixed battery drain issue, also removed WAKE_LOCK permission\n    changed to use &quot;Light gray&quot; as default theme\n    require Internet permission for sending crash report\n    bugs fixed\n\nRequired Android O/S : 2.1+\n\n*************************************************************\n\nJust install!","torrent":{"xt":"urn:btih:72ea34e066422921b34c5eca41df235918890a36","amp;dn":"1Tap+Cleaner+Pro+v2.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ea34e066422921b34c5eca41df235918890a36","infoHashBuffer":{"type":"Buffer","data":[114,234,52,224,102,66,41,33,179,76,94,202,65,223,35,89,24,137,10,54]},"announce":[],"urlList":[]}}