{"title":"The Secret Lives of Dresses~ariane.c","uid":8463473,"size":1578685,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73c50fe51edf8488a6b7fc238202a290c7e3debd&amp;dn=The+Secret+Lives+of+Dresses%7Eariane.c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ariane_c","files":3,"time":1368301496,"description":"The Secret Lives of Dresses\n\nPublisher: 5 Spot; 1 edition (February 10, 2011)  PDF,  EPUB\n\nDora has always taken the path of least resistance. She went to the college that offered her a scholarship, is majoring in &quot;vagueness studies,&quot; and wears whatever shows the least dirt. She falls into a job at the college coffee shop, and a crush on her flirty boss, Gary.\n\nJust when she's about to test Gary's feelings, Mimi, the grandmother who raised her, suffers a stroke. Dora rushes back home to Forsyth, NC, and finds herself running her grandmother's vintage clothing store. The store has always been a fixture in Dora's life; though she grew up more of a jeans-and-sweatshirt kind of girl, before she even knew how to write, Mimi taught her that a vintage 1920s dress could lift a woman's spirit.\n\nWhile working there, Dora befriends Mimi's adorable contractor, Conrad. Is he after Dora, or is working from a different blueprint? And why did Mimi start writing down--and giving away--stories of the dresses in her shop?\n\nWhen Mimi dies, Dora can't get out of town fast enough and cedes control of the store to her money-hungry aunt who wants to turn it into a t-shirt shop for tourists. But ultimately, she returns to Forsyth, willing to battle whatever may stand in the way of her staying there. Dora can trade her boring clothes for vintage glamour, but can she trade her boring life for one she actually wants?\n\nAbout the Author\nErin McKean is the blogger behind A Dress A Day, the inspiration for this novel. Her writing has been featured in many media outlets from The NY Times Magazine to Foreign Affairs. She currently works as the editor of VERBATIM, and was previously at OUP. ","torrent":{"xt":"urn:btih:73c50fe51edf8488a6b7fc238202a290c7e3debd","amp;dn":"The+Secret+Lives+of+Dresses%7Eariane.c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c50fe51edf8488a6b7fc238202a290c7e3debd","infoHashBuffer":{"type":"Buffer","data":[115,197,15,229,30,223,132,136,166,183,252,35,130,2,162,144,199,227,222,189]},"announce":[],"urlList":[]}}