{"title":"Flag Archives Vol1. Ace Comics 1941 Golden Age","uid":8439173,"size":80393901,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:748c7aa249ec04b23ad7c30e7c9951f66a484477&amp;dn=Flag+Archives+Vol1.+Ace+Comics+1941+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367721312,"description":"Jim Courtney was found as an infant on the doorstep of John Courtney, a crippled war veteran and flag maker. John discovered that Jim had an American flag birthmark. On his 21st birthday, Jim was visited by the spirits of George Washington and Abraham Lincoln and told that he had &quot;the speed of the wind and the strength of a 100 men&quot; as well as invulnerability to all weapons. He left a star-spangled trail behind him whenever he ran. His birthmark glowed whenever somebody called the Flag for help. Jim now uses these powers to fight the enemies of America.\n\nIf another person touches his birthmark, they can gain his powers. [1]\nFlag 002 PromoPromo ad for the Flag's first appearance.Lightning Comics #v2#3 (October 1941)\nRoygbiv666Added by Roygbiv666\n\nIn Our Flag Comics #2, Flag-Man went up against Herman Foxson, a wealthy industrialist who orchestrated a complex conspiracy in order to become a fascist dictator of United States. He used the newspapers he owned to weaken American morale and his mechanical plant to build the bombers, tanks and other war machinery. He got help from Sally Blair, a reporter for Daily Clarion, one of the newspapers Foxson acquired to further his plan. Sally was the only reporter not to go along with Foxson's conspiracy, and, when Foxson and his co-conspirators were arrested, she became the managing editor of the Daily Clarion.\n\nIn another story, a high compression bomb catches him unawares and he is left for dead, in a coma for two days. The ghosts of Washington, Lincoln, and another appear and give him back his life and powers. ","torrent":{"xt":"urn:btih:748c7aa249ec04b23ad7c30e7c9951f66a484477","amp;dn":"Flag+Archives+Vol1.+Ace+Comics+1941+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"748c7aa249ec04b23ad7c30e7c9951f66a484477","infoHashBuffer":{"type":"Buffer","data":[116,140,122,162,73,236,4,178,58,215,195,14,124,153,81,246,106,72,68,119]},"announce":[],"urlList":[]}}