{"title":"Byzantium Linux v0.3.2a (Taxi Cat) - Hybrid ISO image","uid":8478250,"size":344981734,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:74dd624d3338a337bb5867a0c6dcf0d58b21f6c4&amp;dn=Byzantium+Linux+v0.3.2a+%28Taxi+Cat%29+-+Hybrid+ISO+image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"warehouse23","files":2,"time":1368669388,"description":"Project Byzantium, a working group of HacDC (http://hacdc.org/) is proud to announce the release of v0.3.2 alpha of Byzantium Linux, a live distribution of Linux which makes it fast and easy to construct an ad-hoc wireless mesh network which can augment or replace the current telecommunications infrastructure in the event that it is knocked offline (for example, due to a natural disaster) or rendered untrustworthy (through widespread surveillance or disconnection by hostile entities).  Byzantium Linux is designed to run on any x86 computer with at least one 802.11 a/b/g/n wireless interface.  Byzantium can be burned to optical disk (the .iso image is around 330 megabytes in size), booted from an external hard drive, or can even be installed in parallel with an existing operating system without risk to the user's data and software.  Byzantium Linux will create a mesh node, automatically configure itself, and then connect to other mesh nodes where it acts as an access point for wifi-enabled devices.\n\nThis release builds upon the advances made in previous releases and adds much-requested support for Intel-based Macbooks.\n\nIf you are a Mac user, we recommend downloading this hybrid ISO image.  Write it to a USB key with the 'dd' command and reboot while holding down the Option key.  Select the 'Windows' device to boot Byzantium Linux.\n\nFor more information, please visit our homepage at http://project-byzantium.org/.\n","torrent":{"xt":"urn:btih:74dd624d3338a337bb5867a0c6dcf0d58b21f6c4","amp;dn":"Byzantium+Linux+v0.3.2a+%28Taxi+Cat%29+-+Hybrid+ISO+image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74dd624d3338a337bb5867a0c6dcf0d58b21f6c4","infoHashBuffer":{"type":"Buffer","data":[116,221,98,77,51,56,163,55,187,88,103,160,198,220,240,213,139,33,246,196]},"announce":[],"urlList":[]}}