{"title":"299 Days The Community - Glen Tate [PDF, Epub]","uid":8486291,"size":1368963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:769bd2d95865a1f7605ca4974d1705b2d4851647&amp;dn=299+Days+The+Community+-+Glen+Tate+%5BPDF%2C+Epub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"James_WB","files":4,"time":1368874782,"description":"299 Days: The Community, the third book in the 299 Days series, reunites Grant Matson with his family after his wife, children, and in-laws accept that the only way to survive the Collapse is to flee the comfort of their suburban lives and join him at his isolated cabin in the woods. With riots becoming more violent, power outages more widespread, and the military crumbling, Grant and others throughout Washington State realize they must organize if they want to endure. From the secure confines of the relocated state capitol building, to a rural self-sustaining farm, to the developing community of Pierce Point, 299 Days: The Community explores the mental, emotional, and physical changes everyone must make to adapt to a collapsed society. The years of preparing and training position Grant to lead Pierce Point as he begins to navigate complex interpersonal dynamics and unpredictable situations to help build a new community that can withstand the threats closing in on them. Will people join forces or stand alone? Can communities successfully organize themselves in times of chaos? Will what is left of government help those who cannot help themselves? And if so, at what cost?","torrent":{"xt":"urn:btih:769bd2d95865a1f7605ca4974d1705b2d4851647","amp;dn":"299+Days+The+Community+-+Glen+Tate+%5BPDF%2C+Epub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"769bd2d95865a1f7605ca4974d1705b2d4851647","infoHashBuffer":{"type":"Buffer","data":[118,155,210,217,88,101,161,247,96,92,164,151,77,23,5,178,212,133,22,71]},"announce":[],"urlList":[]}}