{"title":"Microsoft Bookshelf Basics","uid":8401589,"size":287132964,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:76e51fb8c04c77d1025d8d88915265ea37b4922a&amp;dn=Microsoft+Bookshelf+Basics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LedHead54","files":199,"time":1366712141,"description":"Microsoft Bookshelf Basics. Extracted from Microsoft Office 97 Academic version by LedHead54.  Nothing added or changed, no viruses, malware, spyware, etc.\n\nNo installation necessary.  Copy the folder to the desired location. Navigate to the application file named 'BS96SE' located in the folder named 'AAMSTP'. Create a shortcut to this file and place it on your desktop, start  menu, task bar, or wherever. It's ok to rename the file/shortcut to something you can recognize (ex: Bookshelf Basics).  Once you get the shortcut done click on it and a dialog box will open asking you to &quot;Please insert the Bookshelf Basics Disc in the CD-ROM Drive. If the drive letter shown below is not the correct drive, please change it.&quot;  In the box labeled &quot;Drive&quot; copy and paste the location of the application file (ex: C:Program Files (x86)Microsoft Bookshelf Basics).  Make sure you add the name of the folder to the end of the address. \n\nThat's it. Now run the application and look up words like George Carlin's &quot;The Seven Words You Can Never Say On TV&quot; (Shit, Piss, Fuck, Cunt, CockSucker, MotherFucker, and Tits) and have them spoken to you through your computer. \n\nJust like Jumpin' Jack Flash, Its a Gas! Gas! Gas! \n\nPeace.","torrent":{"xt":"urn:btih:76e51fb8c04c77d1025d8d88915265ea37b4922a","amp;dn":"Microsoft+Bookshelf+Basics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e51fb8c04c77d1025d8d88915265ea37b4922a","infoHashBuffer":{"type":"Buffer","data":[118,229,31,184,192,76,119,209,2,93,141,136,145,82,101,234,55,180,146,42]},"announce":[],"urlList":[]}}