{"title":"The Tinners Corpse.mp3","uid":8450615,"size":54496505,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7964393ee2b2de5c132f67f7651350b46fe3cba8&amp;dn=The+Tinners+Corpse.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pigman58","files":1,"time":1367989615,"description":"When Crowner John is summoned to the bleak Devonshire moors to investigate the murder of a tin miner, he has little idea how difficult this new investigation will prove to be. The victim is a trusted and well-loved overman of Devon's most powerful and successful mine owner, Walter Knapman. There seems to be only one possible motive - to sabotage Walter's business. But the tinners have their own laws, and they are none too pleased at Crowner John's interference. Especially as their main experience of officials has been with Sheriff Richard de Revelle, whose notoriously high taxes keep them in a permanent state of fury and near rebellion. And then Walter disappears. Stephen Acland, Walter's business rival wastes no time in comforting Walter's beautiful wife Joan, who appears remarkably unmoved by her husband's disappearance. Meanwhile, Walter's brother is going frantic with worry ...or could it be guilt? A decapitated body, a missing tinner, a disgruntled band of miners and a mad Saxon, intent on the destruction of all things Norman. How on earth can Crowner John sort all this out when his wife hates him, his mistress has spurned him for a younger man, and his clerk is in the grip of a suicidal depression? Only Gwyn, Crowner John's indispensable right-hand man seems to be of any help at all, until he is arrested for murder and put on trial for his life.","torrent":{"xt":"urn:btih:7964393ee2b2de5c132f67f7651350b46fe3cba8","amp;dn":"The+Tinners+Corpse.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7964393ee2b2de5c132f67f7651350b46fe3cba8","infoHashBuffer":{"type":"Buffer","data":[121,100,57,62,226,178,222,92,19,47,103,247,101,19,80,180,111,227,203,168]},"announce":[],"urlList":[]}}