{"title":"Julie Myerson The Lost Child 2012 Retail EPUB eBook-BitBook","uid":8233138,"size":2313961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a3c9fd6ebe39e6e9d6e89372578c1d25c22702d&amp;dn=Julie+Myerson+The+Lost+Child+2012+Retail+EPUB+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BlackTar","files":3,"time":1362772404,"description":" |                             The Lost Child                                 |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-06-06  SIZE: 2,16MB   DISKS: 01_______4,77MB      PAGES:        |\n |                                                                            |\n | PUBLISHER: Bloomsbury Publishing             GENRE: Biography              |\n |                                                                            |\n | AUTHOR: Julie Myerson                                                      |\n |                                                                            |\n | FORMAT: EPUB   PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://is_gd/qEXuq0                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: 9781408830246                                    |\n :                                                                            :\n : While researching her next book, Julie Myerson finds herself in            :\n : arcumstances are very different, but the questions remain terrifyingly the :\n : same. What happens when a child disappears from a family? What will survive:\n : of any of us in memory or in history? And how is a mother to cope when love:\n : is not enough? For readers of Beautiful Boy and Hurry Down Sunshine, a     :\n : deeply personal and moving account of two lost children separated by two   :\n : centuries. Julie Myerson is the author of seven novels, including Something:\n : Might Happen, and two works of nonfiction, including Home. She lives in    :\n : London and Suffolk with her husband and teenage children. graveyard,       :\n : looking for traces of a young woman who died nearly two centuries before.  :\n : As a child in Regency England, Mary Yelloly painted an exquisite album of  :\n : watercolors that uniquely reflected the world in which she lived. But Mary :\n : died at the age of twenty-one, and when Julie comes across this album, she :\n : is haunted by the potential never realized. She is also reminded of her own:\n : child.Only days earlier, Julie and her husband locked their eldest son out :\n : of the family home. He is just seventeen. After a happy childhood, he had  :\n : discovered drugs, and it had taken only a matter of months for the boy to  :\n : completely lose his way and propel his family into daily chaos. Julie-whose:\n : emotionally fragile relationship with her own father had left her          :\n : determined to love her children better-had to accept that she was powerless:\n : to bring him back.Honest, warm, and profoundly moving, this is the parallel:\n : story of a girl and a boy separated by centuries. Julie Myerson is the     :\n : author of seven novels, including Something Might Happen, and two works of :\n : nonfiction, including Home. She lives in London and Suffolk with her       :\n : husband and teenage children.                                              :","torrent":{"xt":"urn:btih:7a3c9fd6ebe39e6e9d6e89372578c1d25c22702d","amp;dn":"Julie+Myerson+The+Lost+Child+2012+Retail+EPUB+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a3c9fd6ebe39e6e9d6e89372578c1d25c22702d","infoHashBuffer":{"type":"Buffer","data":[122,60,159,214,235,227,158,110,157,110,137,55,37,120,193,210,92,34,112,45]},"announce":[],"urlList":[]}}