{"title":"Queen - I [24 bit FLAC] vinyl","uid":8233330,"size":845336566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7ce4424f071df2bdca69273b3c6457d2edcd8591&amp;dn=Queen+-+I+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"24.96","files":-1,"time":1362778333,"description":"  Queen - I (1973) [24 bit FLAC] vinyl\n\n  Released: 1973\n  Genre: Pop/Rock\n  Style: Arena Rock, Glam Rock\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Keep Yourself Alive\n  02. Doing All Right\n  03. Great King Rat\n  04. My Fairy King\n  05. Liar\n  06. The Night Comes Down\n  07. Modern Times Rock 'n' Roll\n  08. Son And Daughter\n  09. Jesus\n  10. Seven Seas Of Rhye\n\n  Like any patchy but promising debut from a classic rock group, it's often easy to underrate Queen's eponymous 1973 debut, since it has no more than one well-known anthem and plays more like a collection of ideas than a cohesive album. But what ideas! Almost every one of Queen's signatures are already present, from Freddie Mercury's operatic harmonies to Brian May's rich, orchestral guitar overdubs and the suite-like structures of &quot;Great King Rat.&quot; That rich, florid feel could be characterized as glam, but even in these early days that appellation didn't quite fit Queen, since they were at once too heavy and arty to be glam and -- ironically enough, considering their legendary excess -- they were hardly trashy enough to be glam. But that only speaks to the originality of Queen: they may have traded in mystical sword 'n' sorcerers themes like so many '70s prog bands, and they may have hit as hard as Led Zeppelin (and Jimmy Page's guitar army certainly was a forefather to May's overdubs), but they didn't sound like anybody else, they were too odd in their theatricality to be mistaken for another band. That much was apparent on this debut, but one thing was crucially missing: songs that could coalesce their sound and present it in a memorable fashion. There is an exception to that rule -- the wild, rampaging opener &quot;Keep Yourself Alive,&quot; one of their very best songs -- but too often the album plays like a succession of ideas instead of succinct songs, and the group's predilection for suites only highlights this, despite the occasional blast of fury like &quot;Modern Times Rock &amp; Roll.&quot; This can be quite appealing as sheer, visceral sound and, in that regard, Queen is kind of irresistible. It showcases the band in all their ornate splendor yet it's strangely lean and hard, revealing just how good the band was in their early days as a hard rock band. That might not quite make it an overlooked gem -- it remains patchy on a song for song basis -- but it sure makes for an interesting debut that provides a rough road map to their later work.","torrent":{"xt":"urn:btih:7ce4424f071df2bdca69273b3c6457d2edcd8591","amp;dn":"Queen+-+I+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ce4424f071df2bdca69273b3c6457d2edcd8591","infoHashBuffer":{"type":"Buffer","data":[124,228,66,79,7,29,242,189,202,105,39,59,60,100,87,210,237,205,133,145]},"announce":[],"urlList":[]}}