{"title":"Daddy Knows Best 3 (2013)","uid":8264859,"size":1404905030,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7ceee476cfefaee0c29b48291562a3f48954104c&amp;dn=Daddy+Knows+Best+3+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SplashPt","files":1,"time":1363464765,"description":"Daddy Knows Best 3 (2013) \n\nPorn legend Sean Michaels is a performer/director with a lifetime of sexualface\nexperience he enjoys imparting to the new generation of XXX sluts. When a young\nwoman needs a guiding hand, some wise words or a massive, throbbing black cock Sean\nis there to help them make sense of their raging hormones and randy desires. Daddy\nKnows Best 3 is the veteran pornographers latest batch of sizzling vignettes with\nbeautiful bombshells who crave the steady groove of a confident authority figure\nDestiny Dymes, a sweet, dark chocolate student sporting nerdy glasses, is looking\nfor some private tutoring from the famous Mr. Michaels. The adorable, impossibly\nvoluptuous girl hikes up her skirt and strokes her juicy cunt, then kneels and\nworships the directors massive dick. He pounds her thoroughly and decorates Destinys\npretty face with hot cum. Next, sultry white girl Giselle Leon needs a session of\ninterracial counseling from Daddy. He pumps the slender cutie full of black meat and\nejaculates his approval all over her lovely Big, bodacious MILF Shay Fox contacts\nProfessor Michaels for some classroom tutoring, passionate fucking and a creamy\nload across her massive boobs. Thick, ebony BBW Jayden Starr gets her gigantic booty\nand huge, wobbling tits tamed by the masterful director, who bangs the luscious, phat\nbabe and sprays Jayden with sticky goo. For the insufferably horny girls in this cast\ntheres no substitute for a seasoned pro, and their Daddy Knows Best 3\n\nDestiny Dymes, Gisselle Leon, Sean Michaels, Jayden Starr, Shay Fox\n\nAll Sex, Interracial, Legal Teen, Big Dicks\n\nScreens:\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=zbl8rxu6bgjt3tw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=zbl8rxu6bgjt3tw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=5ok8dml7ifcrrau.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=5ok8dml7ifcrrau.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7ceee476cfefaee0c29b48291562a3f48954104c","amp;dn":"Daddy+Knows+Best+3+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ceee476cfefaee0c29b48291562a3f48954104c","infoHashBuffer":{"type":"Buffer","data":[124,238,228,118,207,239,174,224,194,155,72,41,21,98,163,244,137,84,16,76]},"announce":[],"urlList":[]}}