{"title":"WinImage Pro v9.0 with Key [TorDigger]","uid":8443141,"size":751373,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d1612920fb4180d262440f20fbf8b184950f028&amp;dn=WinImage+Pro+v9.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":9,"time":1367822277,"description":"WinImage Pro\n\nWinImage is a fully-fledged disk-imaging suite for easy creation, reading and editing of many image formats and fileystems, including DMF, VHD, FAT, ISO, NTFS and Linux. The disk image is an exact copy of a physical disk (floppy, CD-ROM, hard disk, USB, VHD disk, etc.) or a partition that preserves the original structure. With WinImage in place, you can recreate the disk image on the hard drive or other media, view its content, extract image-based files, add new files and directories, change the format, and defragment the image. All this and more is delivered in one intuitive user interface that enables imaging right out of the box.\n\nThe program has many utilitarian uses at home and in the office. As a serious PC user, you probably have tons of old but still useful floppy disks. With WinImage in place, you can turn them into disk images, which can be stored on the hard drive and recreated, when a need arises. In combination with a CD creating tool, WinImage can help you create your own custom boot disk with hardware diagnostic or virus cleaning software to bring a problem PC back up and running without being in Windows. As a hard-disk backup solution, WinImage allows you to save hours and even days restoring a system and configurations on a machine that has experienced a hard-disk crash or software corruption. Along with homes and offices, this ability is a must for training classes, where restoring torn down PC configurations quickly is critical. \n\nSupported OS:\n\nWindows Windows XP, Windows 2003/2008 server, Windows Vista, Windows Seven\n\nHomepage: http://www.winimage.com\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:7d1612920fb4180d262440f20fbf8b184950f028","amp;dn":"WinImage+Pro+v9.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d1612920fb4180d262440f20fbf8b184950f028","infoHashBuffer":{"type":"Buffer","data":[125,22,18,146,15,180,24,13,38,36,64,242,15,191,139,24,73,80,240,40]},"announce":[],"urlList":[]}}