{"title":"Balae Pandiya (1962) Tamil - Xvid 1cd - Eng Subs [DDR]","uid":8460249,"size":795923093,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7dd98b1cd7d8f80d1548e739e91f42abc9ac4863&amp;dn=Balae+Pandiya+%281962%29+Tamil+-+Xvid+1cd+-+Eng+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1368215626,"description":"Balae Pandiya (1962) Tamil - Xvid 1cd - Eng Subs [DDR]\n\nBale Pandiya is a 1962 Tamil comedy film directed by B.R. Panthulu. \nStarring Sivaji Ganesan, Devika and M.R. Radha in the lead roles, the music was scored by M.S.Viswanathan and T.K. Ramamoorthy. \nIt is the first film to feature Sivaji Ganesan in three distinct roles.\nBale Pandiya was very well received, and was rated a &quot;blockbuster&quot;.\nIt was moreover famous for its comedy tracks.\n\nCAST:-\nSivaji Ganesan - Bale Pandiya / Marudhu / Shankar\nM. R. Radha - Kabali (Marudhu's Boss) / Amritha Lingam (Geetha's Father)\nDevika - Geetha, Lead Female Actor\nK. Balaji - Ravi, Cousin of Geetha\n\nDirected by B.R. Panthulu\nMusic by M.S. Viswanathan &amp; T.K. Ramamoorthy\nLyrics by Kannadasan.\n\nSongs are included in MP3s\nBalae Pandiya (1962) Tamil 00. Title Music and Screen Credits, M.S. Viswanathan &amp; T.K. Ramamoorthy\nBalae Pandiya (1962) Tamil 01. Vaazha Ninaiththaal - 1, TM. Sounderarajan, P. Susheela, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 02. Nan Ena Sollivetain, T.M. Soundararajan, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 03. Yarai Enge Vaipad Endru, T.M. Soundararajan, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 04. Neye Unak Endru, TM. Sounderarajan, M. Raj, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 05. Aadhi Manidhan, P.B. Sreenivas, K. Jamuna Rani, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 06. Athi Kai Kai, Soundararajan, Susheela, Sreenivas, Jamuna Rani, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 07. Vaazha Ninaiththaal - 2, TM. Sounderarajan, P. Susheela, Kannadasan, Vishwanathan\nBalae Pandiya (1962) Tamil 08. Athi Kai Kai .. END SONG\n\nSYNOPSIS:- Balae Pandiya (1962) Tamil\nBale Pandiya (Sivaji Ganesan) is a young man who leads a troubled life. He is continuously being chased by Marudhu (also Sivaji Ganesan) - a look-alike of him and Marudhu's boss Kabali (M.R. Radha), who would be given a lot of money if they killed Pandiya. While being chased by them once, he gets into a runaway car being driven by an insane young girl. The car crashes, but the girl gets cured from her insanity. Her father allows Pandiya, who is homeless, to stay with them. Parallelly, Pandiya falls for Geetha (Devika) and her father Amritha Lingam (also M. R. Radha) accepts the romance. But Marudhu and Kabali's pursuit for Pandiya still continues, and they successfully toss him into the sea. However Pandiya's elder brother Shankar (also Sivaji Ganesan), a scientist finds out about everything and agrees to help. He pretends to be Pandiya after faking his own death and confronts Marudhu and Kabali, making them shocked to see &quot;Pandiya&quot; alive. Just then, the real Pandiya steps in, revealing that two fisherman saved him from drowning and hell breaks loose. The two brothers battle the criminals and in the process, Kabali accidentally shoots Marudhu dead. Saddened by the death of his friend, he commits suicide. So Pandiya and Geetha are re-united.\n\nShortly before his trip to the United States, Sivaji Ganesan had signed up for Bale Pandiya. He visited the studios on the second day of the month, and left on the twelfth after the film was completed. Ganesan claimed himself to hold the &quot;world record of completing a film in eleven days time.&quot; He played three distinct roles, while his co-star M. R. Radha played two roles. The entire film was completed in 15 days, with shooting going on simultaneously at three different places.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Tamil\nRunTime: 2:26:52\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:26:52","torrent":{"xt":"urn:btih:7dd98b1cd7d8f80d1548e739e91f42abc9ac4863","amp;dn":"Balae+Pandiya+%281962%29+Tamil+-+Xvid+1cd+-+Eng+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd98b1cd7d8f80d1548e739e91f42abc9ac4863","infoHashBuffer":{"type":"Buffer","data":[125,217,139,28,215,216,248,13,21,72,231,57,233,31,66,171,201,172,72,99]},"announce":[],"urlList":[]}}