{"title":"GRIMM (2013) S02E19 x264 (WEB-DL) 1080p NLSubs","uid":8443904,"size":1805206831,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7e9afcbc4c03f6f9b48114cfc0c8c2f5cc7c6705&amp;dn=GRIMM+%282013%29+S02E19+x264+%28WEB-DL%29+1080p+NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Marjanb","files":-1,"time":1367845310,"description":"GRIMM (2013) S02E19 x264 (WEB-DL) 1080p NLSubs\n\n Grimm Seizoen 2 - Episode 19\n\n\nHerinner je de sprookjes die je verteld werden voor het\nslapen gaan? Dit waren geen sprookjes, dit zijn waarschuwingen.\n\nRechercheur Nick Burkhardt dacht dat hij geschikt was voor het zware\nwerk bij de afdeling moordzaken in Portland, Oregon. En dat gaat\nprima . tot hij dingen begint te zien die hij niet kan verklaren,\nzo ziet hij een prachtige vrouw plotseling veranderen in een lelijke\nheks of ziet hij een normale man aan voor een gemene trol.\nNick Burkhardt begint aan zichzelf te twijfelen, maar een bezoek\naan zijn nog enig levende familielid komt hij achter de waarheid\nvan zijn visioenen: hij is een afstammeling van een oud jagersras,\nde Grimms, dat eeuwenlang de wereld behoed voor bovennatuurlijke wezens.\n\nNu hij weet wie hij is en wat hij kan, zet hij zijn nieuwe skills in bij\nhet oplossen van misdaden. Zijn partner vermoedt dat er iets met Nick aan\nde hand is, maar wat blijft hem onduidelijk. Bij een paar ingewikkelde\nzaken krijgt Nick hulp uit onverwachte hoek van de aardige Monroe een\naardige man, maar hij blijkt de grote boze wolf in dit sprookje.\n\nEnglish\n\nGrimm is about the fairy tales that you have heard before bedtime comes to life when Detective Nick Burhardt (David Giuntoli ) thought that moving to Portland, Oregon was a good idea. It was until he started seeing things he couldn't explain such as normal beautiful women turning into hags or a normal man turning into a troll. Nick goes to his relative in the hospital who tells him that he has the Grimm, a supernatural power that is able to see the creatures in real life. With his partner Lt. Hank Griffin (Russell Hornsby) the pair track down a killer in a &quot;Little Red Riding Hood&quot; tale.\n\nNow the tales of the Brothers Grimm comes to life in this new thriller and no one is safe. Only Nick can restore the town to what it was before. Created by David Greenwalt (Angel, Buffy The Vampire Slayer), Jim Kouf (Angel, National Treasure), Grimm is a new fresh idea that takes you into a world of the supernatural right in your own home.\n\n &lt;a href=&quot;\nhttp://www.tvrage.com/Grimm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvrage.com/Grimm&lt;/a&gt; &lt;a href=&quot;\nhttp://www.watchgrimmnow.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.watchgrimmnow.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1830617/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1830617/&lt;/a&gt;\n\nVideo: 1920*1080 (WEB-DL)\nContainer: MKV\nAudio: DD5.1\nSubs: Custom NL (Instelbaar)\nQuality over Quantity (QoQ) Releases Vertaling.\nVertaling: WinchesterGirl, Andreas55 &amp; Asteria\nControle: MuchachoNL\n\nEnjoy the Movie\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:7e9afcbc4c03f6f9b48114cfc0c8c2f5cc7c6705","amp;dn":"GRIMM+%282013%29+S02E19+x264+%28WEB-DL%29+1080p+NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e9afcbc4c03f6f9b48114cfc0c8c2f5cc7c6705","infoHashBuffer":{"type":"Buffer","data":[126,154,252,188,76,3,246,249,180,129,20,207,192,200,194,245,204,124,103,5]},"announce":[],"urlList":[]}}