{"title":"Coast to Coast AM April 03 2013","uid":8345142,"size":56095521,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7f403100b7da1f86c1b9c0f630c8860b11adb87c&amp;dn=Coast+to+Coast+AM+April+03+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1365181238,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-03-13\nHost: \tGeorge Noory\nGuests: \tRichard Smoley, Michael Maloof\n\nHighly regarded writer on esoterica, Richard Smoley, discussed various occult traditions, including such topics as prophecy, Nostradamus, and prayer. He detailed his interest in the influential Theosophical Society, begun in 1875, which set out to study the occult, and unknown abilities in humans. A number of concepts first promulgated by the Society like karma, reincarnation, and Eastern spirituality have become widely known or accepted today, he pointed out. One of the founders of the Theosophical Society, Madame Blavatsky, was a Russian mystic who had an enormous passion for the paranormal and occult wisdom. She claimed to be in contact with certain hidden Masters, who were said to have powers far beyond normal human beings. &quot;The more spiritually advanced someone is, the less he or she wants publicity,&quot; Smoley commented.\n\nOne reason people often feel fear of the occult is because it gives them a kind of reassurance that there is another reality beyond the physical, he suggested. Regarding the prophecies of Nostradamus, a lot of what he was saying probably had to do with his own time period-- the 16th century, rather than the centuries that followed, Smoley noted. Prophecies of doom and end times made by various seers could be a kind of &quot;displacement&quot; for fears regarding our own mortality, he added.\n\nMiracles, seemingly supernatural occurrences, can play out in ways in people's lives that don't necessarily violate the laws of physics, while the power of prayer points to the mind not being confined to the physical brain, he stated. Defying the conventional models of reality, he remarked that the &quot;mind is not quite as isolated and independent as one probably thinks.&quot; Smoley also talked about how consciousness (the capacity to relate self and other) creates the universe, as well as how the Ouija board has positive aspects-- the poet James Merrill and his partner David Jackson transcribed the epic poem &quot;The Changing Light at Sandover&quot; via the Ouija board.\nNorth Korea &amp; EMP Threats\n\nFirst hour guest, WND's Washington senior reporter, Michael Maloof, talked about North Korea and possible EMP threats. By making threats of a nuclear attack, leader Kim Jong Un may be trying to prove himself and gain more support from the North Korean army, Maloof suggested. North Korea has been angered over UN sanctions against them for nuclear testing, he added. Kim Jong Un fired a test missile back in December, which was assessed to be able to reach the West Coast. Such a missile could potentially orbit a nuclear weapon, which might then be &quot;de-orbited upon command anywhere across the United States, and exploded at a high altitude,&quot; creating an EMP attack, he cautioned.\n\nNews segment guests: Dr. Peter Breggin, Dr. Bruce Goldberg\nWebsite(s):\n\n    richardsmoley.com\n    wnd.com/author/mmaloof\n\nBook(s):\n\n    Supernatural: Writings on an Unknown History\n    Inner Christianity\n    Forbidden Faith: The Secret History Of Gnosticism\n    The Essential Nostradamus\n    A Nation Forsaken: EMP: The Escalating Threat of an American Catastrophe\n\n","torrent":{"xt":"urn:btih:7f403100b7da1f86c1b9c0f630c8860b11adb87c","amp;dn":"Coast+to+Coast+AM+April+03+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f403100b7da1f86c1b9c0f630c8860b11adb87c","infoHashBuffer":{"type":"Buffer","data":[127,64,49,0,183,218,31,134,193,185,192,246,48,200,134,11,17,173,184,124]},"announce":[],"urlList":[]}}