{"title":"Light: A Gone Novel (Gone Series Book 6) [[FINAL BOOK]]","uid":8365087,"size":1905194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ffe33fb627dd1977d72489d838574323e0530dd&amp;dn=Light%3A+A+Gone+Novel+%28Gone+Series+Book+6%29+%5B%5BFINAL+BOOK%5D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aro1791","files":3,"time":1365741459,"description":"I'm pretty sure this is a retail version. I have the other books but the metadata from Calibre isn't complete on those yet. I couldn't wait to post this because NO ONE else has, and it's BRAND NEW, and I'm sure everyone is dying to read it. =]\n\nPLEASE SEED FOR OTHERS!! I can't host this for too long!\n\n\nSUMMARY:\n\nIt's been over a year since all the adults disappeared. Gone.\n\nIn the time since everyperson over the age of fourteen disap-peared from the town of Perdido Beach, California, countless battles have been fought: battles against hunger and lies and plague, and epic battles of good against evil. And now, the gaiaphage has been reborn as Diana's malicious mutant daughter, Gaia. Gaia is endlessly hungry for destruction. She yearns to conquer her Nemesis, Little Pete, and then bend the entire world to her warped will. As long-standing enemies become allies, secrets are revealed and unexpected sacrifices are made. Will their attempts to save themselves and one another matter in the end, or will the kids of Perdido Beach perish in this final power struggle?\n\nLight, the sixth and final book in the New York Times bestselling Gone series by Michael Grant, creates a masterful, arresting conclusion to life in the FAYZ","torrent":{"xt":"urn:btih:7ffe33fb627dd1977d72489d838574323e0530dd","amp;dn":"Light%3A+A+Gone+Novel+%28Gone+Series+Book+6%29+%5B%5BFINAL+BOOK%5D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ffe33fb627dd1977d72489d838574323e0530dd","infoHashBuffer":{"type":"Buffer","data":[127,254,51,251,98,125,209,151,125,114,72,157,131,133,116,50,62,5,48,221]},"announce":[],"urlList":[]}}