{"title":"SpanSoft TreeDraw Legacy Edition v4.1.0 with Key [TorDigger]","uid":8466886,"size":5136117,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:80d288811e67892d326af333c02457b74cbea59e&amp;dn=SpanSoft+TreeDraw+Legacy+Edition+v4.1.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":10,"time":1368379313,"description":"SpanSoft TreeDraw Legacy Edition\n\nTreeDraw Legacy Edition is a genealogy software package for producing high quality genealogy charts. Family trees are imported into the software from &quot;Legacy Family Tree&quot; V3-V8 databases. After importing the tree data, you can re-arrange the tree and add extra text and graphics before storing, printing or creating a PDF file.\n\nWith our software it is easy to produce perfectly laid out charts and incorporate pictures, clip-art and other simple graphics. You have control over which data the software imports and how it formats it, so charts may be as complex or as simple as you wish.\n\nBy importing a combination of descendant and ancestral trees from one or more data files, it is possible to build complex charts which can extend in any direction.\n\nThis genealogy software maintains a link between each chart text element and the source field in the original Legacy database. This means that you can update each text element automatically to mirror any changes in the original data. The tree link for each text element can also be modified manually. This is a powerful feature which gives you control over the content and format of the text in the chart.\n\nAdditional text elements may be entered manually to provide titles, headings, comments, etc.\n\nAs well as text, you can place into the chart simple graphics (lines, boxes, circles) and images like pictures, clip-art, diagrams, etc.\n\nTreeDraw lets you control the size, shape, style, colour and alignment of all chart elements and supports colour printing.\n\nYou can export your chart as an Adobe PDF file which can be viewed on any PC with the Acrobat Reader.\n\nFeatures\n\nImport drop-line descendant/ancestral trees and wheel ancestral charts from one or more Legacy Family Tree databases.\nCharts are automatically formatted vertically or horizontally and can be left/top or centre aligned.\nAutomatically replace specified text as it is imported.\nOption to import Legacy pictures automatically.\nOption to join linking lines automatically.\nUpdate the chart text elements automatically to match any changes in the source Legacy database.\nAdd extra text, notes, titles, etc.\nAdd pictures, images, clip-art, etc.\nAdd simple graphics, lines, boxes, etc.\nFull control over fonts, colour, size, shape and alignment of chart elements.\nMagnifying glass magnifies text which is too small to read on the screen.\nSearch the chart for specific text.\nScaling tool makes it easy to fit the chart onto a specified number of pages.\nExport the chart to a PDF file, metafile or bitmap file.\nSupports international date formats and languages.\nFull, on-line, context-sensitive manual.\nEasy to use. Get your charts the way you want them... in minutes!\nCompatible with all versions of Legacy Family Tree from V3 to V8.\n\nSupported OS:\n\nWindows XP, Vista, Win7, Win8 (32bit and 64bit).\n\nHomepage: http://www.spansoft.org\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given Serial/Key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:80d288811e67892d326af333c02457b74cbea59e","amp;dn":"SpanSoft+TreeDraw+Legacy+Edition+v4.1.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80d288811e67892d326af333c02457b74cbea59e","infoHashBuffer":{"type":"Buffer","data":[128,210,136,129,30,103,137,45,50,106,243,51,192,36,87,183,76,190,165,158]},"announce":[],"urlList":[]}}