{"title":"Thomas Perry - Jane Whitfield Book 7","uid":8301951,"size":614647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:822f8f01983a91232e00efc926a9396f63fea27c&amp;dn=Thomas+Perry+-+Jane+Whitfield+Book+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"milit16","files":2,"time":1364283909,"description":"Poison Flower, the seventh novel in Thomas PerryÎ“Ã‡Ã–s celebrated Jane Whitefield series, opens as Jane spirits James Shelby, a man unjustly convicted of his wifeÎ“Ã‡Ã–s murder, out of the heavily guarded criminal court building in downtown Los Angeles. But the price of ShelbyÎ“Ã‡Ã–s freedom is high. Within minutes, men posing as police officers kidnap Jane and, when she tries to escape, shoot her.\n\nJaneÎ“Ã‡Ã–s captors are employees of the man who really killed ShelbyÎ“Ã‡Ã–s wife. He believes he wonÎ“Ã‡Ã–t be safe until Shelby is dead, and his men will do anything to force Jane to reveal ShelbyÎ“Ã‡Ã–s hiding place. But Jane endures their torment, and is willing to die rather than betray Shelby. Jane manages to escape but she is alone, wounded, thousands of miles from home with no money and no identification, hunted by the police as well as her captors. She must rejoin Shelby, reach his sister before the hunters do, and get them both to safety.\n\nIn this unrelenting, breathtaking cross-country battle, Jane survives by relying on the traditions of her Seneca ancestors. When at last Jane turns to fight, her enemies face a cunning and ferocious warrior who has one weapon that they donÎ“Ã‡Ã–t.\n\nEPUB &amp; MOBI included","torrent":{"xt":"urn:btih:822f8f01983a91232e00efc926a9396f63fea27c","amp;dn":"Thomas+Perry+-+Jane+Whitfield+Book+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822f8f01983a91232e00efc926a9396f63fea27c","infoHashBuffer":{"type":"Buffer","data":[130,47,143,1,152,58,145,35,46,0,239,201,38,169,57,111,99,254,162,124]},"announce":[],"urlList":[]}}