{"title":"DVDFab 9.0.3.6 Final","uid":8405898,"size":49678511,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:862bae4c6a34d5ee96117dc8d438a69ffd1caef6&amp;dn=DVDFab+9.0.3.6+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1366762411,"description":"April 23, 2013\n DVDFab 9.0.3.6 Updated! \n\n New: DVDFab Blu-ray Ripper and DVDFab Blu-ray 3D Ripper merged into one option, and renamed to Blu-ray Ripper (3D Plus).\n New: DVDFab File Transfer is for free now.\n New: Added support for task queue.\n New: Added support to clone BDAV discs.\n New: Added support to decode the source which contains AC3-Plus (E-AC3) audio track.\n New: Added support to remember the user operation on user interface.\n New: Added support for WMV 10 output with 5.1 audio tracks.\n New: Added support for some special DVD discs.\n New: Added support to modify volume label for Blu-ray/DVD creator.\n New: Improved &quot;Remove annoying PGCs (like FBI warning)&quot;.\n New: Updated VSO burning engine.\n New: Updated language files.\n New: Updated profiles for new device.\n New: Some user interface and user experience improvements.\n\n Fix: A layout problem when set the display DPI to 125 or 150.\n Fix: A crash problem when copying with DBCS external subtitle in certain cases.\n Fix: A crash problem when selecting ASCII as Character sets in certain cases.\n Fix: A problem that cannot set the Audio track, Subtitle and Chapter settings for multiple angles Blu-ray source.\n Fix: A problem that cannot burn data source in Clone/Burn mode.\n Fix: A crash problem opening data source in Split mode.\n Fix: A problem that cannot create dvdfab.miniso file in certain cases.\n Fix: A crash problem when burn DVD with VSO burning engine in certain cases.\n Fix: A problem that cannot select region code for DVD automatically.\n Fix: A freeze problem when copying Blu-ray disc to BD25, such as: Led Zeppelin Celebration Day.\n Fix: A problem that should not enable &quot;Convert DTS/PCM to AC3&quot; when copying Blu-ray to BD50/BD25.\n Fix: A crash problem when converting Blu-ray to DVD in certain cases, such as: Bad teacher, Battleship, Prometheus, Chris_Botti.iso.\n Fix: A problem that cannot copy Blu-ray to DVD after DVDFab warns user whether overwrite the existing folder, and user select &quot;No&quot;.\n Fix: A freeze problem when ripping DVD to 3d.iphone4.h264.aac.\n Fix: A crash problem when ripping with mpeg4 profiles in 2-pass mode.\n Fix: A freeze problem when playing the converted result in PS3.\n Fix: An A/V sync problem when ripping DVD to mkv.remux in certain cases.\n Fix: A static audio problem when playing file converted by DVD Ripper on Windows Media Player and VLC Player.\n Fix: A noise problem when ripping to Apple TV3.\n Fix: A crash problem when ripping to mkv.audiocopy profile with multiple audio tracks.\n Fix: A crash problem after selected &quot;Deinterlacing&quot; option during the ripping process.\n Fix: A problem that the converted .mp4 and .m4v files cannot be played on iTunes and QuickTime.\n Fix: A graph 0 error problem when ripping Blu-ray to mp4 profiles.\n Fix: A crash problem when ripping to Apple profiles with special DVD source, such as: TOM_AND_JERRY_VOL1.\n Fix: A freeze problem when ripping Blu-ray to mkv.audiocopy with DTS-HD audio track. \n Fix: A problem that should not only have &quot;Mono&quot; audio selection for DVD PCM-2 audio source in advanced settings dialog.\n Fix: An A/V sync problem when ripping Blu-ray &quot;The Adventures of Tintin&quot; with mkv.remux profile.\n Fix: Improved the accuracy of calculation for user customized video output bitrate.\n Fix: A problem that the location of idx/sub subtitle is not suitable in DVD and Blu-ray Ripper mode.\n Fix: An A/V sync problem when converting vob file to ipad.1080p.mp4.\n Fix: A crash problem when creating DVD in certain cases.\n Fix: A crash problem when deleting source in Convert and Creator in certain cases.\n Fix: A filter failed problem when converting with .mov files as source.\n Fix: A problem when setting the color of subtitle, it does not work in DVD Creator.\n Fix: A problem that cannot create chapter for DVD creator.\n Fix: A problem that cannot change the Volume Label for Blu-ray Creator.\n Fix: A problem that the created disc cannot be played by stand-alone player in certain cases.\n\nHomepage: www.dvdfab.com\n","torrent":{"xt":"urn:btih:862bae4c6a34d5ee96117dc8d438a69ffd1caef6","amp;dn":"DVDFab+9.0.3.6+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862bae4c6a34d5ee96117dc8d438a69ffd1caef6","infoHashBuffer":{"type":"Buffer","data":[134,43,174,76,106,52,213,238,150,17,125,200,212,56,166,159,253,28,174,246]},"announce":[],"urlList":[]}}