{"title":"Alex Jones Show - 2013 May 08 WE [sebaygo1]","uid":8453668,"size":75198643,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9074c450f25edb6d71c7b0a59ffac32c900623e8&amp;dn=Alex+Jones+Show+-+2013+May+08+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1368058666,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 08 May 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Wednesday, May 8 edition of The Alex Jones Show, Alex covers the prospect of the United States military intervening in Syria by the end of summer. He also covers the latest efforts in Congress to reanimate gun legislation. \n\nOn today's worldwide broadcast, Alex covers Google's effort to scare visitors away fromand Drudge with GCN talk show host Katherine Albrecht. She is coauthor of Spychips: How Major Corporations and Government Plan to Track Your Every Move. \n\nAlso on today's broadcast, Jeffrey M. Smith talks about new research on Roundup and the latest news on the scourge of GMO. Jeffrey is the author of Seeds of Deception: Exposing Industry and Government Lies About the Safety of the Genetically Engineered Foods You're Eating, available at the Infowars Store. He has produced the DVD presentation Genetic Roulette: The Gamble of Our Lives, also available at the Infowars Store.\n\n-\nJeffrey Smith did not appear. No mention was made of his absence that I heard.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:9074c450f25edb6d71c7b0a59ffac32c900623e8","amp;dn":"Alex+Jones+Show+-+2013+May+08+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9074c450f25edb6d71c7b0a59ffac32c900623e8","infoHashBuffer":{"type":"Buffer","data":[144,116,196,80,242,94,219,109,113,199,176,165,159,250,195,44,144,6,35,232]},"announce":[],"urlList":[]}}