{"title":"Richardson Software RazorSQL v6.0.7 (32-64bit) with Key [TorDigg","uid":8353528,"size":70712624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:91105b0a85cf6501c5ce1031dfcb08989873bd01&amp;dn=Richardson+Software+RazorSQL+v6.0.7+%2832-64bit%29+with+Key+%5BTorDigg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"TorDigger","files":4,"time":1365420898,"description":"Richardson Software RazorSQL\n\nRazorSQL is an SQL query tool, database browser, SQL editor, and database administration tool for Windows, Mac OS X, Linux, and Solaris.\n\nRazorSQL has been tested on over 30 databases, can connect to databases via either JDBC or ODBC, and includes support for the following databases:\n\nDB2,H2,Microsoft Access,Oracle, SQLite, DBASE, HSQLDB, Mimer SQL, Paradox, SQL Anywhere, Derby, Informix, MongoDB, Pervasive, SQL Azure, Filemaker\nIngres, MS SQL Server, PostgreSQL, Sybase (ASE), Firebird, Interbase, MySQL, SimpleDB, Sybase IQ, Frontbase, Int.Sys. Cache, Netezza, solidDB, Teradata, Greenplum, JavaDB, OpenBase.\n\nFeatures\n\nA Database Navigator for browsing database objects.\nAn SQL Editor for creating SQL queries.\nVisual tools for creating, editing, dropping, describing, altering, and viewing tables, views, indexes, and sequences\nVisual Tools for creating, editing, dropping, and executing stored procedures, functions, and triggers\nA robust programming editor that embeds the powerful EditRocket code editor that supports 20 programming languages including SQL, PL/SQL, TransactSQL, SQL PL, HTML, XML, and more.\nExport Tool - Export data in various formats\nImport Tool - Import data from delimited files, Excel files, or fixed width files into tables\nShips with a built-in relational database engine (HSQLDB) that is up and running out of the box and requires no end-user administration\nA Generate DDL Tool for generating table, view, and index DDL.\nTable / SQL Query Compare tool for comparing tables or queries across multiple connections\nDatabase Data Search tool for searching single or multiple database table and view data.\nDatabase Object Search tool for searching for database objects.\nBackup tools such as the Database Backup Tool and Table Backup Tool\nDatabase conversion tools for many popular databases.\nAuto column and auto table lookup\nSQL Formatter\nSQL Query builder tool\nSQL Query Scheduler tool\nCommand Line Interface\nPHP Bridges for connecting to MySQL, PostgreSQL, and SQL Server databases remotely via PHP enabled web servers\nAn ASP bridge for connecting to MS SQL Server databases remotely via ASP enabled web servers\nSQL GUI Tools for generating SQL for various operations\nEdit, delete, and insert database data with the Database Editor\nWorks with all major operating systems including Windows, Mac OS X, Linux, Solaris, and any other Java enabled OS\nTested with Apache Derby / JavaDB, Daffodil DB, DB2, DBASE, Firebird, FrontBase, H2, HSQLDB / HyperSQL, Informix, Ingres, Interbase, Mckoi, Microsoft Access, Microsoft SQL Server, Mimer SQL, MySQL, Netezza, OpenBase, Oracle, Pervasive, Pointbase, PostgreSQL, Solid, SQLite, Sybase Adaptive Server Enterprise, Sybase SQL Anywhere, and Teradata\n\nSystem Requirements:\n\nFor best results, use of one of the following operating systems is recommended: Windows 8, Windows 7, Windows Vista, Windows XP, Windows Server 2008 or 2003, or Windows 2000. The 32-bit version of RazorSQL runs on both 32-bit and 64-bit versions of Windows. The 64-bit version only runs on 64-bit versions of Windows. If using ODBC drivers to connect, make sure to use the version of RazorSQL that matches up with the architecture of the ODBC driver. For example, if using 32-bit ODBC drivers, the 32-bit version of RazorSQL is required.\n\nHomepage: http://www.razorsql.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:91105b0a85cf6501c5ce1031dfcb08989873bd01","amp;dn":"Richardson+Software+RazorSQL+v6.0.7+%2832-64bit%29+with+Key+%5BTorDigg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91105b0a85cf6501c5ce1031dfcb08989873bd01","infoHashBuffer":{"type":"Buffer","data":[145,16,91,10,133,207,101,1,197,206,16,49,223,203,8,152,152,115,189,1]},"announce":[],"urlList":[]}}