{"title":"PBS America Revealed 1of4 Food Machine x264 AAC MVGroup.org","uid":8460917,"size":680797469,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:912b516a0a343b1daa03c36c28326a5c6e409334&amp;dn=PBS+America+Revealed+1of4+Food+Machine+x264+AAC+MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":-1,"time":1368229453,"description":"America Revealed\n\nTravel Documentary hosted by Yul Kwon, published by PBS in 2012 - English narration\n\n\nInformation\n------------------------------\n\nAmerica Revealed is a unique look at what makes America tick, what it takes to keeps the biggest food machine in the world going, the delicate balance that keeps our supermarkets stocked with groceries and fast food restaurants supplied with fries. How we keep America moving with its vast and complex transport systems. How we propel ourselves through energy, what maintains the constant supply of fuel and electricity to our homes and businesses and finally how we keep up with the ever changing world, the import and export infrastructure that shapes our manufacturing industry.\n\nFrom the Corn farmer in Central Valley, California to the live wire cable repairers in New Jersey. Viewers will discover a fascinating new perspective on the hidden patterns and rhythms of American life, by looking through the eyes of individuals who all play a part in keeping America fed, moving, powered and making goods.\n\n\n1)  Food Machine \nOver the past century, an American industrial revolution has given rise to the biggest, most productive food machine the world has ever known. Yul Kwon explores how this machine feeds nearly 300 million Americans every day. He discovers engineering marvels we've created by putting nature to work and takes a look at the costs of our insatiable appetite on our health and environment. For the first time in human history, less than 2% of the population can feed the other 98%. Yul embarks on a trip that begins with a pizza delivery route in New York City then goes across country to California's Central Valley, where nearly 50% of America's fruits, nuts and vegetables are grown and skydives into the heartland for an aerial look of our farmlands. He meets the men and women who keep us fed 365 days a year-everyone from industrial to urban farmers, crop dusting pilots to long distance bee truckers, modern day cowboys to the pizza deliveryman.\n","torrent":{"xt":"urn:btih:912b516a0a343b1daa03c36c28326a5c6e409334","amp;dn":"PBS+America+Revealed+1of4+Food+Machine+x264+AAC+MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912b516a0a343b1daa03c36c28326a5c6e409334","infoHashBuffer":{"type":"Buffer","data":[145,43,81,106,10,52,59,29,170,3,195,108,40,50,106,92,110,64,147,52]},"announce":[],"urlList":[]}}