{"title":"20130516-Stossel-[War Against the Little Guy].FBN.CF.avi","uid":8485766,"size":296686958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:935faddc1064cd516ccc803e9ca7fefad27b54bd&amp;dn=20130516-Stossel-%5BWar+Against+the+Little+Guy%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1368855699,"description":"----------\n\nSTOSSEL - [War Against the Little Guy] - Fox Business Network\n2013, May 16, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nGovernment is at war against the little guy. Bureaucrats pass thousands of pages of regulations every year to &quot;keep people safer&quot; and &quot;make the marketplace more fair.&quot; Today there are 170,000 pages of federal regulations on the books. Break just one rule, and government may wreck your life.\n\nSo Wisconsin Senator Ron Johnson started a &quot;Victims of Government&quot; website that features victims of overregulation.\n\nMichael Strong, CEO of FLOW, a group devoted to &quot;liberating the entrepreneurial spirit&quot; argues that problems are only solved when people are free to act without having to wait for government's permission. Strong's wife, Magatte Wade, who runs a skin care business, is from Senegal. She says Africa stays poor because its governments wage bigger wars against the little guy---getting a construction permit takes an average of 210 days.\n\nWhen makeup artist Wendy Robin started teaching students how to apply makeup-Nevada bureaucrats told her that she must get an expensive license, or close. She closed. Institute for Justice lawyer, Tim Keller says such licenses are simply restraint of trade. The Institute will fund a lawsuit to help Wendy keep her business open.\n\nJia En Teo founded Roomorama, an internet site that makes it easy to rent out your apartment, or rooms in your house. Tourists love it, and apartment owners get to make some money. But two years ago, New York passed a law that makes most of what Roomarama does illegal. The sponsor of the law, Liz Krueger, claims such rentals disrupt neighborhoods.\n\nOnce government passes a rule, the rule is usually permanent. but &quot;Madmen, Intellectuals, and Academic Scribblers&quot; authors, Edward Lopez and Wayne Leighton, point out that deregulation did happen once. Americans pay much less to fly and to ship things because the CAB and ICC no longer exist. We have cell phones because the FCC finally allowed spectrum to be auctioned off. The authors say such change happens only when the right people, the right ideas and the right circumstances come together, and even then it takes years.\n\nIf you missed this show last night, catch it on Sunday at 10 PM on FNC.","torrent":{"xt":"urn:btih:935faddc1064cd516ccc803e9ca7fefad27b54bd","amp;dn":"20130516-Stossel-%5BWar+Against+the+Little+Guy%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935faddc1064cd516ccc803e9ca7fefad27b54bd","infoHashBuffer":{"type":"Buffer","data":[147,95,173,220,16,100,205,81,108,204,128,62,156,167,254,250,210,123,84,189]},"announce":[],"urlList":[]}}