{"title":"Championship Bodybuilding","uid":8446299,"size":4556177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9507cb25b2137467f209158b47f15491d141ef39&amp;dn=Championship+Bodybuilding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBuilder1981","files":1,"time":1367896538,"description":"Championship Bodybuilding\n=========================\n\nThis is a comprehensive, easy to understand, guide for the man or woman who wants to build a great body or for the competition type bodybuilder. The author divides the training section into 3 parts; training for the novice or very beginner, training for the intermediate or more experienced trainee and training for the advanced bodybuilder. Within each training section, Aceto covers training schedules, repitition ranges for building muscle strength, size and endurance, set selection, and exercise prescription. Each exercise is described with a 3 dimensional drawing allowing the reader to grasp the range of motion that best fits each exercise. He also covers muscle physiology, the comparison between 2b fibers and 2a muscle fibers and the importance of developing specific training methods to maximize your gains. The delicate issue of aerobics is also covered with exact guidelines for the pre-contest bodybuilder as well as the trainee simply trying to lose some body fat. Specifically, Aceto calls aerobics, &quot;One of the biggest myths in body fat control. Getting lean is about building your metabolic rate by building lean body mass and manipulating your nutrition plan. For most, aerobics is a way to short circuit progress, not enhance it.&quot; The nutrition section sets down exact formulas to find precise amounts of calories, carbs, protein and fat one needs to build up or lean down-whatever his or her goal. The latest supplement are also covered from creatine to glutamine and contest bodybuilders will appreciate the sodium and carbo loading techniques. Championship Bodybuilding is all about instruction. A thorough plan that will help you transform your physique!\n\n~220 pages\nScanned.\n","torrent":{"xt":"urn:btih:9507cb25b2137467f209158b47f15491d141ef39","amp;dn":"Championship+Bodybuilding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9507cb25b2137467f209158b47f15491d141ef39","infoHashBuffer":{"type":"Buffer","data":[149,7,203,37,178,19,116,103,242,9,21,139,71,241,84,145,209,65,239,57]},"announce":[],"urlList":[]}}