{"title":"Sexually Broken--4'10 Jessi owned by 10&quot; of black cock. Jes","uid":8461566,"size":1075545348,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:952b110c020ae54a339655fa831eb91c0ae410e6&amp;dn=Sexually+Broken--4%2710+Jessi+owned+by+10%26quot%3B+of+black+cock.+Jes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1368245273,"description":"4'10 Jessi gets owned by 10 inches of black cock. Category 5 bondage, deep throated, made to cum! | Jessi Palmer | Matt Williams\n\nMay 10, 2013 \n \n\nMP4 only.\n \n \nTiny 4'10 red head, Jessi Palmer is back on the pages of Sexually Broken. This girl might be tiny but she can take the big black cock (BBC) and the category 5 bondage. Can your favorite porn start do both? \n\nBound on the bed with her head hanging over the edge and her body bound in the perfect &quot;fuck me&quot; position, Jessi finds herself completely helpless and vulnerable. Her mouth is at perfect cock height and her shaved tiny pussy is pushed up and out. Her arms are bound to a wooden pole across her shoulders. She knows she is about to be punished with cock, lots of cock.\n\nIt's really simple, this is rough, bound, consensual sex at it's rawest. The cocks are not gentle, and tiny Jessi is getting the fucking of her life time. We fuck her throat hard and deep and with no mercy, at the same time her tight little pussy gets railed and railed hard. Jessi does her best to multi-task with both cocks going at her from opposite directions. Deep spit from her throat coats her face, and her throat is getting utterly and throughly fucked. She struggles for air in-between cumming and screaming.\n\nThe men take turns, back and forth between mouth and pussy, never giving Jessi a chance to ever &quot;get on top of it&quot;. The cocks are destroying her sexually and she is deep in subspace, cum drunk and lost in bliss. All she can do is feel hard cock slide down her throat over and over, while she steals air when she can. At the same time cock pounds her pussy and she is cumming over and over, uncontrollably. Both cocks have reduced her to a drooling, moaning cum bot. \n\nBefore she can even understand what has happened, Jessi finds herself lifted upside down by one ankle hanging while her back is arched back. We attack her clit with a vibrator and soon Jessi is cumming again while helpless in a category 5 suspension. We leave Jessi floating in air, with some form of liquid drooling out of every one of her holes....  \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_10jpalmer3/SexuallyBroken-Jessi-Palmer-Matt-Williams-4-10-Jessi-gets-owned-by-10-inches-of-black-cock-Category-5-bondage-deep-throated-made-to-cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_10jpalmer3/SexuallyBroken-Jessi-Palmer-Matt-Williams-4-10-Jessi-gets-owned-by-10-inches-of-black-cock-Category-5-bondage-deep-throated-made-to-cum.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:952b110c020ae54a339655fa831eb91c0ae410e6","amp;dn":"Sexually+Broken--4%2710+Jessi+owned+by+10%26quot%3B+of+black+cock.+Jes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952b110c020ae54a339655fa831eb91c0ae410e6","infoHashBuffer":{"type":"Buffer","data":[149,43,17,12,2,10,229,74,51,150,85,250,131,30,185,28,10,228,16,230]},"announce":[],"urlList":[]}}