{"title":"SeaApple Aquarium Lab v2013.4.0 with Key [TorDigger]","uid":8416302,"size":10014437,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:955c63ec1cbf2baaba262e1d13c94e7b6123fbfd&amp;dn=SeaApple+Aquarium+Lab+v2013.4.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":9,"time":1367050362,"description":"Aquarium Lab\n\nAquarium Lab allows you to keep track of you aquarium like a scientist, no degree needed. The program is built for easy data entry, and supports multiple fresh and saltwater aquariums simultaneously. \n\nAquarium Lab is a complete aquarium tracking software package for Windows Vista,7 and XP, that will help you maintain healthy aquarium conditions \n- Monitor Aquarium Readings: pH, Temperature, Calcium, Alkalinity...\n- Track Aquarium Livestock including fish, corals, plants and invertebrates\n- Track Water Changes\n- Track Food and additives\n- Project manager and todo\n- Monitor Electrical costs and power consumption\n\nAquarium Lab - Track, Log and Calculate:\n\nProperly monitoring and maintained aquarium conditions can lead to a truly beautiful and healthy aquarium. Aquarium Lab makes it easier for you record and analyze many aquarium parameters: \n\nChemistry \nThe program encourages you to record water quality parameters, by making this information easy to Be entered. The program then does the calculations and graphing for you automatically making it easy for You to interpret test kit results, and analyze your aquarium water chemistry. You can log and graph 21 different chemicals, including pH, Temperature, Alkalinity, Ammonia, and Calcium. You can also schedule partial water changes and observe how much wastes remain at the end of the water change. \n\nBiology \nAquarium Lab encourages you to keep a profile of each living Fish, Coral, Plant and Invertebrate in your tank. Including a photo, date purchased and dietary habits. The program supports multiple fresh and saltwater aquariums simultaneously. Detailed reports are generated in html format. \n\nCalculations \nAquarium Lab encourages you to enter the aquarium's physical measurements. The program then calculates the aquariums weight and volume. \n\nExpenses \nAquarium Lab encourages you to record the price of all your aquarium purchases. The program then calculates for you the total worth of your aquarium and breaks it down by several different categories. Detailed expense reports are generated in html format, which can be printed \n\nElectrical Costs \nAquarium Lab encourages you to enter the wattage of your aquarium devices. The program then automatically calculates power consumption and Costs of operating the device for 1 day, 1 month and 1 year. For each one of your aquariums find out how much it costs to operate the pumps, lights, and electric devices.\n\nSupported OS:\n\nWindows Vista/7 and XP\n\nHomepage: http://www.aquariumlog.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/email/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:955c63ec1cbf2baaba262e1d13c94e7b6123fbfd","amp;dn":"SeaApple+Aquarium+Lab+v2013.4.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955c63ec1cbf2baaba262e1d13c94e7b6123fbfd","infoHashBuffer":{"type":"Buffer","data":[149,92,99,236,28,191,43,170,186,38,46,29,19,201,78,123,97,35,251,253]},"announce":[],"urlList":[]}}