{"title":"IMAGE COMICS WEEK OF 2013.05.08","uid":8458480,"size":368396369,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:95b46921c6ee49c75d0fb97fe74429f924fe867b&amp;dn=IMAGE+COMICS+WEEK+OF+2013.05.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1368164196,"description":"\nThe comics shipped from Image this week were light -- just 5 new ones, a couple of trades and a replacement copy for I Love Trouble #5. (Digital copies are immune to printer errors, amirite?) I've also included Image's two offerings from Free Comic Book Day on Saturday.\n\nI'm sorry to say this will be my last torrent for awhile. I think this is my 775th torrent, which is good 'cause 6 months ago, I didn't even know how to create one! Thanks for all your comments, I have a lot of fun discussing comics &amp; random stuff. If you have given me a request, I'm sorry but I won't be filling any more for the time being.\n\nI'll be popping in from time to time, generally just to download and read. But I might torrent some titles here or there, you never know. And one more time, please seed and share with our friends here on TPB.  --STFmaryville\n\n------\n\nChin Music #1\n\nShaw is a man on the run and lost in time. Fleeing ancient enemies, Shaw finds himself in prohibition-era Chicago surrounded by gangers and demons alike and caught between law enforcement and the local supernatural underground. CHIN MUSIC is a tale of mysticism and violence like nothing you've experienced before.\n\n------\n\nProphet #35\n\nWith the help of an ancient force, New father Prophet searches for a weapon to fight a deadly threat to the Empire.\n\n-------\n\nStorm Dogs #5 (of 6)\nThere are crimes far worse than murder. Where logic, reason and sanity end... there is Dark Science.\n\n------\n\nThe Walking Dead #110\n\nEzekiel vs. Michonne?\n\nGenres: Horror, Zombies\t\n\n------\n\nWitchblade #166\n\n&quot;SKELETONS&quot;\n\nSara Pezzini's world has become increasingly gray since she became a private investigator. Without the laws and regulations that being a cop used to provide, Sara has no idea whether her actions have been for the greater good or not. But to both put food on the table and stop a more powerful evil, Sara will need to dig up enough dirt to destroy the career of the only decent and honest politician left in Chicago.\n\nGenre: Supernatural\t\n","torrent":{"xt":"urn:btih:95b46921c6ee49c75d0fb97fe74429f924fe867b","amp;dn":"IMAGE+COMICS+WEEK+OF+2013.05.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95b46921c6ee49c75d0fb97fe74429f924fe867b","infoHashBuffer":{"type":"Buffer","data":[149,180,105,33,198,238,73,199,93,15,185,127,231,68,41,249,36,254,134,123]},"announce":[],"urlList":[]}}