{"title":"Dhanni Meye (1971) Bengali MHCe DVD5_No Subs [DDR]","uid":8241754,"size":4671786043,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96700f804c5acb72070ef76175106dd800119027&amp;dn=Dhanni+Meye+%281971%29+Bengali+MHCe+DVD5_No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1362972250,"description":"Dhanni Meye (1971) Bengali MHCe DVD5_No Subs [DDR]\n\nCAST:- Uttam Kumar, Jaya Bhaduri, Jahar Ray, Haridhan Mukherjee, Tarun Kumar, Chinmoy Roy, Mani Srimani, Sabitri Chatterjee, Nripati Chatterjee, Shyam Laha, Anubha Gupta, Shibani Bose, Robi Ghosh, Shambhu Bhattacharya\n\nDirected by Arabinda Mukherjee\nMusic by Nachiketa Ghosh\n\nSongs are included in MP3s\nDhanni Meye (1971) Bengali 00. Title Music and Screen Credits, Nachiketa Ghosh\nDhanni Meye (1971) Bengali 01. Ja Ja Behaya Pakhi\nDhanni Meye (1971) Bengali 02. Sab Khelar Sera\nDhanni Meye (1971) Bengali 03. Kalo Meyer Peyer Tolai\nDhanni Meye (1971) Bengali 04. Eei Betha\nDhanni Meye (1971) Bengali 05. Radhe Montar\nDhanni Meye (1971) Bengali 06. All Songs\n\nSYNOPSIS:- Dhanni Mey (1971)\nUttam Kumar plays Kali Dutta, a well-to-do businessman. He is amicable and loving. Though prone to losing his temper at the drop of a hat, he dotes on his wife, played by the inimitable Sabitri Chatterjee, and his brother Bogola, played by Partha Mukherjee. Bogola plays football for Sarbamangala Club, whose president is Dutta. This football club is supposed to play a match against Harbhanga club and Bogola and his teammates are practicing for it. They go to Harbhanga, but, Dutta is not able to accompany them for some reason. When the boys reach Harbhanga, they face one crazy situation after another. The village tomboy, Monosha, puts frogs inside Bogola's socks, the boys are duped into consuming alcohol so that they feel too sluggish to practice and so on. All because Gobordhan Chowdhury (Jahar Ray), the president of Harbhanga club won't have the Manchester Shield (named after his father, Manchester Chowdhury) leaving home!!!  So, the battle ensues. Bogola and the boys pull up their socks to vanquish their opponents...\nMonosha is an orphan. Chowdhury is her maternal uncle and Anubha Gupta (Rabi Ghosh's wife) is his wife. Given her carefree ways and her defiant personality, she is ill-treated by her guardians all the time. The uncle is also on the lookout of a suitable man to marry off Monosha. And, that boy turns out to be Bogola!!! The run-up to the marriage is absolutely comical. Bogola has to be literally carried to the mandap. He is being forced into matrimony and he behaves like a little kid saying that his brother is going to beat him up for this. In the ruckus, the priest (Rabi Ghosh, whose full name was Rabi Ghosh Dastidar, happens to be my uncle-in-law) bungles and recites funeral slokas! It's utter pandemonium out there...\nSo, though Bogola and the boys manage a thumping victory (12-0), Chowdhury doesn't give the Manchester Shield away. He sees off his niece. And that, Dutta won't like...\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Bengali\nRunTime: 2:17:38\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 2:17:38","torrent":{"xt":"urn:btih:96700f804c5acb72070ef76175106dd800119027","amp;dn":"Dhanni+Meye+%281971%29+Bengali+MHCe+DVD5_No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96700f804c5acb72070ef76175106dd800119027","infoHashBuffer":{"type":"Buffer","data":[150,112,15,128,76,90,203,114,7,14,247,97,117,16,109,216,0,17,144,39]},"announce":[],"urlList":[]}}