{"title":"EnigmaT Set Rips { Cuts } - May 9th, 2013","uid":8455638,"size":1153141513,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96917997c95624523f279c4caaba63de06e2737e&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+9th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":124,"time":1368058948,"description":"Adam Ellis - Napalm Poet (Set Rip)-enTc.mp3\nAirscape - Welcome Home (Cut From Gielen Set)-enTc.mp3\nAllen &amp; Envy - Fake Plastic Tears (Original Mix) (Cut From Binary Set)-enTc.mp3\nAna Criado and Adrian&amp;Raz - Dancing Sea (The Madison Banging Bootleg) (Cut From Super8 Set)-enTc.mp3\nAndrew StetS &amp; Anxess - Independence (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nAndrew StetS - Stop the Time (Cut From Andi Set)-enTc.mp3\nAndrew Stets - The Era (Cut From Lange Set)-enTc.mp3\nAndybody - The First Bass Is The Deepest (Dada Life Edit) (Cut From Claessen Set)-enTc.mp3\nAndybody - The First Bass Is The Deepest (Dada Life Edit) (Cut From Ferry Set)-enTc.mp3\nAnthony Mayer - Tyrantic (Peter Hulsmans Influence) (Cut From Solarstone Set)-enTc.mp3\nBloody Beetroots - Spank (GTA Remix) (Cut From R3hab Set)-enTc.mp3\nBlue Harvest - Falling Leaves (Mortagua Remix) (Cut From Tydi Set)-enTc.mp3\nBT - Skylarking (ilan Bluestone Remix) (ABGT 026 Rip)-enTc.mp3\nBT feat. Aqualung - Surrounded (Super8 &amp; Tab Remix) (-Short- ABGT 026 Rip)-enTc.mp3\nBT feat. Aqualung - Surrounded (Super8 &amp; Tab Remix) (Cut From Super8 Set)-enTc.mp3\nBXT - Sirius (Cut From Kenji Set)-enTc.mp3\nCarlo Calabro - Hamsta's Paradise (Cut From Skytech Set)-enTc.mp3\nCiro Visone - Double Line (Cut From Lazarus Set)-enTc.mp3\nD.O.D - Bomb The Bass (Cut From Nhato Set)-enTc.mp3\nDaleri feat. Vice - Somebody Told Me En Route (Kevin Focus Remix) (Cut From Nhato Set)-enTc.mp3\nDan Ascherl - Maza Chante 6.0 (Cut From J00F Set)-enTc.mp3\nDarren Tate - Tears (Original Mix) (ABGT 026 Rip)-enTc.mp3\nDave Shtorn - Underspace (Ivan Lu Remix) (Cut From Solarstone Set)-enTc.mp3\nDavid Horne - Lucarno (Original Mix) (Cut From Shah Set)-enTc.mp3\nDeep Voices feat. Alexander KG Klaus - Sound Of Love (Set Rip)-enTc.mp3\nDeep Voices feat. Jemma Endersby - Nomansland (Set Rip)-enTc.mp3\nDeep Voices feat. Jemma Endersby - Nomansland (Trance Mix) (Cut From Suzy Set)-enTc.mp3\nDeng &amp; Slavak - Legend Of Ararat (LoQuai Remix) (Cut From J00F Set)-enTc.mp3\nDepeche Mode - Soothe My Soul (Steve Angello vs Jacques Lu Cont Remix) (Cut From O'Neil Set)-enTc.mp3\nDestroyer - Ignite The Madness (Cut From Sherry Set)-enTc.mp3\nDim &amp; Rus - Gomel (Cut From Palagano Set)-enTc.mp3\nDimitris Athanasiou - Sun Is Shining (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nDJ Albert - 4G (Akira Kayosa 8G Refurb) (Cut From Magdelayna Set)-enTc.mp3\nDJ Triston vs. Dave-PL - Torque (Till van der Meid Remix) (Cut From Anna Lee Set)-enTc.mp3\nDonovans - Thuggno (Cut From Claessen Set)-enTc.mp3\nDreamy - Amphora (Original Mix) (Cut From Saux Set)-enTc.mp3\nDryra - Anarchy (Cut From Tydi Set)-enTc.mp3\nEmanuele Congeddu - Beyond The Heart (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nEmanuele Congeddu - Beyond the Heart (Original Mix) (Cut From Hassen B Set)-enTc.mp3\nEssonita &amp; K.I.R.A. - Lost My Heart To You (Azima Dub Mix) (Cut From Above Clouds Set)-enTc.mp3\nEssonita &amp; K.I.R.A. - Lost My Heart To You (Azima Dub Mix) (Cut From Tero A Set)-enTc.mp3\nEssonita feat. K.I.R.A - Tonight (Magdelayna Vocal Remix) (Cut From Magdelayna Set)-enTc.mp3\nEstiva - Teddybeat (Cut From Tritonal Set)-enTc.mp3\nEtasonic - More Than Beautiful (Sunset Remix) (Cut From A&amp;F Set)-enTc.mp3\nEthillas - Edel (Niels Vernimmen Remix) (Cut From Skytech Set)-enTc.mp3\nExtravangance SL - Captiva (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nFady &amp; Mina - Ninja (Dart Rayne &amp; Yura Moonlight Remix) (Cut From Ferry Set)-enTc.mp3\nFady &amp; Mina - Ninja (Original Mix) (Cut From Sherry Set)-enTc.mp3\nFamou - Reed (Original Mix) (Cut From Shah Set)-enTc.mp3\nFon.Leman - Feel The Same (Evave Remix) (Cut From Aurosonic Set)-enTc.mp3\nFull Tilt &amp; Bryan Kearney feat. Deirdre McLaughlin - Unlimited Dreams (Sean Tyas Remix) (Cut From Kearney Set)-enTc.mp3\nHideki &amp; Jelly - Space Walk (Andrea Berlotoni Remix) (Cut From O'Neil Set)-enTc.mp3\nHiroki Nagamine - Saw (Sergey Shabanov Remix) (Cut From Lazarus Set)-enTc.mp3\nHurts - Blind (Solarstone Pure Mix Edit) (Cut From Solarstone Set)-enTc.mp3\nHypaethrame - Fake World (Original Mix) (Cut From Saux Set)-enTc.mp3\nHypnotic State - Jovian Planet (Anna Lee Remix) (Cut From Anna Lee Set)-enTc.mp3\nIversoon &amp; Alex Daf - Illuminate (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nJace Williams - Hope &amp; Pray (Original Mix) (Cut From Sherry Set)-enTc.mp3\nJacob van Hage &amp; Impression - Razorbass (Cut From Ferry Set)-enTc.mp3\nJamaster A feat. Bi Bi Zhou - I Miss U Missing Me (Andrew Rayel Remix) (Cut From Bobina Set)-enTc.mp3\nJohlin - The Fang (Braden Erhardt Remix) (Cut From Bobina Set)-enTc.mp3\nJohn Dopping - Aryl (Mac &amp; Monday Remix) (Cut From A&amp;F Set)-enTc.mp3\nJuventa &amp; Kerry Leva - Just For Now (Cut From Juventa Set)-enTc.mp3\nKelly Andrew - The Incursion (Original Trance Mix) (Cut From Shadows Set)-enTc.mp3","torrent":{"xt":"urn:btih:96917997c95624523f279c4caaba63de06e2737e","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+9th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96917997c95624523f279c4caaba63de06e2737e","infoHashBuffer":{"type":"Buffer","data":[150,145,121,151,201,86,36,82,63,39,156,76,170,186,99,222,6,226,115,126]},"announce":[],"urlList":[]}}