{"title":"Michael G. Long - Christian Peace and Nonviolence Anthology (pdf","uid":8233816,"size":4479280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97b599c313cb5be76d2b7aaa653ebae4b70aa876&amp;dn=Michael+G.+Long+-+Christian+Peace+and+Nonviolence+Anthology+%28pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1362794558,"description":"Michael G. Long (editor) - Christian Peace and Nonviolence: A Documentary History (Orbis, 2011). 348 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nA comprehensive survey of two thousand years of Christian voices for peace.\n\nFrom the Sermon on the Mount to the twenty-first century, this broadly ecumenical reader recounts the Christian message of peace and nonviolence. Through testimony by the confessors and martyrs of the early church, the voices of medieval figures like St. Benedict and St. Francis, as well as Erasmus, the Lollards, Anabaptists, and Quaker abolitionists, up to modern peacemakers such as Martin Luther King, Jr., Thomas Merton, and Dorothy Day, Christian Peace and Nonviolence presents a coherent story in which the peace message of Jesus is restored to its central place.\n\nAbout the editor:\n\nMichael G. Long is associate professor of religious studies and peace and conflict studies at Elizabethtown College in Pennsylvania and lives in Camp Hill, Pensylvania. He has a doctoral degree from Emory University and is the author or editor of several books on civil rights, politics, and religion. He has a special interest in the genre of letters and is the editor of I Must Resist: Bayard Rustin's Life in Letters; and Marshalling Justice: The Early Civil Rights Letters of Thurgood Marshall. Long's book on Jackie Robinson was selected as a best book of the year by Publishers Weekly and received critical acclaim in The New York Times, the Los Angeles Times, Book Forum, Ebony/Jet, and other major media outlets. He is a popular speaker, with engagements from the National Archives in Washington, D.C., to the City Club of San Diego, and has appeared on C-Span and National Public Radio.","torrent":{"xt":"urn:btih:97b599c313cb5be76d2b7aaa653ebae4b70aa876","amp;dn":"Michael+G.+Long+-+Christian+Peace+and+Nonviolence+Anthology+%28pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b599c313cb5be76d2b7aaa653ebae4b70aa876","infoHashBuffer":{"type":"Buffer","data":[151,181,153,195,19,203,91,231,109,43,122,170,101,62,186,228,183,10,168,118]},"announce":[],"urlList":[]}}