{"title":"The Flaming Lips - The Terror [24 bit FLAC] vinyl","uid":8386913,"size":1766551107,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97e149b9bd75044b90e78eeeea8a747481d3aa1d&amp;dn=The+Flaming+Lips+-+The+Terror+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"24.96","files":-1,"time":1366308735,"description":"  The Flaming Lips - The Terror (2013) w/ Bonus 7&quot; [24 bit FLAC] vinyl\n\n  Released: 2013\n  Source:  LP388 / Europe\n  Genre: Pop/Rock\n  Style: Psychedelic Rock, Alternative, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Look The Sun Is Rising\n  A2. Be Free...A Way\n  A3. Try To Explain\n  B1. You Lust\n  B2. The Terror\n  C1. You Are Alone\n  C2. Butterfly, How Long It Takes To Die\n  C3. Turning Violet\n  C4. Always There In Our Hearts\n  D.  We Don't Control The Controls\n  E.  Sun Blows Up Today\n  F.  All You Need Is Love\n\n  One of the Flaming Lips' greatest strengths is how vividly they express emotions. For most of their career, they've focused on capturing wide-eyed wonder, unbridled glee, and the occasional poignant moment, but The Terror proves they're just as good at channeling despair. Embryonic hinted at this darker shift, but here it comes to a head: sparked by Wayne Coyne's separation from his longtime partner and Steven Drozd's struggles with substance abuse, The Terror is more fragmented and anguished than its predecessor. Where Embryonic's bold swaths of noise and pulsing synths broke free of expectations, on The Terror they represent being cut loose and drifting off into loneliness and doubt. The opening track, &quot;Look... The Sun Rising&quot; makes it clear that this is not the Flaming Lips fans have come to expect since the late '90s. As Coyne sings &quot;Love is always something/Something you should fear&quot; and invokes MK Ultra, harsh guitars and beats create a wall of sound that's both claustrophobic and isolating. As dark as the album is, it's also some of the band's most fascinating music; vintage electronics buzz and whir around Coyne's wounded vocals in a way that recalls Meddle-era Pink Floyd and the Silver Apples in its spacy bleakness. The Terror was recorded in a short time and it shows in the urgency within every track, even the 13-minute centerpiece &quot;You Lust,&quot; which moves from some of the band's most shockingly angry moments (&quot;You've got a lot of nerve to fuck with me!,&quot; Coyne snarls at its beginning) to a delicate coda that evokes Raymond Scott's Soothing Sounds for Baby. While the album often feels like a black hole sucking up all the hope in the universe, to the band's credit, they're never too obvious about it. Coyne's largely philosophical lyrics are all the more striking in how they imply this feeling rather than just stating it, particularly on one of the loveliest and scariest tracks here, &quot;Butterfly, How Long It Takes to Die.&quot; It contemplates life and death on a personal and universal scope, linking it to the sun's rising and setting; throughout the album, the band uses the sun as a metaphorical reminder that life goes on even when you wish it wouldn't. Experimental even for a band that has made outlandish sounds and ideas its bread and butter for decades, The Terror finds the Flaming Lips at the peak of their powers as they embody what it's like to be overwhelmed; they don't offer a shoulder to cry on as much as an acknowledgment of just how isolating pain can be. While it's common to call artists brave for addressing life's darker moments, there's some truth to it: it's not easy to face up to and present the worst parts of being alive, much less in a way that's artistically pleasing or relevant. The Lips don't make it sound easy, which is why The Terror is so powerful.","torrent":{"xt":"urn:btih:97e149b9bd75044b90e78eeeea8a747481d3aa1d","amp;dn":"The+Flaming+Lips+-+The+Terror+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e149b9bd75044b90e78eeeea8a747481d3aa1d","infoHashBuffer":{"type":"Buffer","data":[151,225,73,185,189,117,4,75,144,231,142,238,234,138,116,116,129,211,170,29]},"announce":[],"urlList":[]}}