{"title":"PBS America Revealed 3of4 Electric Nation x264 AAC MVGroup.org","uid":8461011,"size":858792528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99ef563a2ac1c8c50e6a522fb216c53c13704098&amp;dn=PBS+America+Revealed+3of4+Electric+Nation+x264+AAC+MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":-1,"time":1368230832,"description":"America Revealed\n\nTravel Documentary hosted by Yul Kwon, published by PBS in 2012 - English narration\n\n\nInformation\n------------------------------\n\nAmerica Revealed is a unique look at what makes America tick, what it takes to keeps the biggest food machine in the world going, the delicate balance that keeps our supermarkets stocked with groceries and fast food restaurants supplied with fries. How we keep America moving with its vast and complex transport systems. How we propel ourselves through energy, what maintains the constant supply of fuel and electricity to our homes and businesses and finally how we keep up with the ever changing world, the import and export infrastructure that shapes our manufacturing industry.\n\nFrom the Corn farmer in Central Valley, California to the live wire cable repairers in New Jersey. Viewers will discover a fascinating new perspective on the hidden patterns and rhythms of American life, by looking through the eyes of individuals who all play a part in keeping America fed, moving, powered and making goods.\n\n\n3)  Electric Nation \nOur modern electric power grid has been called the biggest and most complex machine in the world - delivering electricity over 200,000 miles of high tension transmission lines. But even though the grid touches almost every aspect of our lives, it's a system we know very little about. Yul Kwon will travel around the country to understand its intricacies, its vulnerabilities, and the remarkable ingenuity required to keep the electricity on every day of the year. At New York State's governing grid control room, he learns how a massive blackout cut power to 40 million Americans and to understand how we can protect against this type of colossal failure joins a live wire repair team who do their daring repairs from the side of a helicopter in flight. He also visits the country largest coal mine, rappels down the side of wind turbine, takes a rare tour of a nuclear plant and travels on a massive tanker - where Kwon reflects on the challenges and opportunities we face now and in the days ahead to keep the power flowing.\n","torrent":{"xt":"urn:btih:99ef563a2ac1c8c50e6a522fb216c53c13704098","amp;dn":"PBS+America+Revealed+3of4+Electric+Nation+x264+AAC+MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ef563a2ac1c8c50e6a522fb216c53c13704098","infoHashBuffer":{"type":"Buffer","data":[153,239,86,58,42,193,200,197,14,106,82,47,178,22,197,60,19,112,64,152]},"announce":[],"urlList":[]}}