{"title":"Middle Brother - Middle Brother [2011][EAC,log,cue. FLAC]","uid":8416144,"size":335307515,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c5eb2267da754a1f930076b9a302f7897773f11&amp;dn=Middle+Brother+-+Middle+Brother+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":15,"time":1367045727,"description":"Info\n\nArtist: Middle Brother\nRelease: Middle Brother\nReleased: 2011\nFormat: Album, CD\nCountry: US\nStyle: Alternative, Alt-Country, Folk-Rock, Indie\n\n\nTracklisting\n\n01. Daydreaming\n02. Blue Eyes\n03. Thanks for Nothing\n04. Middle Brother\n05. Theater\n06. Portland\n07. Wilderness\n08. Me, Me, Me\n09. Someday\n10. Blood and Guts\n11. Mom and Dad\n12. Million Dollar Bill\n\nThe side project Middle Brother, a trio of the singer/songwriters Taylor Goldsmith (of Dawes), John McCauley (of Deer Tick), and Matthew Vasquez (of Delta Spirit), works because its members share a similar sensibility, so that, although they alternate selections as if participating in a song pull, the album holds together in the same spirit. That is, it holds together loosely, since the similar sensibility is the familiar one of the drunken slacker full of gallows humor, and the folk and folk-rock music, appropriately, is played in ramshackle, thrown-together arrangements. \n\nThe musicians tip their hand (and tip their hats) by covering Paul Westerberg's Portland, and Westerberg would fit right in with this bunch of guys, with their shared wry sense of humor and skewed point of view. Of course, whether it's Goldsmith, McCauley, or Vasquez at the microphone, a constant subject of interest is romantic relationships with women, and, not surprisingly, those relationships don't seem to be going well. Though the singers can be caustic -- Thanks for Nothing is one of Goldsmith's song titles -- they generally acknowledge that they're to blame. Not that they offer to reform. They seem to see themselves as at least potentially loveable screw-ups, and if the woman in question loses patience and takes off, well, there's always the bottle, and the guitar, and the road. In this sense, the singers reinforce their own worst tendencies, but they seem to be having fun, and since the listener isn't the one who's going to have to take them home, the music can be enjoyed without harm. [AMG 3Â½ / 5]","torrent":{"xt":"urn:btih:9c5eb2267da754a1f930076b9a302f7897773f11","amp;dn":"Middle+Brother+-+Middle+Brother+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c5eb2267da754a1f930076b9a302f7897773f11","infoHashBuffer":{"type":"Buffer","data":[156,94,178,38,125,167,84,161,249,48,7,107,154,48,47,120,151,119,63,17]},"announce":[],"urlList":[]}}