{"title":"Dancers Arms with Aruna DVD Rip Bellydance.avi","uid":8486684,"size":405895168,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9cb9944b4bcbeabf054012c47c07b6a424117ffe&amp;dn=Dancers+Arms+with+Aruna+DVD+Rip+Bellydance.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sara_melika","files":1,"time":1368886229,"description":"Aruna's introduction begins with a simple demonstration on how to achieve a great posture and starting position for arm movement.  The first chapter &quot;Middle Eastern Arms&quot; begins with a walk through of several variations of snake arms and alternatives for those who may have shoulder/pain limitations.  \n\nSnake arms are often taught poorly and with little focus on really stretching the movement in a dynamic way - this is the most clear and sensible breakdown I have seen. \nThe chapter progresses with ideas to implement snake arms with varying body postures and syncopations.  Wrist rolls are especially well described, displayed and executed, as well as a series of changing body positions and movements in which to implement them.  While these are basic moves, they are demonstrated with excellent technique body posturing as well as several developing methods in which to accent featured hip moves.  I found this section especially helpful in hand positioning, hence preventing a cracked or jagged line, which often happens when dancers bend wrists too far during circles and other similar moves.  The section moves on to demonstrate other arm movements such as a Persian style arm as well as ones using a touch of a Flamenco influence, which leads us to chapter 2, &quot;Flamenco Arms.&quot;\n\nThis section is definitely challenging and to a faster tempo. \n\nBeginning with &quot;floreos&quot; inward and outward, Aruna has you focus on really separating your fingers and sensing each one in movement, truly instilling a muscle memory connection.  \nFloreos progress to a series of arm postures and eventually challenging turns incorporating arm movements.  There is also some fiery skirt work instruction.  While not a huge fan of Flamenco, I did appreciate the body positioning I came away with, as well as the hand embellishments and passionate gesturing and stances I now find myself doing to music, often without even thinking about it, it's just that fun!\n\nThe third chapter focuses on &quot;Hindu Arms&quot;, and is my most favorite chapter.  Beginning with a series of mudras (finger gestures), Aruna takes the viewer on a mystical journey through a wide variety of postures and flowing arm movements, explaining the meaning behind each of them.  From &quot;cup of love&quot; to &quot;lyrical dancer&quot; to &quot;bow and arrow&quot;, each movement poses the subject in a way that is worthy of a mystical painting.  \n\nWhile this section may not be for the Raqs Sharqi purist, it certainly will give grace and style to anyone, and is a killer set of base moves for fusion artists to work and develop from.  \nWhat's more, it just feels good, and much like a transcendental yoga experience, it is pretty amazing to begin to move and use your arms to compliment your body without having to think too hard about it.  This section ends with a dancer's prayer, which is an all around good vibe and a nice way to finish the instructional sections.\n\n&quot;Adagio Arms,&quot; is a follow along taxim, encouraging the subject to utilize and practice moves combined from the previous sections.  The flow is easy, the music is peaceful, and this guide is especially useful in developing a constant movement at differing intervals, timing changes, juxtapositions of body weight and minor level changes.  Adagio arms is an excellent daily warm-up and a wonderful tool for establishing comfort and confidence in arm use.  The next section is an upbeat fusion performance showing how Aruna incorporates these movements at a faster tempo with spins, turns and other steps.  Her use of arms to accent high and low points of the music and key up specific instrumental sounds is especially impactful, as far too few dancers pay attention to the music anymore.  Aruna also includes a workout section with tips to help develop lean luscious arms.  Given her experience with fitness and health, I really appreciated her sharing these training secrets in an easy and helpful way.  Aruna is so well spoken, descriptive, and organized in a thoughtful and progressively challenging way to the dancer; her clarity of her ideas is easy to follow and thoroughly enjoyable to follow along to.  The music is sensibly chosen in a way that adds to the flavor of each chapter, is accessible to a variety of age groups and does not compete with the instruction.  \n\nThe videography is impeccable, and camera angles keep the viewers attention where it should be.\nWhat this DVD is NOT - this is not a raqs sharqi instructional DVD or whatever the latest foremost Egyptian dance guru has said is the defining splendor of Egyptian.  You will not get the skills to out-Egypt anyone.  \n\nWhat this DVD IS - a fantastic mental icebreaker and technique enhancer to get you moving your arms and your body in a way where you don't look like an idiot.  Aruna has obviously mastered many styles of dance and is an adept and experienced instructor.  \nThere are more combinations of arm movements and attractive body postures that gracefully flow from one to the next on this DVD than I have seen in most instructional videos to date.  In fact, I double dog dare you to show me a better one.  Unless you are working one on one with a dance coach who helps you incorporate other influences into your dancer's toolkit, I can almost guarantee it will take you many costly lessons to learn the half the technique, graceful arm movement, dance posture, ideas and sheer horse-sense demonstrated in this DVD. Very professional, extremely well thought out and a true value, this is a superb practice DVD and dancer's companion.  Other video makers should be following Aruna's excellent example of a polished product and affordable price point.\n\n","torrent":{"xt":"urn:btih:9cb9944b4bcbeabf054012c47c07b6a424117ffe","amp;dn":"Dancers+Arms+with+Aruna+DVD+Rip+Bellydance.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cb9944b4bcbeabf054012c47c07b6a424117ffe","infoHashBuffer":{"type":"Buffer","data":[156,185,148,75,75,203,234,191,5,64,18,196,124,7,182,164,36,17,127,254]},"announce":[],"urlList":[]}}