{"title":"TankZe V1.3 IPA Dutch / Nederlands","uid":8459868,"size":1543574,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:9cf8db0751fb75ef84550ca2ee1a377990807eea&amp;dn=TankZe+V1.3+IPA+Dutch+%2F+Nederlands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AntRaw","files":1,"time":1368208168,"description":"Oeps, tank bijna leeg. Maar alleen dure tankstations hier naast de snelweg. Kan dat nou niet goedkoper?\n\nTankZe helpt je te besparen op de brandstofkosten!\n\nTankZe is een iPhone applicatie die het mogelijk maakt brandstofprijzen te vergelijken van leveranciers in je directe omgeving. Dus, tank bijna leeg, zoek de goedkoopste aanbieder en tanken maar. Oftewel: TankZe!\n\nHoe werkt het?\n\nDe iPhone applicatie TankZe geeft bij aanzetten direct een overzicht van de dichtstbijzijnde tankstations en hun brandstofprijzen, op basis van de voorkeuren die nog bekend zijn van de vorige keer. In die voorkeuren kun je aangeven welke brandstof je nodig hebt. Ook kun je aangeven of je bepaalde merken al dan niet in je selectie terug wilt zien.\n\nIn het zoekresultaat zie je de hemelsbrede afstand naar de tankstations, de prijzen en de benzinemerken. Bovendien geeft TankZe aan hoe actueel die prijs is. Als je doorklikt krijg je via maps de betreffende locatie en de route ernaartoe.\n\nMogelijkheden:\n\n- selectie van merken die meegenomen moeten worden\n- aangeven van brandstoftypen\n- (hemelsbrede) afstand naar tankstations in de buurt\n- navigatie naar gekozen tankstation via maps\n- sorteren op prijs, afstand of merk\n\nDisclaimer\n\nTankZe maakt gebruik van informatie die vrij op internet te verkrijgen is. Wij kunnen daarom niet voor de volle 100% instaan voor de kwaliteit van die informatie. De afstanden in de zoeklijst worden hemelsbreed weergegeven en zijn bedoeld ter indicatie. De werkelijke afstand wordt pas in de routeberekening benaderd. Alle auteursrechten en andere intellectuele eigendomsrechten met betrekking tot de beeldmerken, merknamen en de inhoud van de aanbiedingen in deze applicatie, komen toe aan de opgenomen brandstofleveranciers.","torrent":{"xt":"urn:btih:9cf8db0751fb75ef84550ca2ee1a377990807eea","amp;dn":"TankZe+V1.3+IPA+Dutch+%2F+Nederlands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cf8db0751fb75ef84550ca2ee1a377990807eea","infoHashBuffer":{"type":"Buffer","data":[156,248,219,7,81,251,117,239,132,85,12,162,238,26,55,121,144,128,126,234]},"announce":[],"urlList":[]}}