{"title":"[+] Sol: Sun Clock - v1.2.2 (Cracked)","uid":8300864,"size":4440972,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:9d2f166dc16c22367c31287b71f1a14f92bd076c&amp;dn=%5B%2B%5D+Sol%3A+Sun+Clock+-+v1.2.2+%28Cracked%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Xanthippus","files":-1,"time":1364266658,"description":"This torrent contains Sol: Sun Clock (v1.2.2) by Juggleware LLC, cracked for the Apple iPhone &amp; iPad.\n\n\nDescription:\n\nNow your iOS device can remind you when it's sunrise or sunset, wherever you travel!\n\nSol: Sun Clock is the Swiss army knife of sunlight tools with a design inspired by the simplicity of the sundial. Use it to plan your day, guide natural sleep cycles, plan the perfect photograph or to map out the best times to go fishing. \n\n* Be in tune: Sol will tell you how much sunlight you have left in the day or what time the next sunrise occurs.\n\n* Find solar midnight and solar noon, and all three twilight (dawn and dusk) periods: astronomical twilight, nautical twilight, and civil twilight. Keep tabs on the next solstice and equinox.\n\n* Reminders and Alarms: Use Sol as a natural alarm clock that you can set to any event (like sunset, golden hour or solar noon), and the alarm or reminder time will adjust gradually as the days change with the seasons.\n\n* Automatic Location: Sol not only calculates the amount of daylight and sunrise and sunset times, but does so for any location in the world (both Northern and Southern hemispheres) by using your device's GPS... no network connection required. \n\n* Other locations: Optionally, use the built-in map to choose any location in the world by moving the pin, or search using the name of any city.\n\n* Optional location-aware alarms. Sol knows when you change with your location; and as you travel it will adjust any alarms you set relative to sunrise and sunset times. Create alarms for multiple locations around the world.\n\nChangelog:\n\nFix to crash on iPad (when changing the date) that was introduced in 1.2.1.\n\n\nDon't forget to seed!\n\n  _\n ( ((\n   =\n ___ `- \n(____))(  ----\n(____)) _  \n(____))\n(____))____/----","torrent":{"xt":"urn:btih:9d2f166dc16c22367c31287b71f1a14f92bd076c","amp;dn":"%5B%2B%5D+Sol%3A+Sun+Clock+-+v1.2.2+%28Cracked%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d2f166dc16c22367c31287b71f1a14f92bd076c","infoHashBuffer":{"type":"Buffer","data":[157,47,22,109,193,108,34,54,124,49,40,123,113,241,161,79,146,189,7,108]},"announce":[],"urlList":[]}}