{"title":"Petra Haden - Petra Haden Sings: The Who Sell Out [2005][EAC,log","uid":8458978,"size":221932410,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e28a665e9ce48982b9610683fa6360b9d34a432&amp;dn=Petra+Haden+-+Petra+Haden+Sings%3A+The+Who+Sell+Out+%5B2005%5D%5BEAC%2Clog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":17,"time":1368180826,"description":"Requested by csslouis on TBP\n\nArtist: Petra Haden\nRelease: Petra Haden Sings: The Who Sell Out\nReleased: 2005\nLabel: Bar/None Records\nCatalog#: BRN-CD-160\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: alternative, rock, a.cappella\n\n\n\n1. Armenia City In The Sky\n2. Heinz Baked Beans\n3. Mary Anne With The Shaky Hand\n4. Odorono\n5. Tattoo\n6. Our Love Was\n7. I Can See For Miles\n8. I Can't Reach You\n9. Medac\n10. Relax\n11. Silas Stingy\n12. Sunrise\n13. Rael\n\nIn the 21st century, the Who have become spokesrockers. &quot;Who Are You&quot;, &quot;Won't Get Fooled Again&quot;, &quot;Baba O'Riley&quot;-- as themes for CBS' &quot;CSI&quot; franchise the songs are meaty enough and beaty enough to match David Caruso's ego, while being big enough to hook baby boomers into Tivoing the clunky procedural crime dramas. Someday a CBS! Miniseries! Event! will unite the three &quot;CSI&quot; casts in an epic struggle against GSR residue and Dan Cortese's career as a character actor, and its theme song will be the 10-minute Tommy epic &quot;Underture&quot;. When that happens, the Who will have reached Kravitzian levels of licensing overexposure. But in the meantime we can still enjoy the band's music for its strong points-- thundering power chords, machismo blending with naughty British schoolboy humor, ambitious flights of pop songwriting, and a conceptual scope that was as enviable as it was flawed.\n\nAll of that's wrapped up in Petra Haden Sings: The Who Sell Out, the Los Angeles singer's a capella interpretation of the Who's 1967 album. Haden recreates the entire record with only her voice and an eight-track recorder, from the flatulent trumpets and &quot;What's for tea, darling?&quot; drop-ins of fake advert &quot;Heinz Baked Beans&quot; to the swirling psych-rock of classic rock radio staple &quot;I Can See for Miles&quot;. On the latter her harmonic selves suggest a Mellotron while she sings the lead in a voice that's clear and bright, but also a little deadpan. And that wryness is important for Haden, because it's both a connection to and a departure from her primary source. While Who Sell Out was a gleeful lambaste of advertising and radio, it also featured some really strong songs. Haden understands both aspects, but knows she can't retell it accurately with her limited materials. So she doesn't. She uses suggestion instead, and a fan's emulation, and her own sense of humor, too; she makes something that loves its predecessor but has no intention of resembling it exactly. And at that, the baby boomers and rockists breathed a little easier.\n\nAs the story goes, Mike Watt put Haden up to this project in the first place. She'd already done an a capella record-- 1996's fanciful Imaginaryland-- and Watt wondered what she might do with one of his favorites. There's no purism in that backstory. Petra Haden Sings: The Who Sell Out is just a fun exercise, the work of a daydreaming geek girl who sings like an angel and makes cool guitar noises with her mouth. Its casual &quot;Why not?&quot;-ness is its greatest strength. But there's attention to detail here, too. &quot;Face the music with Odorono&quot;, the original Sell Out's fake ad copy smirked beneath a shot of Townshend mugging with an enormous can of the stuff. &quot;The all-day deodorant that turns perspiration into inspiration!&quot; But at the same time, the actual song &quot;Odorono&quot; exemplified the songwriter's emerging flair for epic pop. Haden has fun recreating the album art, and the songs on Sell Out, too. Of course, since she's the only instrument, this is done with lots of layers and a general knack for hitting the sweet spot of Pete's famous fanfares. &quot;TRIUMPHANT!/ Was the way she felt/ As she acknowledged the applause...&quot;","torrent":{"xt":"urn:btih:9e28a665e9ce48982b9610683fa6360b9d34a432","amp;dn":"Petra+Haden+-+Petra+Haden+Sings%3A+The+Who+Sell+Out+%5B2005%5D%5BEAC%2Clog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e28a665e9ce48982b9610683fa6360b9d34a432","infoHashBuffer":{"type":"Buffer","data":[158,40,166,101,233,206,72,152,43,150,16,104,63,166,54,11,157,52,164,50]},"announce":[],"urlList":[]}}