{"title":"Coast to Coast AM May 11, 2013 - America's Ancient Secrets","uid":8472346,"size":57440481,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9faac30e66c277dcfdc711dc3971a1b06adacd52&amp;dn=Coast+to+Coast+AM+May+11%2C+2013+-+America%27s+Ancient+Secrets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1368517046,"description":"Coast to Coast AM for May 11, 2013. America's Ancient Secrets\n\nNote: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nHost: John B. Wells\n\nInvestigative journalist and radio host \nJosh Reeves\n joined John B. Wells for a discussion on America's forgotten history. Reeves shared his research into a mysterious wall buried under Rockwall, Texas.\nThe ancient structure was built by an advanced civilization that pre-dated the arrival of Native Americans, he revealed. Beneath Rockwall are crystals\nwith strong piezoelectrical properties, Reeves reported, noting how they may have been part of a harmonic energy generator used to launch spacecraft. His\ninvestigation into who could have built the wall, as well as the archaic mounds found all over the world, uncovered evidence for a race of giants. \n\nAccording to Reeves, giant remains and other artifacts have been uncovered near and within mounds dating as far back as the most ancient Middle Eastern\nsocieties. Some mounds, such as those in Moundville, Alabama, were constructed over several hundred years and aligned to specific celestial locations,\nhe explained, adding that they may have acted as a portal to another star system. Native American tales speak of a graveyard for giants that existed eons\nbefore they migrated into the land, Reeves continued. In addition, their culture has preserved myths of a race of red-haired giants that waged war against\na group of black-haired giants, he disclosed. \n\nReeves suggested the Smithsonian Institution was engaged in subterfuge regarding artifacts which share similarities with other ancient cultures across\nthe planet and support the existence of a lost civilization in America. Like the Ark of the Covenant in Raiders of the Lost Ark, the Smithsonian has a way of misplacing such artifacts, Reeves said. The powers that be may fear a loss of control over the people should the truth ever come out about these ancients and the knowledge they possessed, he proposed. Reeves also talked about other various government cover-ups and conspiracies, including chemtrails, which he said serve a variety of applications from modifying the weather to acting as a global radar system capable of imaging the entire planet. \n\ncontent information\nWebsite(s):\n theglobalreality.com\nVideo(s):\n The Lost Secrets of Ancient America, Volume 1\n","torrent":{"xt":"urn:btih:9faac30e66c277dcfdc711dc3971a1b06adacd52","amp;dn":"Coast+to+Coast+AM+May+11%2C+2013+-+America%27s+Ancient+Secrets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9faac30e66c277dcfdc711dc3971a1b06adacd52","infoHashBuffer":{"type":"Buffer","data":[159,170,195,14,102,194,119,220,253,199,17,220,57,113,161,176,106,218,205,82]},"announce":[],"urlList":[]}}