{"title":"Bigasoft.RealPlayer.Converter.v3.7.34.4820.Incl.Keymaker","uid":8355800,"size":11100258,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a027fae5dae96bc73051471d97bd43f6df2b96dc&amp;dn=Bigasoft.RealPlayer.Converter.v3.7.34.4820.Incl.Keymaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pspxxx","files":4,"time":1365493246,"description":"\nBigasoft RealPlayer Converter\nThe Best Real Player Converter for RealMedia File Conversion\n\nReal Player Converter is versatile RealMedia converter to convert RealVideo and RealAudio media file to various video formats as well as to convert any video to video and audio playable with RealPlayer for play and enjoy on RealPlayer. \n\nReal Player Converter is outstanding RealPlayer file converter that is capable of converting RealPlayer file in RM, RMVB, RV, RAM, IVR, and RA. It can fast convert RealVideo to AVI, MP4, MOV, 3GP, FLV, H.264, HD, MKV, WMV, VOB, Xvid, DivX, RAD, BIK, WebM, etc and convert Real video and RealAudio to MP3, OGG, AAC, AC3, WAV, WMA, etc. RealPlayer Converter is also known as excellent Real Player to AVI Converter, Real Player to WMV Converter. \n\nThe powerful Real Player Converter also makes it possible to enjoy all kinds of formats videos with Real Player. RealPlayer can only play several video and audio formats including MP3, MPEG-4, QuickTime, Windows Media, and multiple versions of proprietary Real audio and Real video formats. By the help of RealPlayer Converter, you can convert AVI, MKV, AVCHD, WebM, BIK, RAD, WTV, MTV, MAV and more to RealPlayer compatible videos for enjoy on RealPlayer. \n\nWhat's more, Real Player Converter is powered with a smart video editor which allows you to trim, crop, merge videos/audio,adjust the parameters, video effects to customize output effect, capture pictures, add adjust subtitles, watermark and more. \n\n\nDownloading video from YouTube function is added to this RealPlayer Converter. Acting as the reliable Real Player YouTube downloader, Bigasoft RealPlayer Converter can fast download YouTube videos maximally in 1080p or 720p as well as convert to desired video and audio formats. \n","torrent":{"xt":"urn:btih:a027fae5dae96bc73051471d97bd43f6df2b96dc","amp;dn":"Bigasoft.RealPlayer.Converter.v3.7.34.4820.Incl.Keymaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a027fae5dae96bc73051471d97bd43f6df2b96dc","infoHashBuffer":{"type":"Buffer","data":[160,39,250,229,218,233,107,199,48,81,71,29,151,189,67,246,223,43,150,220]},"announce":[],"urlList":[]}}