{"title":"Horse Feathers - House With No Home [2008][EAC,log,cue. FLAC]","uid":8456510,"size":188748204,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1102832224487d0a1e001a271e056ca477e15ff&amp;dn=Horse+Feathers+-+House+With+No+Home+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":14,"time":1368120398,"description":"Artist: Horse Feathers\nRelease: House With No Home\nReleased: 2008\nLabel: Kill Rock Stars\nCatalog#: KRS495\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana,rock,folk\n\n\n\n\n1. Curs In The Weeds 3:30\n2. Rude To Rile 3:29\n3. Working Poor 3:16\n4. Albina 2:17\n5. A Burden 3:31\n6. Helen 4:20\n7. Father Reprise 2:01\n8. Heathen's Kiss 4:40\n9. Different Gray 2:56\n10. This Is What 3:09\n11. Father 3:30\n\nHorse Feathers are by definition a string band. There's not a non-string instrument between the three of them, unless you count their voices. The Portland trio is a distant cousin to groups like Chatham County Line, the Avett Brothers, and the Hackensaw Boys, only without the Appalachian influences. The traditions Horse Feathers draw from are vaguer and perhaps more recent, specifically Pacific Northwest indie (Peter Broderick has worked with Norfolk &amp; Western and Dolorean). They pluck instead of pick and never fiddle, and percussion is limited to the arrhythmic clatter of pots and pans. The difference is crucial: Horse Feathers sound contemporary rather than nostalgic, yet retain a down-from-the-mountain sensibility as if they come into town once a month to stock up on provisions and record a track or two. Their second album, House With No Home, is folk music for hermits and misers.\nIn the two years since Horse Feathers' reverb-drenched debut, Words Are Dead, the group has not only signed to Kill Rock Stars but has grown from a duo into a trio. Joining singer-songwriter Justin Ringle and multi-instrumentalist Peter Broderick is Heather Broderick, who subtly fills out Horse Feathers' still sparse sound. Her cello adds low end to most songs, and her harmonies with Ringle add texture to &quot;This Is What&quot; and the gentle closer &quot;Father&quot;. She and her brother treat Ringle's songs almost as small filmstrips to be scored, so the strings swirl and dive dramatically, swooping and straining and adding an eerie ambience to these hard-luck tales. Even the instrumental &quot;Father Reprise&quot;, with its battered piano and what sounds like a singing saw, sounds heavy with resignation, then leads into the tense and instrumentally sparse &quot;Heathen's Kiss&quot; and the sleepy-eyed &quot;Different Gray&quot;.\nAbove it all Ringle sings in a clear voice, and even from song to song, it sounds higher and coarser than expected, as if he has gone weeks without speaking to another soul. It fits his impressionistic narratives perfectly. On &quot;Rude to Rile&quot; and &quot;Working Poor&quot; he handles his hooks gracefully, keening thinly over the strings and chewing his words to suggest a regional dialect. Listen to him pronounce the word &quot;case&quot; on the chorus of &quot;Working Poor&quot;, drawing out that long vowel sound into one-and-a-half syllables before easing up on the final consonant hiss. It's a minor moment, but it gives the song something like local color.\nNothing on House With No Home is obvious or overwhelming; the album works more by insinuation than by outright statement, which creates a pervasive chilliness but also means that these songs sink in only after prolonged exposure. They cast a powerful spell and sustain it over 11 tracks, yet at times you wish they'd jam, or perform a cover, or do anything to break it up somehow. Maybe that says more about the listener than the band. Ultimately, that unworldliness may be Horse Feathers' greatest charm. Theirs is a life in the wilderness, not merely a sojourn.","torrent":{"xt":"urn:btih:a1102832224487d0a1e001a271e056ca477e15ff","amp;dn":"Horse+Feathers+-+House+With+No+Home+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1102832224487d0a1e001a271e056ca477e15ff","infoHashBuffer":{"type":"Buffer","data":[161,16,40,50,34,68,135,208,161,224,1,162,113,224,86,202,71,126,21,255]},"announce":[],"urlList":[]}}