{"title":"Grateful Dead - Nightfall Of Diamonds (2001) {FLAC} vtwin88cube","uid":8442153,"size":904683997,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a349e16252317d3cb821b33c2c20b2dfb5e9b438&amp;dn=Grateful+Dead+-+Nightfall+Of+Diamonds+%282001%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1367797743,"description":"\n\n\nGrateful Dead\nNightfall Of Diamonds (2001)\n\n\n\n\n\nallmusic.com...\n\nThe Warlocks made their electric debut that July; Ken Kesey soon tapped them to become the house band at his notorious Acid Tests, a series of now-legendary public LSD parties and multimedia &quot;happenings&quot; mounted prior to the drug's criminalization. As 1965 drew to its close, the Warlocks rechristened themselves the Grateful Dead, the name taken from a folk tale discovered in a dictionary by Garcia; bankrolled by chemist/LSD manufacturer Owsley Stanley, the band members soon moved into a communal house situated at 710 Ashbury Street in San Francisco, becoming a fixture on the local music scene and building a large fan base on the strength of their many free concerts. Signing to MGM, in 1966 the Dead also recorded their first demos; the sessions proved disastrous, and the label dropped the group a short time later. \n\n\nAudio Quality:\t\tFLAC (Lossless)\nAudiochecker:\t     \t99.75% CDDA &amp; 99.83% CDDA\nLabel:\t\t\tGrateful Dead Rwcords\nCatalog:\t\tGDCD 4081\n\n\n\nAudio Info:\n\n\nThis double-disc release highlights the Grateful Dead's final performance of a five show run at the Meadowlands Arena. Deadheads unanimously herald October 16, 1989 -- guitarist/vocalist Bob Weir's 42nd birthday -- as one of the best shows not only of the band's fall tour, or even of the year, but of the decade. Nightfall of Diamonds presents this landmark concert replete with one of the most accurate soundstages of any Grateful Dead vintage release. If you couldn't get a floor seat then, you can now. The Dead's fall tour of 1989 coincided with the release of Built to Last -- their 13th studio release. The loosely structured and perpetually evolving set lists allowed for the integration of newer tunes such as &quot;Picasso Moon&quot; -- the up-tempo rocker that opens this set -- with more established works from their 200-plus song canon. &quot;Mississippi Half-Step Uptown Toodleoo,&quot; coupled here with the funky &quot;Feel Like a Stranger,&quot; reveals some excellent ensemble playing. Jerry Garcia's lead guitar lines are precise and well developed as he maneuvers the band into territories considered unattainable in the late '80s by skeptical enthusiasts. Another first set highlight is the overtly bluesy &quot;Never Trust a Woman&quot; -- featuring the first of two lead vocals from The Dead's '80s keyboardist, Brent Mydland. The pairing of &quot;Let It Grow&quot; to an exceptionally engaging performance of &quot;Deal&quot; conclude the first set with the same high energy with which it began. Set two/disc two continues to exhibit The Dead's imposing strength. From the opening strains of the psychedelically acquiescent &quot;Dark Star&quot; -- which envelopes a majority of the second set -- to the a cappella encore &quot;We Bid You Goodnight,&quot; The Dead morph their entire quarter-century history into the space of less than 80 minutes. Every genre and stylistic approach is uncovered, including nearly half an hour of premier instrumentation which links &quot;Uncle John's Band&quot; to the second Brent Mydland vocal, &quot;I Will Take You Home.&quot; Nightfall of Diamonds disengages the misnomer that the Grateful Dead were outmoded and strung out in their final years of performance. Additionally, the set is offered as the quintessence of everything musically addictive to Deadheads during this era. \n\n\nCD 1\n\n01.Picasso Moon\n02.Mississippi Half-Step Uptown Toodleloo\n03.Feel Like A Stranger\n04.Never Trust A Woman\n05.Built To Last\n06.Stuck Inside Of Mobile With The Memphis Blues Again\n07.Let It Grow\n08.Deal\n\n\nCD 2\n\n01.Dark Star\n02.Playing In The Band\n03.Uncle John's Band\n04.Jam\n05.Drums\n06.Space\n07.I Will Take You Home\n08.I Need A Miracle\n09.Dark Star\n10.Attics Of My Life\n11.Playing In The Band\n12.We Bid You Goodnight\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n\n","torrent":{"xt":"urn:btih:a349e16252317d3cb821b33c2c20b2dfb5e9b438","amp;dn":"Grateful+Dead+-+Nightfall+Of+Diamonds+%282001%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a349e16252317d3cb821b33c2c20b2dfb5e9b438","infoHashBuffer":{"type":"Buffer","data":[163,73,225,98,82,49,125,60,184,33,179,60,44,32,178,223,181,233,180,56]},"announce":[],"urlList":[]}}