{"title":"Arrow.S01E23.720p.HDTV.X264-DIMENSION","uid":8478754,"size":1324137020,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a4a8b7f1710a4a15e71af396c48d01d03eb619ab&amp;dn=Arrow.S01E23.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"R0thschild","files":4,"time":1368679209,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n    \n              ***********************************************\nGenre: Action, Adventure, Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Greg Berlanti, Marc Guggenheim, Andrew Kreisberg\nCast: Stephen Amell, Emily Bett Rickards, Katie Cassidy, Willa Holland, Colin Donnell, Susanna Thompson\n\n.: Plot :.\nAfter a violent shipwreck, billionaire playboy Oliver Queen was missing and presumed dead for five years before being discovered alive on a remote island in the Pacific. When he returns home to Starling City, his devoted mother Moira, much-beloved sister Thea, and best friend Tommy welcome him home, but they sense Oliver has been changed by his ordeal on the island. While Oliver hides the truth about the man he's become, he desperately wants to make amends for the actions he took as the boy he was. Most particularly, he seeks reconciliation with his former girlfriend, Laurel Lance. As Oliver reconnects with those closest to him, he secretly creates the persona of Arrow - a vigilante to right the wrongs of his family, fight the ills of society, and restore Starling City to its former glory. By day, Oliver plays the role of a wealthy, carefree and careless philanderer he used to be - flanked by his devoted chauffeur/bodyguard, John Diggle - while carefully concealing the secret identity he turns to under cover of darkness. However, Laurel's father, Detective Quentin Lance, is determined to arrest the vigilante operating in his city. Meanwhile, Oliver's own mother, Moira, knows much more about the deadly shipwreck than she has let on and is more ruthless than he could ever imagine.","torrent":{"xt":"urn:btih:a4a8b7f1710a4a15e71af396c48d01d03eb619ab","amp;dn":"Arrow.S01E23.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a8b7f1710a4a15e71af396c48d01d03eb619ab","infoHashBuffer":{"type":"Buffer","data":[164,168,183,241,113,10,74,21,231,26,243,150,196,141,1,208,62,182,25,171]},"announce":[],"urlList":[]}}