{"title":"Complete Sims 3 Store May 2013 (package and decrapified sims3pac","uid":8465948,"size":10223544684,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4ca1dd7e6d9e364998bfaea5070db7b8a1f12e0&amp;dn=Complete+Sims+3+Store+May+2013+%28package+and+decrapified+sims3pac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rachelstoolbox","files":133,"time":1368353608,"description":"This is the COMPLETE Sims 3 Store items listing as of May 11, 2013. All files have been put into .package form by set, so no need to deal with the horrid installer! Due to my uncertainty about whether or not I'll be able to continue this collection in the future \n\ndue to my health I have also included the decrapped sims3packs. Use one or the other, NOT both! Using both will result in duplicate items!!! Using a sims3pack from this torrent and the one from the store will ALSO result in duplicates as the process to break the copyright protection changes the sims3pack just enough for it to appear as a totally different file!\n\nIf you aren't sure how to install a .package file for the Sims 3, please check out the tutorial on Mod the Sims via the link provided.\n      &lt;a href=&quot;\nhttp://www.modthesims.info/wiki.php?title=Sims_3:Installing_Package_Files&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modthesims.info/wiki.php?title=Sims_3:Installing_Package_Files&lt;/a&gt;\n\nPlease don't just leech, seed for a while after you download!\n\nThese package files as well as the original torrent were compiled by rachelstoolbox onYou are welcome to post the files for download off ofbut I request you acknowledge the files were not your own creation. I will only be offering any support via the torrent on KickAss Torrents.\n\nTil next month!\n\nRachel\n\nFrequently Asked Questions\nWARNING: Asking a question already answered below may lead to rudeness and/or public mocking.\n\nQ: I can't open the zip files, is something wrong?\nA: The reason for the compression has always been to conserve the bandwidth of people who happen to live in places where they are charged by total data, not access speed. I changed the compression algorithm in order achieve a higher level of progressions, cutting GBs from the torrent since files for this game are often extremely bloated. If you can't open these files (which use the LZMA compression algorithm), you can download WinRAR and/or 7-Zip free via these links:\nWinRAR via rarlabs.com\n7-Zip via 7-zip.org\n\nQ: Do I need to download EVERY file?\nA: If you choose to you are more than welcome to pick and choose what you want within your torrent app. If you don't know how to do that you need to look up the help info for your torrent app. All files are in the same torrent since I will not support 3 when I started out providing only the package files and added everything else by the requests of others.\n\nQ: What happened to the annual package files?\nA: I combined them to help the game run more efficiently. Instead of the 5 annual packages there are now 3 larger package files instead.\n\nQ: Do I need to install this 'Fixes' package file?\nA: If you want any of the 'Premium Content' to work, yes you do. It used to be combined with the most recent annual file but separating it makes it easier for me to check which version is included. Expect to replace the file you have anytime new 'Premium Content' is in the torrent.\n\nQ: The directions on Mod the Sims are for mod files?\nA: Every mod posted at Mod the Sims is in the form of a .package file, the exact same thing provided in this torrent. Installation is exactly the same.\n\nQ: What if I want to use the .sims3pack files instead?\nA: If you have the game installed double clicking any .sims3pack file will open the launcher, which will install it. Remember, if you use the package files the only files you need to install this way are the Worlds and Buildings.\n\nQ: Why does the game tell me some of the files have mod scripts?\nA: Starting in June 2011 EA/Maxis started putting 'Premium' items on the Sims Store. Unlike any common items on the store, these 'Premium' items add new functionality to the game, which EA/Maxis wrote in the form of a script, which just so happens to be the same thing the vast majority of modders will do. The scripts in packages found in this torrent originate from EA/Maxis only. Any package file that only has common items, not premium, will not generate a message.\n\nQ: What does Decrapified mean?\nA: 'Decrapified' is slang for all copy protection being removed. Every file in this torrent has been decrapified or you wouldn't see the items in game, let alone be able to install any of the protected sims3packs. In addition, it needs to be removed in order to compile a package file.\n\nQ: Do any of these files require any Expansion or Stuff packs?\nA: All Sims 3 Store items only require the Base Game to work. It is recommended that you install the most recent patch as most items only require the game be patched to a specific version. If you need a way to download patches separately from the launcher I recommend the following link: The Sims 3 Patches via Strategy Informer\n\nQ: Will these files work on a Mac?\nA: I'm sure they do, however I offer no support for installing or troubleshooting them on Macs. I do not use a Mac so I can not help you with that myself.\n\nChanges in v1.3.2 package files\n\nAdded a new item to the 21-40 collective file to prevent a conflict\n\nChanges in v1.3.1 package and sims3pack files\n\nThe compilation files have been recompiled and include every single item and lot released. If you use them the only sims3packs you will need to run are for the neighborhoods you plan to play.\nLive, Laugh, Love set file type fixed\n\nChanges in v1.3 package and sims3pack files\n\nFiles have been recompressed to lower torrent's total size. Conversion will be done gradually over several months instead of all at once. The only change to 1.3 files is the compression algorythym of the .zip files\n\nChanges in v1.2.1 package files\n\nvarious items have been moved into other package files to eliminate conflicts\n\nChanges in v1.2 package and sims3pack files\n\nRun through more recent versions of s3rc and decrapify'\nRigfix run on new files\n\nChanges in v1.1 package files\n\nRigfix has been rerun since it wasn't effective when initially run\t\t\t","torrent":{"xt":"urn:btih:a4ca1dd7e6d9e364998bfaea5070db7b8a1f12e0","amp;dn":"Complete+Sims+3+Store+May+2013+%28package+and+decrapified+sims3pac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ca1dd7e6d9e364998bfaea5070db7b8a1f12e0","infoHashBuffer":{"type":"Buffer","data":[164,202,29,215,230,217,227,100,153,139,250,234,80,112,219,123,138,31,18,224]},"announce":[],"urlList":[]}}