{"title":"Coast to Coast AM May 13, 2013 - After Death Evidence","uid":8485781,"size":57102447,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a4d8047ad9641699765f24d09d9229c86b91f50c&amp;dn=Coast+to+Coast+AM+May+13%2C+2013+-+After+Death+Evidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1368856003,"description":"Note: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nHost:\nGeorge Noory\nGuests:\nPaul Davids, Gary Schwartz, Stan Deyo\nFilmmaker and producer Paul Davids discussed his new documentary, The Life After Death Project, which airs on the SyFy channel on May 15th. The film chronicles possible after death communications that came from sci-fi luminary, Forrest J. Ackerman, who passed away in 2008 at the age of 92. Professor at the University of Arizona, Gary E. Schwartz joined the show in the latter half to talk about his involvement in the case and documentary. Ackerman, who was a longtime friend and mentor to Davids, was known to be a skeptic about the afterlife, but told his friends that if he found something upon his passing, he would try to drop them a line. \nIn town for a huge tribute held for Ackerman in Hollywood after his death, two Canadian documentarians, who'd made a film about Ackerman, visited his crypt in Forest Lawn. One of them knocked on the crypt, and said 'hello Forry, are you there?' An hour later, they were posting on their blog, and had to type in a randomly generated code to make sure they weren't a spammer. Bizarrely, the random code came up as Ackerman 000. Then, as they were discussing the event, their other computer, which had been asleep, suddenly issued an audio snippet that seemed to be responding to them, Davids recounted. He also shared his own incident, which he experienced in Santa Fe, involving a document he'd printed out that had an anomalous ink stain on it with four words blacked out. He believes this was possibly a communication to him from Ackerman. \nSchwartz outlined four different types of evidence for after death communications in the Ackerman incidents that are highlighted in Davids' documentary: a host of physical phenomena that can't be explained by conventional means, a series of stunning synchronicities, three independent mediums who provide complementary information, and technology-enabled testing that Schwarz conducted. He noted that while no one area is proof of the afterlife, the combination of all four together presents a strong case. \nEarth &amp; Solar News\nFirst hour guest, physicist and author Stan Deyo shared updates on solar and earth changes, including recent X-flares rated about 3.2. The Carrington Event of 1859 involved an X-flare rated at 28, and caused fires along the telegraph lines. If an event of this magnitude were to happen today, which is not entirely unlikely, fires could start all along the power grids, he warned. Regarding the increase in sinkholes in populated areas, Deyo speculated that underground infrastructure such as pipes may be collapsing due to a cycle of planetary expansion. \nNews segment guests: Bill Spillane, Cheryl Perkins \nWebsite(s):\nlifeafterdeathproject.com\ndrgaryschwartz.com\npauldavids.com\nstandeyo.com\nBook(s):\nThe Afterlife Experiments: Breakthrough Scientific Evidence of Life After Death\nThe G.O.D. Experiments\nThe Sacred Promise\nDare to Prepare\n","torrent":{"xt":"urn:btih:a4d8047ad9641699765f24d09d9229c86b91f50c","amp;dn":"Coast+to+Coast+AM+May+13%2C+2013+-+After+Death+Evidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4d8047ad9641699765f24d09d9229c86b91f50c","infoHashBuffer":{"type":"Buffer","data":[164,216,4,122,217,100,22,153,118,95,36,208,157,146,41,200,107,145,245,12]},"announce":[],"urlList":[]}}