{"title":"Lucrative Love: The Insider's Secrets to Marrying Millions","uid":8450292,"size":3748638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5b72afac2c9765f866e6dffd1d92511bd5cef34&amp;dn=Lucrative+Love%3A+The+Insider%27s+Secrets+to+Marrying+Millions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1367982216,"description":" Tom Feltenstein, &quot;Lucrative Love: The Insider's Secrets to Marrying Millions!&quot;\n2013 | ISBN-10: 1934606472 | 196 pages | EPUB, MOBI, PDF | 3,6 MB\n\nLOVE MAY FEEL GREAT FOR THE MOMENT,BUT IT SHRIVELS LIKE A WIENER IN THE ARCTIC WHEN FACED WITH A MOUNTAIN OF DEBT! Tom Feltenstein learned many years, and two marriages, ago that love doesn't make the world go around. Money does. Now he offers his sage wisdom to those seeking the perfect life - and the perfect bank account. Do spend your weekends sitting by the phone waiting for a call from Mr. or Ms. Perfect? Gaze out the window at the stars thinking of the &quot;one&quot;? Will your life be complete only when you find everlasting love? If you truly believe this way, you're sadly mistaken and destined to schlep through life the hard way. Marrying for love is about as smart as taking a shower while blow drying your hair. It may give you a little jolt, but in the end you get fried! In Lucrative Love, Tom gives you the facts and guidance you need to marry the Joe or Jane Millionaire of your dreams. Using his many years of business knowledge he approaches your martial and financial future as a business. As you read through the pages in this book, you'll laugh, you'll cry, and then you'll say to yourself, &quot;Love - what was I thinking?&quot; Marrying for love puts you in the poor house, while marrying for money gets you a mansion in the hills and a vacation home in Maui. Stop kidding yourself, and face reality. Someone's going to marry them; why can't it be you? ","torrent":{"xt":"urn:btih:a5b72afac2c9765f866e6dffd1d92511bd5cef34","amp;dn":"Lucrative+Love%3A+The+Insider%27s+Secrets+to+Marrying+Millions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5b72afac2c9765f866e6dffd1d92511bd5cef34","infoHashBuffer":{"type":"Buffer","data":[165,183,42,250,194,201,118,95,134,110,109,255,209,217,37,17,189,92,239,52]},"announce":[],"urlList":[]}}