{"title":"PBS America Revealed 4of4 Made in the USA x264 AAC MVGroup.org","uid":8461015,"size":766729290,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a61e31444300bcfdb68e1b030a32b94b92a14b8b&amp;dn=PBS+America+Revealed+4of4+Made+in+the+USA+x264+AAC+MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":-1,"time":1368230914,"description":"America Revealed\n\nTravel Documentary hosted by Yul Kwon, published by PBS in 2012 - English narration\n\n\nInformation\n------------------------------\n\nAmerica Revealed is a unique look at what makes America tick, what it takes to keeps the biggest food machine in the world going, the delicate balance that keeps our supermarkets stocked with groceries and fast food restaurants supplied with fries. How we keep America moving with its vast and complex transport systems. How we propel ourselves through energy, what maintains the constant supply of fuel and electricity to our homes and businesses and finally how we keep up with the ever changing world, the import and export infrastructure that shapes our manufacturing industry.\n\nFrom the Corn farmer in Central Valley, California to the live wire cable repairers in New Jersey. Viewers will discover a fascinating new perspective on the hidden patterns and rhythms of American life, by looking through the eyes of individuals who all play a part in keeping America fed, moving, powered and making goods.\n\n\n4)  Made in the USA \nAmerican manufacturing has undergone a massive revolution over the past 20 years. Despite all the gloom and doom, America is actually the number one manufacturing nation on earth. Yul Kwon crosses the nation looking at traditional and not-so traditional types of manufacturing. Along the way, he meets the men and women who create the world's best and most iconic products, engineers who are reinventing the American auto industry, steelworkers who brave intense heat to accommodate radical new ideas about recycling, and engineers who are re-imagining the microchip. He visits one of the most innovative manufacturers on earth: a small start-up company that is building personalized robots - machines that may one day reshape our homes and offices, driving our revolution further forward. Yul further explores the emerging notion that manufacturing itself is changing from a system based on the movement and assembly of raw materials like steel and plastic to a system in which ideas and information are the raw materials of a new economy based around communications and social connections via companies likeand Google.\n","torrent":{"xt":"urn:btih:a61e31444300bcfdb68e1b030a32b94b92a14b8b","amp;dn":"PBS+America+Revealed+4of4+Made+in+the+USA+x264+AAC+MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61e31444300bcfdb68e1b030a32b94b92a14b8b","infoHashBuffer":{"type":"Buffer","data":[166,30,49,68,67,0,188,253,182,142,27,3,10,50,185,75,146,161,75,139]},"announce":[],"urlList":[]}}