{"title":"Take Command v15.00.52 Multilingual  (32bit) with Key [TorDigger","uid":8338943,"size":15370792,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a64abff241425980b07d2ed246d9a7ce602edc55&amp;dn=Take+Command+v15.00.52+Multilingual++%2832bit%29+with+Key+%5BTorDigger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":9,"time":1365039677,"description":"Take Command\n\nTake Command is a comprehensive interactive GUI and Windows command line toolkit that makes your Windows command prompts easier to use and far more powerful. Take Command includes optional Explorer-style integration, tabbed console windows, major enhancements to standard Windows CMD commands such as COPY, DEL, and MOVE, and adds 140+ new commands, improved command line editing, over 480 internal variables and functions, and thousands of other features.\nIn addition, Take Command is a powerful batch file programming tool, offering extensions such as DO loops, error and exception handling, block-structured logic, an integrated IDE with a sophisticated editor and batch debugger, third-party plugins, and 460 built-in variables and functions.\n\nAre you frustrated with the limitations of the CMD command line and batch scripting? Do you yearn for a real scripting language, and an integrated IDE and batch debugger? How about a Windows command processor that can do all of that, and still run your existing CMD prompt commands and batch files?\n\nTake Command is our flagship product. For over 20 years, JP Software has been helping programmers, system administrators, technical support professionals, and advanced users save time and money, and cure their Windows command prompt frustrations. Take Command offers a new approach to working in Windows, bringing users the power of the command line and the ease of use of the Windows GUI. Take Command includes a complete CMD replacement command shell that provides you with a vastly better Windows command line UI, and thousands of features that are not available in CMD command prompt commands (or even in those vaunted Linux shells).\n\nSupported OS:\n\nTake Command is compatible with any 32 or 64-bit version of Microsoft Windows XP (SP2 or later), 2003, Vista, 2008, Windows 7, and Windows 8. Take Command is available in 32-bit and 64-bit versions.\n\nHomepage: http://jpsoft.com/take-command-windows-scripting.html\n\nInstallation Instructions:\n\n- Install Program.\n- Run &quot;Regme&quot; and merge it to system registry\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:a64abff241425980b07d2ed246d9a7ce602edc55","amp;dn":"Take+Command+v15.00.52+Multilingual++%2832bit%29+with+Key+%5BTorDigger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a64abff241425980b07d2ed246d9a7ce602edc55","infoHashBuffer":{"type":"Buffer","data":[166,74,191,242,65,66,89,128,176,125,46,210,70,217,167,206,96,46,220,85]},"announce":[],"urlList":[]}}