{"title":"BoxCryptor v1.5.413.155 Incl Crack [TorDigger]","uid":8447245,"size":16575429,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a8216e8079ef10c2ef8cbd3894beab01e025e076&amp;dn=BoxCryptor+v1.5.413.155+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":12,"time":1367923382,"description":"BoxCryptor\n\nSECURE YOUR CLOUD\n\nBoxCryptor secures your data in the cloud - if you use Dropbox, SugarSync, Microsoft SkyDrive, Google Drive or any other cloud storage provider.\n\nSIMPLE ACCESS\n\nAccess your encrypted files on all devices. BoxCryptor is available for Windows, Mac, Android, iPhone and iPad. Also compatible with EncFS-Linux.\n\nOPTIMIZED FOR CLOUD STORAGE\n\nYou want to encrypt your files on Dropbox, SugarSync, Google Drive, Microsoft SkyDrive or any other cloud storage provider and access your data from anywhere without worrying about data security or giving up comfort? Then BoxCryptor is the perfect software solution for you. It has never been easier and more user-friendly to encrypt your data without losing the advantages of cloud storage.\n\nKEEP YOUR FILES ALWAYS WITH YOU\n\nWith BoxCryptor you can easily access your encrypted files - on your computer, smartphone or tablet. Want to add new files to your Dropbox while on the go? With BoxCryptor for iOS and Android you can upload files anytime without having to worry about security. Encryption has never been easier!\n\nSECURITY USING HIGHEST STANDARDS\n\nYou want to store highly sensitive files in the cloud? Your contracts, your bank details or your dissertation? BoxCryptor uses the AES-256 standard to encrypt and protect your files. AES-256 is classified by the U.S. Government to protect &quot;TOP SECRET&quot; information. In the Unlimited versions you can add an additional security layer by filename encryption.\n\nSupported OS:\n\nWindows All\n\nHomepage: https://www.boxcryptor.com/\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Register Application with given serial. or any serial using given format of key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:a8216e8079ef10c2ef8cbd3894beab01e025e076","amp;dn":"BoxCryptor+v1.5.413.155+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8216e8079ef10c2ef8cbd3894beab01e025e076","infoHashBuffer":{"type":"Buffer","data":[168,33,110,128,121,239,16,194,239,140,189,56,148,190,171,1,224,37,224,118]},"announce":[],"urlList":[]}}