{"title":"James Lee Burke - Pegasus Descending","uid":8480175,"size":518272976,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a8fc5f14a6c5a0c806450965532dd87c155295ea&amp;dn=James+Lee+Burke+-+Pegasus+Descending&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thadmacracken","files":-1,"time":1368715336,"description":"When a nice young woman named Trish Klein blows into Louisiana passing hundred-dollar bills in local casinos, detective Dave Robicheaux senses a storm bearing down on his new life of contentment....Twenty-five years ago, lost in a drunken haze in Florida, Robicheaux was too far gone to save his friend and fellow 'Nam vet Dallas Klein, murdered in cold blood for gambling debts. Now, the arrival of Dallas's daughter opens a door locked long ago, and extracting her motives points Robicheaux to the suicide of a local &quot;good girl&quot; pulled into a vortex of power, sex, and death. It's Robicheaux's most personally painful case -- a roller coaster of passion, surprise, and regret -- and it may be his deadliest.\n\nDrawing on classical antecedents, bestseller Burke peoples his 15th Dave Robicheaux novel (after 2004's Crusader's Cross) with his usual assortment of near mythic characters, demonstrating how our everyday lives are beset with age-old, universal dilemmas. New Iberia, La., detective Dave Robicheaux, for whom redemption has become a lifelong pursuit, suits up once again to tilt against villains both real and in his own troubled psyche. Twenty-five years earlier, the young alcohol-soaked cop witnessed his friend and fellow Vietnam vet, Dallas Klein, executed by a group of cold-blooded thugs. He was unable to intercede because he was plastered. Now, a young grifter who may be the victim's daughter, Trish Klein, has appeared in New Iberia, passing counterfeit money and baiting Whitey Bruxal, the aging mobster responsible for Dallas's death. Meanwhile, Dave investigates the apparent suicide of pretty young co-ed Yvonne Darbonne. Are the two cases linked? Dave thinks so, and he enlists longtime loose-cannon sidekick Clete Purcel to prove it. With peerless naturalistic descriptions and lush, metaphysical imagery, Burke creates another challenging morality play for his flawed, everyman hero","torrent":{"xt":"urn:btih:a8fc5f14a6c5a0c806450965532dd87c155295ea","amp;dn":"James+Lee+Burke+-+Pegasus+Descending","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fc5f14a6c5a0c806450965532dd87c155295ea","infoHashBuffer":{"type":"Buffer","data":[168,252,95,20,166,197,160,200,6,69,9,101,83,45,216,124,21,82,149,234]},"announce":[],"urlList":[]}}