{"title":"Falling Upwards - How We Took to the Air (gnv64)","uid":8436304,"size":36907225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa11a6be3fc77217eab0132163e2415d2b741c37&amp;dn=Falling+Upwards+-+How+We+Took+to+the+Air+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":-1,"time":1367646075,"description":"Falling Upwards: How We Took to the Air \nby Richard Holmes\nPantheon | October 2013 | ISBN-10: 0307379663 | 416 pages | ePUB/PDF | 12.6/21.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/Falling-Upwards-How-Took-Air/dp/0307379663&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Falling-Upwards-How-Took-Air/dp/0307379663&lt;/a&gt;\nPDF conversion is mine.\n\nFalling Upwards tells the story of the enigmatic group of men and women who first risked their lives to take to the air, and so discovered a new dimension of human experience. Why they did it, what their contemporaries thought of them, and how their flights revealed the secrets of our planet in wholly unexpected ways is its subject.\nDramatic sequences move from the early Anglo-French balloon rivalries; the crazy firework flights of beautiful Sophie Blanchard; the revelatory ascents over the great Victorian cities and sprawling industrial towns of Northern Europe; the astonishing long-distance voyages of the American entrepreneur John Wise, and the French photographer Felix Nadar, to the terrifying high-altitude flights of James Glaisher FRS who rose above seven miles without oxygen, helping to establish the new science of meteorology as well as the environmental notion--so important to us today--of a &quot;fragile&quot; planet. Balloons were also used to observe the horrors of modern battle during the American Civil War (including a memorable flight by General Custer). \nReaders will also discover the many writers and dreamers--from Mary Shelley to Edgar Allan Poe, from Charles Dickens to Jules Verne--who felt the imaginative impact of flight and allowed it to soar in their work. Most of all, through the strange allure of the great balloonists, Holmes offers another of his subtle portraits of human endeavor, recklessness, and vision. (With 24 pages of color illustrations, and black-and-white illustrations throughout.)\n\nAbout the Author &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Richard_Holmes.JPG/220px-Richard_Holmes.JPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Richard_Holmes.JPG/220px-Richard_Holmes.JPG&lt;/a&gt;\nRichard Holmes, OBE, FRSL, FBA (born 5 November 1945) is Professor of Biographical Studies at the University of East Anglia. His is a Fellow of the British Academy, has honorary doctorates from UEA and the Tavistock Institute, and was awarded an OBE in 1992. His first book, 'Shelley: The Pursuit', won the Somerset Maugham Prize in 1974. 'Coleridge: Early Visions' won the 1989 Whitbread Book of the Year, and 'Dr Johnson &amp; Mr Savage' won the James Tait Black Prize. 'Coleridge: Darker Reflections' won the Duff Cooper Prize and the Heinemann Award. He has published two studies of European biography, 'Footsteps: Adventures of a Romantic Biographer' in 1985, and 'Sidetracks: Explorations of a Romantic Biographer' in 2000. He is a Fellow of the British Academy, and was awarded an OBE in 1992. He is the author of the best-selling The Age of Wonder, which won the 2009 Royal Society Prize for Science Writing as well as the 2009 NBCC award for nonfiction, and was one of The New York Times Book Review's Best Books of the Year. Earlier books include Footsteps: Adventures of a Romantic Biographer, Dr. Johnson &amp; Mr. Savage, Coleridge: Early Visions, and Coleridge: Darker Reflections (an NBCC finalist). He lives in England. ","torrent":{"xt":"urn:btih:aa11a6be3fc77217eab0132163e2415d2b741c37","amp;dn":"Falling+Upwards+-+How+We+Took+to+the+Air+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa11a6be3fc77217eab0132163e2415d2b741c37","infoHashBuffer":{"type":"Buffer","data":[170,17,166,190,63,199,114,23,234,176,19,33,99,226,65,93,43,116,28,55]},"announce":[],"urlList":[]}}