{"title":"Kaspersky Anti Virus 2013 v13 0 1 4190 - Team Rjaa","uid":8416000,"size":185108280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aac46e7ce00eb8ea27cfb44346538c0d5817ee74&amp;dn=Kaspersky+Anti+Virus+2013+v13+0+1+4190+-+Team+Rjaa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rjaa","files":1,"time":1367040228,"description":"Kaspersky Anti Virus 2013 v13 0 1 4190 - Team Rjaa\n\n\nDescription:\n\nTechnical Data\nKaspersky Anti-Virus 2013 v13.0.1.4190 ROG SPANISH FINAL\nEnglish | 174 MB | Autoactivado (1 Year, up to 31/12/2015) | Win XP/Vista/7/8\nDescription\nBasic protection: Kaspersky Anti-Virus provides basic protection against the latest viruses, malware, and more. Works in the background with intelligent analysis and small, frequent updates, and at the same time, it proactively protects against threats from known and emerging Internet.\n\nFeatures\nBasic protection\n\nInnovative Hybrid Protection\nBasic protection with the latest technology from Kaspersky Lab\nFast response in real time to new threats\n\nAdvanced protection\n\nEarly detection of unknown malicious software\nReview of malicious software changes\nVulnerability detection\nSafety checks with one click\nSecurity Checks websites instantly\nRootkit detection\n\nIdentity Protection\n\nPhishing Defense\nVirtual Keyboard\n\nPerformance\n\nIntelligent analysis\nSmart Updates\nGamer Mode\n\nAdditional Features\n\nUnprecedented use a new interface\nEasy access to safe state\nInstallation on infected computers\nOptimized for netbooks\nFree technical support\n\nNew Kaspersky Anti-Virus 2013\nKaspersky Anti-Virus 2013 provides the following new features:\n\nAdded protection data entry from the keyboard to protect the data entered into various websites.\nIn order to provide protection against intruders who exploit software vulnerabilities has been added protective feature exploits the System Watcher component.\nAdded the option to install the latest version of Kaspersky Anti-Virus 2013 together with the latest updates to the database application. The application can be installed automatically using a utility available for download on the Internet.\nAdded the option to automatically disinfect active infections that prevent the installation of Kaspersky Anti-Virus 2013.\n\nImprovements:\n\nThey have reduced the impact of the application on the operating system performance and the amount of computer resources needed for use. In particular, it has reduced the impact of the application on the time it takes to boot the operating system and applications.\nIt has improved protection against malicious software hidden installation in the system and theft of personal data.\nIs enhanced virtual keyboard functionality: You can now open it by clicking the quick launch icon that is displayed in the data entry fields of Web sites.\nImproved the heuristic analysis is carried out to check websites for fraudulent activities.\nReduced the size of the database application, which reduces the size of data download and accelerate the installation of updates.\nIt has optimized the design of the main application window to ensure quick and easy access to the main features and components.\nIt has optimized the management option of the main features of the application from the keyboard.\nTechnology has been improved based on the analysis of the behavior of applications on other computers running Kaspersky Lab products designed to implement the threat classification applications to protect your computer and personal data.\nIt has expanded the list of supported web browsers versions of the application.\n\nMAIN KNOWN ISSUES\n\nFile Anti-Virus could process certain file formats incorrectly. The information processing errors shown in the analysis report file Antivirus.\nIn some cases, files that have been moved to Quarantine from a local network can not be restored.\nParental Control could process improperly used resources SPDY protocol.\nThe application does not scan traffic or services that use TLS v1.2.\nIf the complements of Kaspersky Anti-Virus 2013 not activated the first time you start Internet Explorer after installing the application may only be activated via your browser settings.\nThe first time you start Internet Explorer after installing the application, the Web browser for which you have enabled the components of Kaspersky Anti-Virus 2013 you may be asked to turn them off.\nSupplements Kaspersky Anti-Virus 2013 for Mozilla Firefox are disabled by default. Such supplements are activated through the Web browser settings.\nTo ensure proper operation of the Opera browser, you may be prompted to install a special certificate for encrypted connections.\nWhen you update Kaspersky Anti-Virus 2013 to Kaspersky Internet Security 2013, you must update the database application.\n\nSystem Requirements\nRequired for all installations:\n\nApproximately 480 MB of available hard disk space (depending on the size of the antivirus database)\nMicrosoft Internet Explorer 6 or higher\nMicrosoft Windows Installer 2.0\nInternet connection for product activation\nCD / DVD drive for installation of the program from the CD\n\n* Operating Systems:\n\nMicrosoft Windows XP Home Edition\n(Service Pack 2 or higher)\nMicrosoft Windows XP Professional\n(Service Pack 2 or higher)\nMicrosoft Windows XP Professional x64 Edition\n(Service Pack 2 or higher)\nMicrosoft Windows Vista Home Basic (32/64 bits)\nMicrosoft Windows Vista Home Premium (32/64 bits)\nMicrosoft Windows Vista Business (32/64 bits)\nMicrosoft Windows Vista Enterprise (32/64 bits)\nMicrosoft Windows Vista Ultimate (32/64 bits)\nWindows 7 Starter (32/64 bits)\nMicrosoft Windows 7 Home Basic (32/64 bits)\nMicrosoft Windows 7 Home Premium (32/64 bits)\nMicrosoft Windows 7 Professional (32/64 bits)\nMicrosoft Windows 7 Ultimate (32/64 bits)\nMicrosoft Windows 8\n\nHardware Requirements:\n\nProcessor 800 MHz or higher\n512 MB of available RAM\nProcessor 1 GHz 32-bit (x86) / 64 bit (x64) or higher\n1 GB of RAM (32-bit) or 2 GB RAM (64-bit)\n\n* Safe Run Mode does not work on Microsoft Windows XP x64 and functions with restrictions on Microsoft Windows Vista x64 and Microsoft Windows 7 x64.\n\nHardware requirements for netbooks (Netbooks)\n\nCPU: Intel Atom 1.33Mhz (Z520)\nRAM: (1 GB) 1024MB (DDR2-533Mhz)\nHard Drive: 160GB (5400rpm)\nVideo Card: Intel GMA950 + 64 MB\nDisplay: 10.1''\nOS: MS WinXP Home Edition","torrent":{"xt":"urn:btih:aac46e7ce00eb8ea27cfb44346538c0d5817ee74","amp;dn":"Kaspersky+Anti+Virus+2013+v13+0+1+4190+-+Team+Rjaa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac46e7ce00eb8ea27cfb44346538c0d5817ee74","infoHashBuffer":{"type":"Buffer","data":[170,196,110,124,224,14,184,234,39,207,180,67,70,83,140,13,88,23,238,116]},"announce":[],"urlList":[]}}