{"title":"The Weepies - Hideaway [2008][EAC,log,cue. FLAC]","uid":8454799,"size":275989847,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac83dbc962018cd6fab48db2c5429edf854df494&amp;dn=The+Weepies+-+Hideaway+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":17,"time":1368085639,"description":"Artist: The Weepies\nRelease: Hideaway\nReleased: 2008\nLabel: Nettwerk\nCatalog#: 0 6700 30777 2 9\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: alternative, folk, rock, pop\n\n\n\n\n1.Can't Go Back Now\n2.Orbiting\n3.Hideaway\n4.Wish I Could Forget\n5.All Good Things\n6.Little Bird\n7.Antarctica\n8.How You Survived The War\n9.Not Dead Yet\n10.Old Coyote\n11.Just Blue\n12.Lighting Candles\n13.Takes So Long\n14.All This Beauty\n\n&quot;Weepies&quot; used to be a derogatory term, a synonym for chick flicks, movies that -- at least in the masculine mind -- traded on cheap sentiment to get a tearful reaction. It's a term the songwriting duo known as the Weepies -- Deb Talan and Steve Tannen -- want to reinvent. They wear their hearts on their sleeves and they're not ashamed of it. Their music is poignant without being sappy, built on the foundation of their fluid acoustic guitar work and Talan's understated vocals. There are bass, drums, and keyboards accents, but they play backup to Talan's poignant lead vocals and Tannen's euphoric harmonies. On this, the Weepies' third album, the duo is bluer and deeper than before. The songs deal with lost or unattainable love, loss of innocence, and general romantic disillusionment. &quot;Antarctica&quot; is typical, a gentle song about numbing out your feeling with booze, escaping into a Never Never Land where all is white, cold, and blank. Talan's warm vocal and the track's uptempo rhythm play off neatly against the song's bleak outlook. &quot;How You Survived the War&quot; is another tale of emotional collapse, likening lost love to a lost battle. This time the ripping rainy-day guitars complement the sadness of the lyric and Talan sounds positively, er, weepie. Most of the tunes are variations on the same theme, but the melodies are so sparkling and the singing so heartfelt that it's hard to get bummed out. Even the saddest tunes offer hope with their luminous vocals and affecting melodies. But all is not totally lost. Tannen sings lead on &quot;Can't Go Back Now,&quot; a song that laments the loss of childhood innocence while celebrating the freedom of being an adult making your way through the world with the support of a lover who always walks beside you. &quot;All This Beauty&quot; closes the album; it's a big, bright love song that commemorates life's small, perfect moments. Sunshine, a floating feather, chocolate cake, and a good Weepie song all create moments so luminous you have to shut your eyes to keep from being blinded by the light.","torrent":{"xt":"urn:btih:ac83dbc962018cd6fab48db2c5429edf854df494","amp;dn":"The+Weepies+-+Hideaway+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac83dbc962018cd6fab48db2c5429edf854df494","infoHashBuffer":{"type":"Buffer","data":[172,131,219,201,98,1,140,214,250,180,141,178,197,66,158,223,133,77,244,148]},"announce":[],"urlList":[]}}