{"title":"20130509-Stossel-[Whatever Happened to GRIT].Fox Bus.CF.avi","uid":8465764,"size":287484272,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:acf3597ecc0f69020bf4d8166bb391fab55524ee&amp;dn=20130509-Stossel-%5BWhatever+Happened+to+GRIT%5D.Fox+Bus.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1368349858,"description":"----------\n\nSTOSSEL - [Whatever Happened to GRIT] - Fox Business Network\n2013, May 9, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nGrit is the stuff of life. Greatness is often achieved by overcoming obstacles.\n\nPatrick Dorinson, a radio host who calls himself the cowboy libertarian, says the nanny state robs us of our grit.\n\nDeneen Borelli , author of &quot;Blacklash&quot;, says the left is driving Americans to a &quot;government plantation.&quot;\n\nLenore Skanayzy, labeled the &quot;World's Worst Mom&quot; because she let her 9-year-old son ride the subway on his own, says we can't protect our kids from all danger... and we shouldn't try.\n\nJohn Carney's business, Express Oil Change, was destroyed by a tornado. But Carney has grit. When city bureaucrats told him he wouldn't be allowed to rebuild on his property, he fought them, and rebuilt.\n\nPolitically correct college administrators manage to get upset about student videos like this. Purdue University's &quot;feelings police&quot; said the video is racist. At least one professor and grad student claimed the video &quot;replaces a multicultural reality with the idea of white supremacy.&quot; Greg Lukianoff from The Foundation for Individual Rights in Education says schools ought to honor free speech. Being offended is a normal part of life... and people need to get used to it.\n\nWhen this video of Rutgers University basketball coach pushing and cursing his players went viral, there was public outcry. Governor Chris Christie called Rice an &quot;animal&quot;. Rice was fired. But Sue Porter, author of &quot;Bully Nation&quot; says society is too quick to get upset about what people call &quot;bullying&quot; and legislators and parents getting involved often does more harm than good.\n\nWe close with thoughts from In Character, a journal published by the Templeton Foundation. It's &quot;Grit Issue&quot; was the inspiration for this show.\n\nGrit is what it took to create civilization - it requires delaying gratification, wanting something bigger than yourself...and in the case of America's pioneers... often starving, losing children, losing wives and husbands...to build communities...\n\nAs John Wayne's character put it in the Big Trail: &quot; We're building a nation! We've got to suffer! No great trail was ever blazed without hardship...That's life!\n\nVan Gogh sold only sold one painting during his lifetime, but he painted 900.\n\nCartoonist Charles Schulz had every cartoon he submitted to his high school yearbook rejected.\n\nThomas Edison's teachers ...told his mom he was &quot;too stupid to learn.&quot; His attempts to build a light bulb failed a thousand times. When he finally succeeded, a reporter asked him, &quot;How did it feel to fail 1,000 times?&quot; Edison replied, &quot;I didn't fail 1,000 times. The light bulb was an invention ...with 1,000 steps.&quot;&quot;\n\nThat's grit.","torrent":{"xt":"urn:btih:acf3597ecc0f69020bf4d8166bb391fab55524ee","amp;dn":"20130509-Stossel-%5BWhatever+Happened+to+GRIT%5D.Fox+Bus.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acf3597ecc0f69020bf4d8166bb391fab55524ee","infoHashBuffer":{"type":"Buffer","data":[172,243,89,126,204,15,105,2,11,244,216,22,107,179,145,250,181,85,36,238]},"announce":[],"urlList":[]}}