{"title":"The Life Aquatic With Steve Zissou (Criterion) Disc Two DVD-R R1","uid":8442184,"size":4681523200,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ad92a12caff59b264ba7dd3d2ada3d485ab93aaf&amp;dn=The+Life+Aquatic+With+Steve+Zissou+%28Criterion%29+Disc+Two+DVD-R+R1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SteelerJ17","files":-1,"time":1367798356,"description":"The Life Aquatic with Steve Zissou Disc Two (Criterion) DVD-R R1 NTSC SteelerJ17\n\nThis is a iso file. You can easily burn it through using Nero or IMGBurn\n\nMenus-Yes\nExtras-Yes\n\nSpecial Features including\nThis Is An Adventure, a documentary by Antonio Ferrera, Albert Maysles, and Matthew Prinzing chronicling the production of the movie.\nMondo Monda, an Italian talk show featuring an interview with Wes Anderson and Noah Baumbach, with host Antonio Monda\nNew video interview with composer and Devo member Mark Mothersbaugh\nTen complete video performances of David Bowie songs in Portuguese by Brazilian recording artist Seu Jorge\nIntern video journal by actor and real-life intern Matthew Gray Gubler (Intern #1)\nMultiple interviews with the cast and crew with behind-the-scenes footage\nBehind-the-scenes photos and original artwork from the film\n\nLet's get this SEEDED people!! Remember it's nice to share. Don't Be A Hit and Run!! (Note: I will seed for 1 week only!!!!)\n\nBookmark me on your favorites! You'll never know what I will upload!\n\nPlease NO REQUESTS!!!! It's gets too overwhelming for me. I'm only going to upload movies that I think people will like. \n\nPlease enjoy and SEED your TORRENTS!! Seed IT!!\t","torrent":{"xt":"urn:btih:ad92a12caff59b264ba7dd3d2ada3d485ab93aaf","amp;dn":"The+Life+Aquatic+With+Steve+Zissou+%28Criterion%29+Disc+Two+DVD-R+R1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad92a12caff59b264ba7dd3d2ada3d485ab93aaf","infoHashBuffer":{"type":"Buffer","data":[173,146,161,44,175,245,155,38,75,167,221,61,42,218,61,72,90,185,58,175]},"announce":[],"urlList":[]}}