{"title":"Limbeck - Limbeck [2007][EAC,log,cue. FLAC]","uid":8444846,"size":264763086,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad998a295cedff75a3a4220ecadd798a293a09a5&amp;dn=Limbeck+-+Limbeck+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":14,"time":1367863985,"description":"Artist: Limbeck\nRelease: Limbeck\nReleased:  2007\nLabel:  Doghouse Records\nCatalog#: DOG 125\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Alternative Rock, Pop Rock\n\n[01] Trouble |03:56|\n[02] Big Drag |03:19|\n[03] Let Me Come Home |04:25|\n[04] Bird Problems |04:07|\n[05] Keeping Busy |02:18|\n[06] Reading the Street Signs |02:56|\n[07] Wake Up |03:06|\n[08] Let's Get Crazy |02:51|\n[09] Your Story |03:26|\n[10] Friends |03:05|\n[11] Sunset Limited |05:29|\n\nLimbeck are known for their light, alt-country rock, and with their self-titled third studio album, they once again deliver us exactly that. Full of toe-tapping drumbeats and twangy guitars, Limbeck is the kind of album you play while sitting in your front porch swing on a summer day. The question is, are we getting anything new from the band with this release?\n\nIt seems so, with the rushing, swirling sounds at the beginning of &quot;Trouble,&quot; which also incorporates a piano towards the end of the song. This trend of a wider range of instruments continues throughout the album, ultimately including elements like chimes, vocoders, and strings. This does a fair amount to expand the sound of the band. However, after that little bit of innovation, the band returns to the same old, same old.\n\nRobb MacLean's voice is exactly the same, which is both a pro and a con. Pro, in the sense that his voice is perfectly suited to this style of music, and con in the sense that he doesn't have a lot of power and occasionally the music drowns him out where it shouldn't.\n\nThe majority of songs on this CD are of the lingering, meandering variety, with occasional guitar solos thrown in here and there. The subject matter tends to follow along with this style of song - most of them are about traveling: to places, from places, wanting to go places, wanting to stay in places. Clearly life on the road is what inspires MacLean.\n\nAs far as alt-country goes, it's fairly middle of the road. It's good music, but not top tier in the genre. I know it's a fairly limiting style of music, but I'd really like to see Limbeck try and push the expansion they have started with this album. More unusual instruments and different lyrical subjects, rather than the same thing over and over again. Because, as I said earlier, it's a good album but not really much in the way of new sounds. I feel like I've heard these songs before from this band. If I wanted to hear the same things over again, I'd stick in Let Me Come Home or Hi, Everything's Great.\n","torrent":{"xt":"urn:btih:ad998a295cedff75a3a4220ecadd798a293a09a5","amp;dn":"Limbeck+-+Limbeck+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad998a295cedff75a3a4220ecadd798a293a09a5","infoHashBuffer":{"type":"Buffer","data":[173,153,138,41,92,237,255,117,163,164,34,14,202,221,121,138,41,58,9,165]},"announce":[],"urlList":[]}}