{"title":"Kagome XP sp3 by AMC.","uid":8474508,"size":4588277760,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ae619384b81cfc664943b9f0d75cc52c6e9b254d&amp;dn=Kagome+XP+sp3+by+AMC.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edvaness","files":1,"time":1368579635,"description":"Kagome XP sp3 by AMC.\n\nFull 4.4gb DVD 'KagomeXP.iso'  filled with Graphics and Office Applications and the latest SP3 5512 integrated\n\nIn honour of Kagome, my good friend and Mod of\nProjectalchemist.net/index.php,\nvery nice new page with excellent members, where can find me also, and where my releases are also posted.\n\nIt is Spring, nice mood, inspired by pictures of Kagome and her Photoshop skill, decided to go with 'Happy' Windows!\nBeside the Spring, flowers and the sun, Windows Kagome is filled with applications mostly for Graphics and Office Processing and additional ones for everyday use!\nBased on SP3 5512 RTM it has the latest engines, plus additional integrated that are not offered from Microsoft by default. Nothing is removed from original Windows. During install can put Name, Workgroup etc. Even WinTour is there.\nSystem and Graphic Tweaks are implemented with setup, but for your own needs could also use additional tweaking options from the Desktop Folder &quot;eXperience&quot; (before using it read info) - credits to eXperience!\n\nVery Extensive Driver Support - 22 Packs\n446mb zippped, over 2gb unzipped (they don't remain on HDisk)\nDP Chipset 8.03!\nDP CPU 8.04!\nDP Graphics A 8.04!\nDP Graphics B 8.04!\nDP Graphics C 8.04!\nDP LAN 8.04!\nDP MassStorage 8.04!\nDP Sound A 8.04!\nDP Sound B 8.04!\nDP WLAN 8.03!\nDP_USB_wnt5_x86-32_80224\nDP_Broadband_wnt5_x86-32_70416\nDP_Modem_wnt5_x86-32_80327.7z\nDP_Monitor_wnt5_x86-32_07111\nDP_Phone_wnt5_x86-32_80207\nDP_PrintersCanonLaserjet_wnt5_x86-32_61020\nDP_PrintersHP_wnt5_x86-32_71126\nDP_Scanner_wnt5_x86-32_60831\nDP_SmartCardReader_wnt5_x86-32_80228\nDP_TV_wnt5_x86-32_80201\nDP_WebCam_wnt5_x86-32_80210\nDP_Misc_wnt5_x86-32_71216\nSATA/RAID Integrated Support\n\nDefault Screen:\nThe look of the taskbar would be nicer and transparent if you install very little TransBar program from the Desktop.\nSystem Icons as shown on screen are easily changed with default installed Stardock IconPackager (from Start-Programs), 'install New Package' - 'Install from Disk' - 'Leopard'. There are also Vista Icons\nRocketDock on Top of the Screen is default with Setup, and is very modern cartoon style StickerDock skin with Sticker Icons from MAC OS. For RocketDock to work as it is arranged with shortcuts, it is better to install Windows on C:/. If install to other partition, you should rearrange icons and shortcuts on RocketDock, but it is easy job. There is also folder with add.icons on desktop\nDefault Sounds can be changed through Control Panel.\n\nAdditional Optional Applications:\nThey are accessed through DVD Icon in My Computer!\nFirst Menu is for\nOffice 2007 Blue Edition\nOffice 2007 Service Pack 1\nOffice 2007 Compatibility Patch\n500 Office Templates\n.Net Frameworks 3.0 and 3.5\nAdditional Codecs useful for Video and Graphics Processing\n\nWPI Menu is for all other Apps for optional install:\nAll Adobe CS3 Programs\nCamtasia Studio\nACDSee Pro 2\nCorel Paint Shop Pro X2\nTuneUp Utilities 2008\nAshampoo Burning Studio 7\nPerfect Disk 2008\nand many others..\nWhen installing from WPI, it is recommended to install System files such as Flash and Shockwave players, and Quick Time. WPI will automatically restart after it finish installing chosen Apps.\nJust for reminder, some of the installed apps will ask for update from internet, don't allow that (simply press no and don't remind me) or they will become trial!\n\nIMPORTANT: Don't TOUCH WITH MOUSE WHILE APPS SETUP FROM WPI IS GOING ON. EVERYTHING IS AUTOMATICALLY INSTALLED\nDon't install everything, just what you need.\n\nBurn the ISO at lowest speed on DVD4.7gb with some decent Burner like NERO,  Ashampoo or similar.\n\nHope you like it!  \n","torrent":{"xt":"urn:btih:ae619384b81cfc664943b9f0d75cc52c6e9b254d","amp;dn":"Kagome+XP+sp3+by+AMC.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae619384b81cfc664943b9f0d75cc52c6e9b254d","infoHashBuffer":{"type":"Buffer","data":[174,97,147,132,184,28,252,102,73,67,185,240,215,92,197,44,110,155,37,77]},"announce":[],"urlList":[]}}