{"title":"Choosing Home: Deciding to Homeschool With Asperger's Syndrome","uid":8467687,"size":330475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aeb5a3261ae6e419498557b29a4714fcda5a8dba&amp;dn=Choosing+Home%3A+Deciding+to+Homeschool+With+Asperger%27s+Syndrome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ariane_c","files":1,"time":1368401715,"description":"Choosing Home: Deciding to Homeschool With Asperger's Syndrome\n\nPublisher: Jessica Kingsley Pub; 1 edition (January 15, 2004) PDF pages\n\nChoosing Home will take you into the homes of Asperger families as they journey from survival of the playground bully to making it work at home. Hartnett embraces those pertinent questions raised by parents: Will I be limiting my child's emotional and social development? How will I know if my teaching is good enough? What if I can't cope? These questions and many more are answered in this touching and insightful narrative. This is a book of hope and encouragement to all parents with an interest in home schooling.\nReview\n\n'This is a very encouraging book for anyone who doubts their ability to home educate a child with Asperger's, or who may be fearful about not being able to cope with the demands from their child 24/7. It is well worth sifting through for the wise insights and practical tips. In addition the author promotes the idea of self care for the weary parent. A nicely balanced, positive book.' - Education Otherwise'Choosing Home will empower parents with its realistic portrayal of the challenges and rewards of homeschooling a child with Aspergers.' - Home Education Magazine\nAbout the Author\n\nMartha Kennedy Hartnett is the mother of a child with Asperger's Syndrome. She has successfully home schooled her son for six years - he has graduated and is now in his second year of college. Martha is actively involved with the Asperger's Association of New England, USA, as the Home Education Contact Person, offering support and assistance to families considering home education for their child. She is a member of the New Hampshire Homeschool Coalition.","torrent":{"xt":"urn:btih:aeb5a3261ae6e419498557b29a4714fcda5a8dba","amp;dn":"Choosing+Home%3A+Deciding+to+Homeschool+With+Asperger%27s+Syndrome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeb5a3261ae6e419498557b29a4714fcda5a8dba","infoHashBuffer":{"type":"Buffer","data":[174,181,163,38,26,230,228,25,73,133,87,178,154,71,20,252,218,90,141,186]},"announce":[],"urlList":[]}}