{"title":"Shannon Wright - In Film Sound [2013] [FLAC/Vinyl]","uid":8458999,"size":211980527,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af4369a400c69e50a69cf02cff8d66bb5a188b8e&amp;dn=Shannon+Wright+-+In+Film+Sound+%5B2013%5D+%5BFLAC%2FVinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":9,"time":1368182278,"description":"Artist: Shannon Wright \nRelease: In Film Sound\nReleased: 2013\nLabel: Vicious Circle\nCatalog#: R125\nFormat: FLAC / Lossless/Vinyl\n[color=blue]Country: USA\nStyle: Rock\n\n\n\n1\t Noise Parade\t3:47\t\n2\t The Caustic Light\t4:40\t\n3\t Tax The Patients\t3:17\t\n4\t Who's Sorry Now?\t4:49\t\n5\t Bleed\t4:54\t\n6\t Mire\t4:43\t\n7\t Captive To Nowhere\t4:13\t\n8\t Surely, They'll Tear It Down\t3:27\t\n9\t Mason &amp; Hamlin\t1:47\t\n\nIn the years after her longtime label Touch-N-Go closed its doors, songwriter Shannon Wright's development took on an even sharper course than when she was grounded by a stable label. Apart from releasing stunningly disparate works with 2009's piano-heavy Honeybee Girls and the more aggressive Secret Blood in 2010, Wright's profile grew in Europe with the support of an enthusiastic French label, increased festival performances, and collaboration with composer Yann Tiersen. Her ninth solo album (and first for Brooklyn imprint Ernest Jenning Record Co.) In Film Sound finds Wright embracing the strengths of various points of her seasoned career while approaching her craft with a new level of complexity and sophistication. The primal howl and angry guitars of her most punk moments ring out on tracks like &quot;The Caustic Light&quot; and heavy album opener &quot;Noise Parade.&quot; The angular guitar lines of these songs, paired with the pinpoint-precise rhythm section of drummer Kyle Crabtree and bassist Todd Cook, recall the more tormented side of mid-'90s indie rock, melding Slint-like dynamics and tonal explosions with the burning exploration and abandon of Sonic Youth at their grungiest or unsung moments from Rodan or a still-punk Blonde Redhead. Tension is the order of the day throughout In Film Sound, regardless of coarseness or volume. One of the album's most harrowing moments comes in the form of the spare piano meditation &quot;Bleed,&quot; a chilling storm of melancholia and depravity composed only of Wright's trademark growly vocal singing lines like &quot;No one can change you&quot; and &quot;I'm so useless I can't sleep&quot; over haunted, elegant piano figures and the occasional shimmer of a ride cymbal. Throughout the album's nine tracks, Wright creates a mood of agonized introspection and caustic rage. Instead of the feeling of detached narration or self-pitying helplessness that accompanied much of the mid-'90s guitar-angst indie In Film Sound takes its cues from, however, Wright instead owns her anguish, with a visceral sense of catharsis outweighing the even highly palpable depressive moments that flow through many of the tracks. Wielding complete control of both guitar maelstrom and emotional forecasting, Wright creates something more engaging than the standard tortured soul confessions with In Film Sound, coming off as much like a real-time look into a complex and mysterious life as a furious and airtight band using volume, aggression, and dynamic range as their main sonic tools.","torrent":{"xt":"urn:btih:af4369a400c69e50a69cf02cff8d66bb5a188b8e","amp;dn":"Shannon+Wright+-+In+Film+Sound+%5B2013%5D+%5BFLAC%2FVinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4369a400c69e50a69cf02cff8d66bb5a188b8e","infoHashBuffer":{"type":"Buffer","data":[175,67,105,164,0,198,158,80,166,156,240,44,255,141,102,187,90,24,139,142]},"announce":[],"urlList":[]}}