{"title":"Sensei (First Comics)","uid":8446072,"size":61954361,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:afa20261db98e0aa41348fd426ebaf9d844818cf&amp;dn=Sensei+%28First+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ichthypod_Crane","files":5,"time":1367888825,"description":"FCUP uploads continue with 'Sensei'. Take it away, Wiki!\n\n&quot;Sensei is a four-issue limited series published by First Comics from March 1989 to August 1989. Created by writer Roger Salick and artist Val Mayerik, it was a mix of science fiction and samurai culture as well as the second in First's First Fiction line of prestige-format mini-series. Cover illustrations for the series were produced by Kevin Davies.\n\nThe series follows Tadashi Natori, a person who feels that he was born in the wrong time. Despite being born in the late twentieth century, Natori is trained in the ancient art of bushido, &quot;the way of the warrior&quot; that is the basis of the samurai lifestyle. He spends his life yearning to live in ancient Japan where he thinks he would feel more comfortable and would have the opportunity to put hard-learned skills to use.\n\nTadashi Natori gets his chance to experience life in another time when his twin brother, Ken, invents a time machine. Natori uses this machine to send himself back in time to 1860s California and experience the Old West. While there, he is forced into a deadly confrontation with a crew of murderers. This, coupled with a lab accident back in his native time period, changes history and throws Natori into a barbaric New California in the year 2129.&quot;\n\n\nEach of my First Comics uploads contains a .txt file called 'First Missing'. If you have ANY of the scans listed, please contact me at the listed email. I want to make these uploads as complete as possible. Thanks!\n\nMany thanks to the creative team and the scanners! Keep it alive, please!","torrent":{"xt":"urn:btih:afa20261db98e0aa41348fd426ebaf9d844818cf","amp;dn":"Sensei+%28First+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa20261db98e0aa41348fd426ebaf9d844818cf","infoHashBuffer":{"type":"Buffer","data":[175,162,2,97,219,152,224,170,65,52,143,212,38,235,175,157,132,72,24,207]},"announce":[],"urlList":[]}}