{"title":"The Police 24 Bit Vinyl Pack","uid":8469889,"size":5936708360,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b34adf7ad89c35200df16e9fc716c95d5f2c56cb&amp;dn=The+Police+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1368460140,"description":"\n  The Police 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Style: Album Rock, New Wave, Punk\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  1978 Outlandos d'Amour\n  1978 Outlandos d'Amour (2012 PBTHAL)\n  1979 Regatta de Blanc (2 LP)\n  1980 Zenyatta Mondatta \n  1980 Zenyatta Mondatta (2012 PBTHAL) \n  1981 Ghost in the Machine\n  1982 Synchronicity\n\n  Nominally, the Police were punk rock, but that's only in the loosest sense of the term. The trio's nervous, reggae-injected pop/rock was punky, but it wasn't necessarily punk. All three members were considerably more technically proficient than the average punk or new wave band. Andy Summers had a precise guitar attack that created dense, interlocking waves of sounds and effects. Stewart Copeland could play polyrhythms effortlessly. And Sting, with his high, keening voice, was capable of constructing infectiously catchy pop songs. While they weren't punk, the Police certainly demonstrated that the punk spirit could have a future in pop music. As their career progressed, the Police grew considerably more adventurous, experimenting with jazz and various world musics. All the while, the band's tight delivery and mastery of the pop single kept their audience increasing, and by 1983, they were the most popular rock &amp; roll band in the world. Though they were at the height of their fame, internal tensions caused the band to splinter apart in 1984, with Sting picking up the majority of the band's audience to become an international superstar.\n\n  Stewart Copeland and Sting (born Gordon Sumner) formed the Police in 1977. Prior to the band's formation, Copeland, the son of a CIA agent, had attended college in California, before he moved to England and joined the progressive rock band Curved Air. Sting was a teacher and a ditch digger who played in jazz-rock bands, including Last Exit, on the side. The two musicians met at a local jazz club and decided to form a progressive pop band with guitarist Henri Padovani. For the first few months, the group played local London pubs. Soon, they were hired to appear as a bleached-blonde punk band in a chewing gum commercial. While the commercial provided exposure, it drew the scorn of genuine punkers. Late in 1977, the band released its first single, &quot;Fall Out,&quot; on IRS, an independent label Stewart Copeland founded with his brother Miles, who was also the manager of the Police. The single was a sizable hit for an independent release, selling about 70,000 copies","torrent":{"xt":"urn:btih:b34adf7ad89c35200df16e9fc716c95d5f2c56cb","amp;dn":"The+Police+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34adf7ad89c35200df16e9fc716c95d5f2c56cb","infoHashBuffer":{"type":"Buffer","data":[179,74,223,122,216,156,53,32,13,241,110,159,199,22,201,93,95,44,86,203]},"announce":[],"urlList":[]}}