{"title":"David Vanian and the Phantom Chords","uid":8240204,"size":233200915,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3b320c0008ed50f58a414b1c2535f8193770a44&amp;dn=David+Vanian+and+the+Phantom+Chords+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elgatoloco63","files":-1,"time":1362943470,"description":"Following the 1989 breakup of The Damned, Vanian, guitarist Roman Jugg and bassist Bryn Merrick formed the Phantom Chords with Brendan Moon (guitar) and Clyde Dempsey (drums). In 1990, the debut single by the band (&quot;Johnny Remember Me&quot;, a cover of a Geoff Goddard song) was released on Polydor in Australia and M&amp;G Records in the UK.\n\nHowever, although an 11-track album (including &quot;Johnny Remember Me&quot;) was written, and Polydor planned to release it, this did not happen, and only two one-sided acetates of it exist (although it has since become available through bootlegs).\n\nThe Phantom Chords released another single in 1992, &quot;Town Without Pity&quot; (a cover of a 1960s Dimitri Tiomkin/Ned Washington song) on Camden Town Records. Now featuring Donagh O'Leary on bass following the departure of Bryn Merrick In 1995, after touring in Britain and the US, they released a full-length album, David Vanian and the Phantom Chords, on Big Beat Records. At this time they performed &quot;This House Is Haunted&quot; on VH1 UK [1] as well as &quot;Born To Be Wicked&quot; on ITV's &quot;It's Bizarre&quot;.\n\nThe band's lineup was very variable. A 1993 Damned reunion (I'm Alright Jack and The Beanstalk) and later resumption of The Damned (with Vanian and Captain Sensible) meant that the Phantom Chords became a side project for Vanian, and they have released nothing since 1995. Roman Jugg left Phantom Chords, saying &quot;I got fed up with relying on someone who was unreliable&quot;[1]. However, concerts by Phantom Chords were still taking place in December 1999.Album","torrent":{"xt":"urn:btih:b3b320c0008ed50f58a414b1c2535f8193770a44","amp;dn":"David+Vanian+and+the+Phantom+Chords+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3b320c0008ed50f58a414b1c2535f8193770a44","infoHashBuffer":{"type":"Buffer","data":[179,179,32,192,0,142,213,15,88,164,20,177,194,83,95,129,147,119,10,68]},"announce":[],"urlList":[]}}