{"title":"Code Of Honor 2013 XXX 720p MKV","uid":8390001,"size":5908148267,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b3ff2a078a715e40e39e9be6f0422d57341fbc3b&amp;dn=Code+Of+Honor+2013+XXX+720p+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mpkeuter","files":2,"time":1366399678,"description":"Digital Playground - 150 mins. - Released 02/12/2013 - year: 2012\n\n        CAST\n        Bill Bailey, Brooklyn Lee, Erik Everhard, James Deen, Jesse Jane, Kayden Kross, Keiran Lee, Manuel Ferrera, Riley Steele, Selena Rose, Stoya, Tasha Reign, Tommy Gunn\n\n        DESCRIPTION\n        Code Of Honor {3set} Bluray Combo: Digital Playground presents the explosive epic adult film of the year; Code of Honor. Award winning director Robby D. invites you on an adventure of a lifetime that features the world`s sexiest women. When their former teammate is taken hostage, a super squad of bad ass beauties reunite for one last mission; to infiltrate the criminal cartel and rescue their fallen friend.Digital Playground Contract Stars Jesse Jane, Kayden Kross, Riley Steele and Stoya are the hardcore honeys that come together to save Selena Rose, the law enforcement agent that gets caught while undercover. With 7 energetically erotic sex scenes, that also include Tasha Reign and Best New Starlet Brooklyn Lee, Code of Honor infuses intensity with passion.The 3 disc set is loaded with incredible extras and revealing bonus features making the viewing experience of Code of Honor an unforgettable one. The action is hot and the sex is hotter in this amazing all-star adventure!","torrent":{"xt":"urn:btih:b3ff2a078a715e40e39e9be6f0422d57341fbc3b","amp;dn":"Code+Of+Honor+2013+XXX+720p+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ff2a078a715e40e39e9be6f0422d57341fbc3b","infoHashBuffer":{"type":"Buffer","data":[179,255,42,7,138,113,94,64,227,158,155,230,240,66,45,87,52,31,188,59]},"announce":[],"urlList":[]}}