{"title":"Sexually Broken--Wenona get roughly deep throated Wenona  Matt W","uid":8301981,"size":3000424694,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b5d050b1367d2d4fb4dc2d0bb7ca22f2087108a2&amp;dn=Sexually+Broken--Wenona+get+roughly+deep+throated+Wenona++Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1364286165,"description":"\nWenona get roughly deep throated, her HUGE nipples bound so she must keep her legs raised! | Wenona | Matt Williams\n\nMarch 25, 2013 \n \n    \n2x MP4. Not sure what difference is, but one is little bit smaller. Included both..    \n    \n \nWenona has been bondage modeling since the first days of Internet bondage sites. Today we show you the first scene ever recorded of her getting her throat fucked with hard cock while in bondage. This moment was 13 years in the making, and well worth the wait.\n\nOur former runway model and gymnast looks so cute in her sexy outfit. We move in, quickly binding Wenona's arms and wrists securely behind her. All her strength and muscles mean nothing now, she is completely helpless. We tease her with hard cock, she wants it in her mouth, but not yet. She is commanded to undress, a difficult task while bound so tightly. \n\nWe make her stick her amazing tight ass out so we can flog it. After we turn it a nice warm pink color, we get her on her knees and command her to open her mouth, close her eyes and get ready for the face fucking of a lifetime. The hard cock slides in her pretty little mouth and snakes down the back of her throat. She struggles, this is the first time receiving a proper skull fucking. We roughly introduce her to the world of boy/girl porn in bondage. \n\nWenona is wrecked from the intense face fucking. Deep spit runs down her body, her eyes glazed are over with that empty dazed look, and it looks great on her. We bend her over a table and continue the face fucking with her head hanging upside down. We add suction cups to Wenona's huge nipples and stretch them to over two inches long! \n\nNow for the real fun, slow torturous predicament bondage. We bind Wenona's ankles together and tie them to a pole so she can't bend them back to her chest. We tie up each of her HUGE nipples with a long string and with the ring on the pulley, we attach them to her ankles. Now Wenona must keep her ankles up and off the table or her nipples get brutally pulled. The effort it takes to keep her legs at that height puts amazing stress on her abs. It's a real work out, one that only the fittest can pull of for any length of time. \n\nWe fuck Wenona's hot throat some more and make her cum while she struggles with her nipple torture. In the end we leave her struggling, covered in sweat and begging for mercy... \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_25wenona/SexuallyBroken-Wenona-Matt-Williams-Wenona-get-roughly-deep-throated-her-HUGE-nipples-bound-so-she-must-keep-her-legs-raised.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_25wenona/SexuallyBroken-Wenona-Matt-Williams-Wenona-get-roughly-deep-throated-her-HUGE-nipples-bound-so-she-must-keep-her-legs-raised.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n","torrent":{"xt":"urn:btih:b5d050b1367d2d4fb4dc2d0bb7ca22f2087108a2","amp;dn":"Sexually+Broken--Wenona+get+roughly+deep+throated+Wenona++Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d050b1367d2d4fb4dc2d0bb7ca22f2087108a2","infoHashBuffer":{"type":"Buffer","data":[181,208,80,177,54,125,45,79,180,220,45,11,183,202,34,242,8,113,8,162]},"announce":[],"urlList":[]}}