{"title":"Femdom Ass Worship 21 XXX DVDRiP x264-PORNOLATiON","uid":8351020,"size":1444501254,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b7ff72ecfbe2e56d04ee93ec9e4aeac54d73c5c5&amp;dn=Femdom+Ass+Worship+21+XXX+DVDRiP+x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"xxxlavalxxx","files":1,"time":1365346191,"description":"Category Fetish, FemDom, Smothering, Evil Angel's Femdom Ass Worship Series \n  \nDirector Glenn King \nStarring Brooke Haven, Mackenzee Pierce, Tom Byron, Guy Disilva, Julie Cash, Randi Wright, Deviant Kade, Jeremy Conway, Alura Jenson \n\nWhen Dominant Women Assume Absolute Authority Over The Weaker Sex, A Male's Only Hope Is To Obey!\n\nDirector Glenn King's MeanBitch Productions celebrates the dark side of female supremacy with 'FemDom Ass Worship 21,' an all-new collection of sensuous vignettes in which cold, vicious ladies crush the male spirit using their big, beautiful asses and harsh doses of calculating cruelty. Each scene of butt worship begins with a solo show from the starring domme, who taunts the POV camera with her irresistible ass, demanding absolute subservience from the viewer!\n\nThen we see her in action, terrorizing a hapless weakling and bending him to her will. Super-stacked brunette bitch Mackenzee Pierce staggers home drunk from a party and abuses her sissified husband Deviant Kade, making him orally service her bare soles and tongue her asshole until he's begging for mercy. She gets him off... and smears his sperm all over his face.\n\nImpossibly voluptuous BBW blonde Julie Cash torments housemate Tom Byron. The plump princess ruthlessly smothers his face with her enormous, round booty and makes him suck her cute toes. Randi Wright, a busty, black leather-clad dominatrix, uses pathetic ass slave Guy DiSilva for a severe session of dungeon training. And big-boobed MILF Alura Jenson turns the tables on dating service geek Jeremy Conway; he's looking for a small, submissive girl, but instead ends up thoroughly used and humiliated by the mature Amazon. In 'FemDom Ass Worship 21,' bitches rule from the very seat of power!\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=faw21f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=faw21f.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=faw21b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=faw21b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=plfaw21mp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=plfaw21mp4.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b7ff72ecfbe2e56d04ee93ec9e4aeac54d73c5c5","amp;dn":"Femdom+Ass+Worship+21+XXX+DVDRiP+x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7ff72ecfbe2e56d04ee93ec9e4aeac54d73c5c5","infoHashBuffer":{"type":"Buffer","data":[183,255,114,236,251,226,229,109,4,238,147,236,158,74,234,197,77,115,197,197]},"announce":[],"urlList":[]}}