{"title":"IMAGE COMICS WEEK OF 2013.05.01","uid":8435201,"size":984659753,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b9fe47665876247f1beb568488a29002f437daee&amp;dn=IMAGE+COMICS+WEEK+OF+2013.05.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1367606243,"description":"This week Image published the last issues of Epic Kill and Snapshot, and the first issue of Straczynski &amp; Templesmith's Ten Grand. This torrent includes: the regular Image Comics released this Wednesday; G-Man #5 (a digital exclusive released on Tuesday); and BlackAcre Volume 1 trade paperback, which jk-Empire released on Wednsday also.\n\nPlease seed and share with our friends here on TPB!  --STFmaryville\n\n------\n\n'68: Jungle Jim #2\n\nThe skies over Vietnam rain liquid fire as Brian Curliss, AKA Jungle Jim continues his epic quest to find the rotting, undead remains of Sergeant Jim Asher. Jim's search carries him across the border into war-torn Cambodia, where the struggling occupants of an isolated French mission hold their own against hunger, madness and the ravenous dead.\n\nIn the dripping shadows of the rainforest, human life hangs on a hair trigger and to save himself and those who need him, Jim will have to face more than the living dead and swarms of vengeful Viet Cong... because here there be tigers.\n\nGenre: Horror\t\n\n------\n\nThe Activity #12\n\nBefore SWITCHFOOT was in the activity, he was an operator in Delta Force. Guest artist Marc Laming takes Switchfoot's Delta squad into Fallujah during the 2004 siege where the team's actions will draw fire from the enemy and the US Marines alike.\n\n------\n\nArtifacts #27\n\n&quot;TRUTHS &amp; DESTINIES&quot;\n\nTom Judge and Tilly Grimes are not the only ones that know the hidden truths of the universe. The Catholic Church knows dark realities kept secret from the world and they have agents to protect us from those secrets, whether we want them to... or not. RON MARZ and new artist MARCO TURINI re-introduce one of Top Cow's most popular characters into the &quot;Rebirth&quot; universe!\n\nGenres: Action/Adventure, Drama\t\n\n------\n\nBlackAcre #6\nA special stand-alone issue taking you to the darkest corners of the Hinterlands. Visions of heaven, the reality of hell... and a secret buried deep in the woods.\n\n------\n\nBlackAcre Vol. 1 TP\n\n&quot;AN ERRAND INTO THE WILDERNESS&quot;\n\nA walled utopia conceived by the elites of the former United States. A barbaric wilderness engulfed in the perpetual strife of tribal warfare. A crack soldier tasked with a clandestine mission to recover a lost comrade. Welcome to the American dark age of the 22nd Century.\n\nThe first arc of Image's dystopian espionage thriller is collected here! Already acclaimed by some of comics' top creators and released just in time for readers to jump on board with issue 6!\n\n------\n\nEpic Kill #10\n\nThe series' EPIC conclusion!\n\nSong's uncle, her sole remaining family, is killed while in government custody.\nEnraged, will Song seek vengeance for his death, or try to find inner peace so she can finally lead a normal life?\n\n------\n\nInvincible Universe #2\nCecil Steadman's bargain with Mr. Liu has taken a turn for the worst - and now the greatest heroes of the Invincible Universe must defeat the dragon unleashed! But who will pay the cost for Cecil's choice?\n\nGenres: School Life, Superhero\t\n\n------\n\nMice Templar IV: Legend #2\n\n&quot;DESPERATE SEASON&quot;\n\nKaric and his cause have been betrayed, and the fragile alliance he forged crumbles before him. Faced with ever-increasing loss, the courageous mouse makes a daring decision! Meanwhile, his surviving family and friends in hiding at the capital city face an even greater betrayal by one of their own; and Karic's mother Mornae comes face-to-face with the wrath of the mad king Icarus!\n\n------\n\nSavage Dragon #187\n\n&quot;THE VICIOUS CIRCLE RISING&quot;\n\nA glimpse into the lives of Chicago's notorious criminal organization. For decades the Vicious Circle has all but ruled the Windy City. Now, at last, we enter their world and see through their eyes. We see their struggles, their fears, the obstacles they face. Introducing the sons and daughters of the Vicious Circle. We see the crime family they were born to inherit and the forces who oppose them.\n\nGenres: Action/Adventure, Superhero\t\n\n------\n\nSnapshot #4 (of 4)\n\nMINISERIES CONCLUSION!\n\nIt all ends here as the awful truth behind a multi-million dollar conspiracy is revealed, with deadly consequences. If young Jake is to survive , what kind of man must he become? And is it worth the price?\n\n------\n\nSon of Merlin #4\n\nOSCAILT AMACH!\n\nMorgana has found the brilliant M.I.T. professor and heir to Merlin's magic, Dr. Simon Ambrose, and will stop at nothing to seize Merlin's power from his grasp. Simon, however, is untrained in magic and until he is better versed in casting Druid spells, he will need to rely on the safeguards Merlin planned in advance for him to flee Morgana's wrath. But will it be enough?\n\n------\n\nSpawn #231\n\n&quot;COMPLEX MESSIAH&quot; Part Three\n\nWho Is In Control? The Man? Or the Monster?\n\n&quot;Complex Messiah&quot; is an epic new story arc, serving as a jumping on point for new readers, as well as the next phase in Spawn's evolution. As the worldwide fervor around Jim Downing's miraculous gifts continues to grow, the darkness that lives within him begins to threaten his newfound fame.\n\nMeanwhile, a small group of online friends gain insight into their understanding of the Hellspawn, slowly piecing together a dangerous new theory about the world's newest &quot;messiah.&quot;\n\nAnd, somewhere in the shadows, an old enemy lurks.\n\nAlso featured: Detective Craig Rowand came to New York looking for clues. That journey brought him face-to-face with evil in the form of the demonic temptress, Hel. Haunted by the encounter, a good man's steady spiral into madness begins here.\n\n------\n\nSuper Dinosaur #19\n\nWho or WHAT is TYRANNOSAURUS X - and HOW can Derek Dynamo and Super Dinosaur ever hope to defeat him?! EEK!\n\n------\n\nTen Grand #1\n\nJoe Fitzgerald was a mob enforcer until the day he met Laura, who convinced him to leave that world behind. Before quitting, Joe agreed to one last job, little realizing that the man he'd been sent to kill was deeply involved in demonlogy. He survived Joe's attempt and came after him, fatally wounding Joe and killing Laura. As he lay dying, an angelic force (who may or may not be what she appears) pointed out that where she is going, he can't follow, and where he is going, he wouldn't want her to follow. But if he will agree to work for them as a different kind of enforcer, they will bring him to life and keep on bringing him to life every time he is killed in a righteous cause. The reward: for those five minutes of death, he will be with Laura again. Would you endure an eternity of pain and death, dying over and over, to be with the woman you love for just five minutes each time you died? Most people might say no. But Joe Fitzgerald isn't most people.","torrent":{"xt":"urn:btih:b9fe47665876247f1beb568488a29002f437daee","amp;dn":"IMAGE+COMICS+WEEK+OF+2013.05.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9fe47665876247f1beb568488a29002f437daee","infoHashBuffer":{"type":"Buffer","data":[185,254,71,102,88,118,36,127,27,235,86,132,136,162,144,2,244,55,218,238]},"announce":[],"urlList":[]}}