{"title":"Sexually Broken--Super MILF Ava Devine is bound helpless  Ava De","uid":8477852,"size":1526350777,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ba5bfd0696a59038c3e7e5a26af16900fa20236e&amp;dn=Sexually+Broken--Super+MILF+Ava+Devine+is+bound+helpless++Ava+De&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1368660588,"description":"Super MILF Ava Devine is bound helpless and deeply ASS fucked. Deep throated, rough ANAL sex! | Ava Devine | Matt Williams\n\nMay 15, 2013 \n \n\nMP4 only.\n \n \nHang on we have super MILF Ava Devine in the house today. And it is an all ANAL update. We listened to the members and they want more ANAL. So as we move forward we will be bringing more and more rough ANAL sex to Sexually Broken. Ava is a treasure, huge blow job mouth, no gag reflex, bodacious body, huge tits, amazing phat ass and a sex drive to match any person on the planet. Ava should be the standard that all porn stars try to emulate, this girl is the definition of SEX.\n\nWe toss Ava the biggest ring gag we have and command her to put it on, next a blind fold. We drop Handcuffs into her hands and she must cuff her hands behind her back. We tell her to get on her knees, and we take stock. A huge titted sex starved MILF is on her knees with her mouth held open, she is helpless and we have hard cocks, what to do...\n\nWe make her crawl back and forth for cock. She follows our voices and we fuck her throat. She must spread her ass for the other guy while cock is skull fucking her silly. After we warm her up we go rogue. It is a free-for-all as we attack Ava with cock. We shove both cocks into her huge mouth. We bend her backwards and fuck her throat, we manhandle her to several different positions all the while keeping a cock firmly lodged deep in her throat.\n\nWe move her to the wall and tie her legs spread open. Ava's head hangs back off a ledge and we fuck her mouth while her head is upside down. A cock just slides into her ASS and now it is on. We are ass and throat fucking this MILF into overdrive. She has no choice but to take the cock. Her hands are still cuffed and pulled to the ground, as cock is buried chin deep into her wet throat. She gets air when we want her to, and there is always a cock deep in her ass making her cum. Back and forth rougher and rougher. Ava is left with ASS juice dripping out of her holes, and deep spit coating her pretty face. This is just the warm up. Ava is in for a brutal ride...  \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_15adevine/SexuallyBroken-Ava-Devine-Matt-Williams-Super-MILF-Ava-Devine-is-bound-helpless-and-deeply-ASS-fucked-Deep-throated-rough-ANAL-sex.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_15adevine/SexuallyBroken-Ava-Devine-Matt-Williams-Super-MILF-Ava-Devine-is-bound-helpless-and-deeply-ASS-fucked-Deep-throated-rough-ANAL-sex.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:ba5bfd0696a59038c3e7e5a26af16900fa20236e","amp;dn":"Sexually+Broken--Super+MILF+Ava+Devine+is+bound+helpless++Ava+De","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba5bfd0696a59038c3e7e5a26af16900fa20236e","infoHashBuffer":{"type":"Buffer","data":[186,91,253,6,150,165,144,56,195,231,229,162,106,241,105,0,250,32,35,110]},"announce":[],"urlList":[]}}