{"title":"The Who 24 Bit Vinyl Pack","uid":8455929,"size":8284074383,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb6d734e3a77da32fc0796cd6eec223be2a44470&amp;dn=The+Who+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1368107620,"description":"\n  The Who 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Style: Album Rock, British Invastion, Hard Rock, Psychedelic\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  1965 My Generation\n  1966 A Quick One\n  1967 The Who Sell Out\n  1968 Dogs &amp; Call Me Lightning\n  1969 Tommy\n  1971 Meaty Beaty Big and Bouncy\n  1971 Who's Next\n  1973 Quadrophenia\n  1974 Odds &amp; Sods\n  \n  Few bands in the history of rock &amp; roll were riddled with as many contradictions as the Who. All four members had wildly different personalities, as their notoriously intense live performances demonstrated. The group was a whirlwind of activity, as the wild Keith Moon fell over his drum kit and Pete Townshend leaped into the air with his guitar, spinning his right hand in exaggerated windmills. Vocalist Roger Daltrey strutted across the stage with a thuggish menace, as bassist John Entwistle stood silent, functioning as the eye of the hurricane. These divergent personalities frequently clashed, but these frictions also resulted in a decade's worth of remarkable music -- it took some five years to find their audience, but at the tail end of the 1960s they suddenly achieved a level of popularity rivaling the Rolling Stones, both as a live act and in album sales.\n\n  As one of the key figures of the British Invasion and the mod movement of the mid-'60s, the Who were a dynamic and undeniably powerful sonic force. They often sounded like they were exploding conventional rock and R&amp;B structures with Townshend's furious guitar chords, Entwistle's hyperactive basslines, and Moon's vigorous, seemingly chaotic drumming. Unlike most rock bands, the Who based their rhythm on Townshend's guitar, letting Moon and Entwistle improvise wildly over his foundation, while Daltrey belted out his vocals. This was the sound the Who thrived on in concert, but on record they were a different proposition, as Townshend pushed the group toward new sonic territory. He soon became regarded as one of the finest British songwriters of his era, rivaling John Lennon and Paul McCartney of the Beatles and Mick Jagger and Keith Richards of the Rolling Stones, as songs like &quot;The Kids Are Alright&quot; and &quot;My Generation&quot; became teenage anthems, and his rock opera, Tommy, earned him respect from mainstream music critics.\n  \n  Townshend continually pushed the band toward more ambitious territory, incorporating white noise, pop art, and conceptual extended musical pieces into the group's style. The remainder of the Who, especially Entwistle and Daltrey, weren't always eager to follow him in his musical explorations, especially after the success of his first rock opera, Tommy. Instead, they wanted to stick to their hard rock roots, playing brutally loud, macho music instead of Townshend's textured song suites and vulnerable pop songs. Eventually, this resulted in the group abandoning their adventurous spirit in the mid-'70s, as they settled into their role as arena rockers. the Who continued on this path even after the death of Moon in 1978, and even after they disbanded in the early '80s, as they reunited numerous times in the late '80s and '90s to tour America. The group's relentless pursuit of the dollar was largely due to Entwistle and Daltrey, who never found successful solo careers, but it had the unfortunate side effect of tarnishing their reputation for many longtime fans. However, there's little argument that at their peak the Who were one of the most innovative and powerful bands in rock history.\n","torrent":{"xt":"urn:btih:bb6d734e3a77da32fc0796cd6eec223be2a44470","amp;dn":"The+Who+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb6d734e3a77da32fc0796cd6eec223be2a44470","infoHashBuffer":{"type":"Buffer","data":[187,109,115,78,58,119,218,50,252,7,150,205,110,236,34,59,226,164,68,112]},"announce":[],"urlList":[]}}