{"title":"Alfred Hitchcock's Notorious (Criterion) DVD-R R1 NTSC SteelerJ1","uid":8435774,"size":4681431040,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bcf6e63bbdbb0fce1c173b01bcc3da0f5824f85f&amp;dn=Alfred+Hitchcock%27s+Notorious+%28Criterion%29+DVD-R+R1+NTSC+SteelerJ1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SteelerJ17","files":-1,"time":1367624972,"description":"Alfred Hitchcock's Notorious (Criterion) DVD-R R1 NTSC SteelerJ17\n\nThis is a iso file. You can easily burn it through using Nero or IMGBurn\n\nRunning Time 1hr 42mins      Rated-NR\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0038787/?ref_=sr_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0038787/?ref_=sr_1&lt;/a&gt;\n\nIt's currently out of print on Criterion\n\nIn Notorious, a brilliant allegory of love and betrayal, Hitchcock fuses two of his favorite elements: suspense and romance. A beautiful woman with a tainted past (Ingrid Bergman) is enlisted by American agent Devlin (Cary Grant) to spy on a ring of Nazis in post-war Rio. Her espionage work becomes life-threatening after she marries the most debonair of the Nazi ring, Alex (Claude Rains). Only Devlin can rescue her, but to do so he must face his role in her desperate situation and acknowledge that he's loved her all along. Stunning performances, Ben Hecht's excellent script, and Hitchcock's direction at its best make Notorious a perfect film.\n\nMenus-Yes\nExtras-Yes\n\nSpecial Features including\nCommentaries by Hitchcock film scholar Marian Keane and film historian Rudy Behlmer, editor of Memo from David O. Selznick\nComplete broadcast of the 1948 Lux Radio Theatre adaptation, starring Ingrid Bergman and Joseph Cotton\nRare production, publicity, and rear projection photos, as well as promotional posters and lobby cards\nProduction correspondence\nCollection of trailers and teasers\nScript excerpts of deleted scenes and alternate endings\nExcerpts from the short story &quot;The Song of the Dragon,&quot; source material for Notorious\nRare newsreel footage of Bergman and Hitchcock\nIsolated music and effects track\n\nLet's get this SEEDED people!! Remember it's nice to share. Don't Be A Hit and Run!! (Note: I will seed for 1 week only!!!!)\n\nPlease NO REQUESTS!!!! It's gets too overwhelming for me. I'm only going to upload movies that I think people will like. \n\nPlease enjoy and SEED your TORRENTS!! Seed IT!!\t\n\n","torrent":{"xt":"urn:btih:bcf6e63bbdbb0fce1c173b01bcc3da0f5824f85f","amp;dn":"Alfred+Hitchcock%27s+Notorious+%28Criterion%29+DVD-R+R1+NTSC+SteelerJ1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf6e63bbdbb0fce1c173b01bcc3da0f5824f85f","infoHashBuffer":{"type":"Buffer","data":[188,246,230,59,189,187,15,206,28,23,59,1,188,195,218,15,88,36,248,95]},"announce":[],"urlList":[]}}