{"title":"FakeAgent - Briggi c1075_briggi_720 ImgZilla","uid":8333893,"size":630281202,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c19b3603847fd089a73ce5329edc4818424ad694&amp;dn=+FakeAgent+-+Briggi+c1075_briggi_720+ImgZilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":-1,"time":1364939797,"description":"Size: 630281202 bytes (601.08 MiB), duration: 00:46:36, avg.bitrate: 1803 kb/s\nAudio: aac, 44100 Hz, stereo (eng)\nVideo: h264, yuv420p, 1280x720, 25.00 fps\n\n\nBriggi (46 mins) Briggi the blonde busty nymphomaniac had two things on her mind, 'sex' and 'money'. She had the look of a failed dominatrix as she casually strolled into my office. Her face was beautiful and the expressions she was giving made her look like she was concealing something, something. Like she had a dirty little secret harboured away in the dark recesses of her mind. Her dress suggested a lot of things. It was so bright I thought about wearing my ray bans but thought better of it, anyhow, the dress was screaming out 'look at me, I'm the centre of the mother f***ing universe'. It was slightly awkward when she told me that we'd met before, because I couldn't for the life of me remember who she was, it must have been a bit of a kick in the teeth for a woman like Briggi. Nonetheless, when we got chatting the atmosphere dissipated and we started chatting about what important stuff, like money and sex. After the formalities were through the sex was amazing, I explored the nether regions of her body, peeling back the layers of womanhood from her voluptuous inner bounty. Apart form being quite a high maintenance sex crazed nypho she was really a sweet heart. This girl new what she wanted and she wanted it yesterday. Lucky for me this involved me creampieing the fuck out of her from behind. Happy days!","torrent":{"xt":"urn:btih:c19b3603847fd089a73ce5329edc4818424ad694","amp;dn":"+FakeAgent+-+Briggi+c1075_briggi_720+ImgZilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19b3603847fd089a73ce5329edc4818424ad694","infoHashBuffer":{"type":"Buffer","data":[193,155,54,3,132,127,208,137,167,60,229,50,158,220,72,24,66,74,214,148]},"announce":[],"urlList":[]}}