{"title":"Leisure Suit Larry: Box Office Bust [PS3]","uid":8236164,"size":1959190584,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c1ebf4cd74261595cb8645bcd3acbd52d5904542&amp;dn=Leisure+Suit+Larry%3A+Box+Office+Bust+%5BPS3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"thenoobish","files":821,"time":1362846339,"description":"Language: English\n\nLeisure Suit Larry: Box Office Bust \nby Codemasters Games \nRated: Mature \n\n    * Hollywood voice talent from; Carmen Electra (Scary Movie), Shannon Elizabeth (American Pie), Peter Graves, Patrick Warburton and Jay Mohr \n    * Explore with Larry in a pick up and play open world, packed full of hilarious mini-games \n    * Play ridiculous rip-offs of classic movies, including: Bytanic, Beefcake Mountain and Horror Coffin \n    * All new directors mode: Pump your creative juices in the director's chair for your chance to create your own side-splitting movie sequences \n    * Girls, Girls, Girls - True to the franchise, Leisure Suit Larry will feature gorgeous babes that, as usual, are out of Larry's league \n\nThe original Larry is now a movie mogul, but he's got a problem...the studio across the road always seem to know what he's making: there must be a mole in the studio! Uncle Larry turns to you, his nephew, Larry Lovage - to solve the mystery, after all, no-one would suspect a guy working in the mail room right? You must uncover the identity of the mole...the very existence of the studio depends upon it! What could possibly go wrong? \n\nThe Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larrys movie lot doing odd jobs and trying to uncover a mole from another studio who threatens to air the studio's dirty laundry in the tabloids. Leisure Suit Larry: Box Office Bust is a rollicking, innuendo-laden lampoon of Hollywood that features open world sand box game play that includes exploration, platforming, racing and puzzle-solving to complete missions. Additionally, the game features an all-new Directors Game that allows the player to create their very own &quot;Larry Feature.&quot; True to form, Leisure Suit Larry Box Office Bust features sophomoric comedy and bombshell babes thanks to the writing talents of Allen Covert and an All-Star cast of actors and actresses, including Jay Mohr, Dave Attell, Shannon Elizabeth, Carmen Elektra, Patrick Warburton, Jeffrey Tambor, Nikki Cox, Peter Graves, Jane Lynch and Josh Keaton as the voice of Larry Loveage. ","torrent":{"xt":"urn:btih:c1ebf4cd74261595cb8645bcd3acbd52d5904542","amp;dn":"Leisure+Suit+Larry%3A+Box+Office+Bust+%5BPS3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1ebf4cd74261595cb8645bcd3acbd52d5904542","infoHashBuffer":{"type":"Buffer","data":[193,235,244,205,116,38,21,149,203,134,69,188,211,172,189,82,213,144,69,66]},"announce":[],"urlList":[]}}