{"title":"Various Artists - South Texas Rhythm 'n' Soul Revue (2013) [FLAC","uid":8391004,"size":207402543,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c21e92275d0be76baafbf1e9a0042f2a7f00bf51&amp;dn=Various+Artists+-+South+Texas+Rhythm+%27n%27+Soul+Revue+%282013%29+%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Splong","files":-1,"time":1366430378,"description":"eac secure cue log scans\n\nVA - South Texas Rhythm 'n' Soul Revue\nRelease Date: February 25, 2013\nLabel: Kent Records (CDKEND 390)\n\n\nThe first of what's promised to be many trips into Huey P. Meaux's deep vaults, Ace's 2013 compilation South Texas Rhythm 'N' Soul Revue is an unfettered delight, collecting 24 sides released on the Jet Stream, Tear Drop, Eric, Cascade, Pacemaker, Boogaloo, and Trinity imprints between 1962 and 1973, adding three previously unissued numbers for good measure. Hits aren't the name of the game here, nor are there too many household names: Big Walter Price (not Big Walter Horton), Johnny Adams, Johnny Copeland, and Barbara Lynn (the latter represented with a demo of &quot;You'll Lose a Good Thing&quot;) are the names that could possibly spark recognition, but even these are better-known by aficionados, not trainspotters. Yet, that's the appeal of this collection: it unearths sides rarely heard outside of the serious collectors' purview, and there is plenty of deep soul to treasure here, some soulful slow grooves balanced by gritty workouts, bluesy vamps, and the occasional novelty, like the breakneck &quot;Fat Man&quot; by TV &amp; the Tribesmen. Mostly, this is regional R&amp;B music, playing to either the juke joints or crossover radio of the mid-'60s. There may be no outright knockouts here but every one of the 24 songs is easy to enjoy and some, like the relentless rhythms of Copeland's &quot;Sufferin' City&quot; and Jackie Paine's &quot;Go Go Train,&quot; are so infectious they're hard to resist. That the rest is for serious R&amp;B listeners -- the kind who enjoy how James Young reworks Lee Dorsey's &quot;Ya Ya&quot; or Sunny &amp; the Sunliners' cover of Earl King's &quot;Trick Bag&quot; -- is hardly a detriment, as this is all grooving R&amp;B, blues, and soul that defines the upper end of &quot;generic.&quot; It may not transcend the genre, but it certainly embodies it, which is a good thing. --Stephen Thomas Erlewine, AllMusicGuide\n\n\nThis terrific CD is a bit of a tease, promising as it does to be the first in a longer term project of opening up of the vaults of Music Enterprises Inc, the owners of the master tapes of recordings made for the various Houston labels of Huey Meaux. As a risk-taking musical entrepreneur, Huey offered recording opportunities to singers and musicians that were finding it difficult to secure studio time with more established labels, and in so doing created an enormous back catalogue of rare sides of artists, some of who eventually did go on to later success elsewhere while most were never, or barely, known of outside of their locality.\n\nWithin these 24 tracks of rare mid-60s R&amp;B and soul sides, taken from the original tapes and virtually all on CD for the first time, there are great early sides from the soon to be famous Johnny Copeland, Jean Knight, Johnny Adams, Barbara Lyn, Warren Storm and Joe Medwick (included here as Joe Melvin).  The Insight's rockin version of James Brown's Out Of Sight from 1966 may also sound vaguely familiar to some, featuring as it does a very early appearance on record of brothers Johnny and Edgar Winter.\n\nWarren Storm's reputation as a poster boy of swamp pop is difficult to predict from the inclusion here of  his affecting Otis Redding-like deep soul ballad Tennessee Waltz, while those of you who know Johnny Copeland from his later successes as a gritty Texas blues singer and guitarist will be more than a little impressed with his earlier incarnation as a gravel voiced soul singer - his Slow Walk You Down is a particular highlight here.\n\nJohnny Adams also forged a high profile career as New Orleans' The Tan Nightingale but here he is with an rare early cover of Little Willie John's classic Let Them Talk.\n\nIt's not all, or even mostly, about rare sides of artists that would later make it big. The beauty of this CD is that it is fabulous in its own right, just listen to Jean Knight's Doggin' Around with an impassioned plea to her lover to stop breaking her heart, or the strong vocal performances on unfinished demo versions of a couple of tracks that end this CD; the first by Alton Valier's on Neighbour, Neighbour and the second by Barbara Lynn on You'll Lose A Good Thing. There are even tasty versions of Eddie Boyd's blues classic Five Long Years (by Tee Bee Fisher) and Earl King's New Orleans favourite Trick Bag (by Sunny &amp; The Sunliners).\n\nAll in all, this CD is a fabulous addition to the Kent imprint's series of southern soul and the next release from these newly-opened vaults is already eagerly awaited around here  --Red Lick Records\n\n\nTrack Listing:\n1. Go Go Train - Jackie Paine\n2. Doggin' Around - Jean Knight\n3. Git To Gittin' - Big Walter\n4. Tennessee Waltz - Warren Storm\n5. Trick Bag - Sunny And The Sunliners\n6. Pick Me Up On Your Way Down - Margo White\n7. Long Gone - James Young\n8. Out Of Sight - The Insight \n9. Time - Charles Berry\n10. If You're Looking For A Fool - David King Thomas\n11. Let Them Talk - Johnny Adams\n12. This Is Where The End Must Begin - Joe Masters \n13. Irene - Rockin' Dave Allen\n14. Slow Walk You Down - Johnny Copeland\n15. Fat Man - Tv And The Tribesmen\n16. If You Were Only Here - Margo White\n17. Five Long Years - Tee Bee Fisher\n18. A Place Called Home - Johnny Adams\n19. I Found A Love - Maxine Davis\n20. Sufferin' City (Version 2) - Johnny Copeland\n21. Friends In Show Business - Joe Melvin\n22. Go Go Train (WMCA Version) - Jackie Paine\n23. Neighbour Neighbour (Demo) - Alton Valier\n24. You'll Lose A Good Thing (Demo) - Barbara Lynn\n\n\nSoulful R&amp;B released on tiny Texas labels such as Boogaloo, Eric, Jet Stream, Pacemaker and Tear Drop.\nAll of them where recorded by Huey &quot;The Crazy Cajun&quot; Meaux.\nPersonal picks: Tennessee Waltz - Warren Storm, Trick Bag - Sunny And The Sunliners, Out Of Sight - The Insight, Irene - Rockin' Dave Allen, Slow Walk You Down - Johnny Copeland and If You Were Only Here - Margo White.\n\n\nEnjoy! \n\n","torrent":{"xt":"urn:btih:c21e92275d0be76baafbf1e9a0042f2a7f00bf51","amp;dn":"Various+Artists+-+South+Texas+Rhythm+%27n%27+Soul+Revue+%282013%29+%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21e92275d0be76baafbf1e9a0042f2a7f00bf51","infoHashBuffer":{"type":"Buffer","data":[194,30,146,39,93,11,231,107,170,251,241,233,160,4,47,42,127,0,191,81]},"announce":[],"urlList":[]}}