{"title":"Jack Rose - Jack Rose [2006][EAC,log,cue. FLAC]","uid":8465348,"size":213455354,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c2d7d7a9eb67cd5a125db402ef03fad47c68eb9c&amp;dn=Jack+Rose+-+Jack+Rose+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":11,"time":1368343205,"description":"Artist: Jack Rose\nRelease: Jack Rose\nReleased: 2006\nLabel: aRCHIVE\nCatalog#: archive28\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Folk,Americana\n\n\n\n\n1\t Levee\t3:07\t\n2\t Revolt\t2:57\t\n3\t St. Louis Blues\t4:18\t\n4\t Miss Mary's Place\t2:48\t\n5\t Gage Blues\t3:53\t\n6\t Spirits In The House\t12:55\t\n7\t Dark Was The Night\t3:54\n\nThe cover of Jack Rose?s new album ?Jack Rose? is adorned with a sepia-toned reproduction of an old photograph of two men, who are actually relatives of Mr. Rose, sitting in front of a field dressed in their Sunday?s best. Across the lap of the man sitting on the left is a guitar, while the other is holding a fiddle in an upright position, they each face the camera as if they are saying ?ok let?s get this over with so we can play some music.?\n\nWith that in mind, one could easily imagine the seven compositions found on this release, as a reflection upon the very image that adorns its cover. Composed without sentimentally trying to recapture the experience of the two men, but written to capture the experience of the living, breathing man viewing the image today. Though a nostalgic air lies heavily over this record, it is more meditation than an attempt to recover a moment that is lost forever.\n\nIn opposition to ?Kensington Blues,? which found Mr. Rose exploring all aspects of his playing, from ragtime to raga, this record finds him focusing exclusively on one aspect of his playing; blues for the lap steel guitar. The seven lonesome tunes that Mr. Rose has composed for this record lead one down various emotional paths ranging from pure elation to contemplation and a yearning for the past. From the first note to the last one will find themselves lost in Mr. Rose?s ruminations.\n\nThe album begins on a very ?blue? note with the loping ?levee,? which slowly picks up the pace into to something more reminiscent of a reverie, great stuff for an early Sunday morning or a bit of a car drive. ?Revolt? follows a similar format but with a little more acceleration, from which you are then taken back down a bit with a wonderful rendition of Fahey?s ?St. Lois Blues.? From there we move into the upbeat but slightly melancholic ?Miss Mary?s Place,? a title and song that transports the listener into that space that time has somehow managed to forget. ?Gage Blues? is an ecstatic blues rave up, the real feel good piece before the bittersweet album highlight, ?Spirits in the House,? in which Jack is able to fully explore many of the facets of his instrument; from weeping slide playing into kaleidoscopic finger picking and back again, it?s on this track that Jack is able to truly stretch out and shine over the course of twelve plus minutes. The album closes with ?Dark was the Night,? a final look back at days gone by.\n\nOn this record, more than any other, Mr. Rose is able to lay down some very raw emotions in a very sophisticated, yet simple manner that is light-years ahead of many of the other Takoma revivalists and has really pushed him to the next level as an artist. It will be very interesting to see what he does next. 9/10","torrent":{"xt":"urn:btih:c2d7d7a9eb67cd5a125db402ef03fad47c68eb9c","amp;dn":"Jack+Rose+-+Jack+Rose+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d7d7a9eb67cd5a125db402ef03fad47c68eb9c","infoHashBuffer":{"type":"Buffer","data":[194,215,215,169,235,103,205,90,18,93,180,2,239,3,250,212,124,104,235,156]},"announce":[],"urlList":[]}}