{"title":"Dr. Timothy Leary - Turn On, Tune In, Drop Out  (1989) {FLAC}","uid":8442757,"size":189577872,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c321f04b8de0d3f56aa119f96cb76ea4a4a94367&amp;dn=Dr.+Timothy+Leary+-+Turn+On%2C+Tune+In%2C+Drop+Out++%281989%29+%7BFLAC%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1367811448,"description":"\n\n\nDr. Timothy Leary\nTurn On, Tune In, Drop Out OST [Reissue] (1989)\n\n\n\n\n\nallmusic.com...\n\nIn the 1960s and '70s, Dr. Timothy Leary managed to offend people on both the left and right. President Richard Nixon called him &quot;the most dangerous man in America,&quot; and many liberals and progressives felt that Leary's blatant promotion of LSD hurt their causes. Regardless, Leary was an icon of the psychedelic '60s counterculture, and some of his psychedelic theories and ideas can be heard on Turn On, Tune In, Drop Out. David Hancock, a busy classical recording engineer in the '60s, recorded this spoken word album in Leary's Hudson Valley, NY estate in 1967. Turning these recordings into an actual album required a lot of work on Hancock's part; when Leary spoke to Hancock, there were long pauses between each phrase -- and Hancock needed to edit out those pauses in order to make Turn On, Tune In, Drop Out sound like a legitimate spoken-word album. On this disc, one hears Leary expressing his belief that most of society's problems are caused by people over 40 (although Leary himself was about 46 or 47 at the time) and complaining that the American school system breeds mindless conformity, but mostly, he talks about drugs -- especially LSD, which Leary believed could dramatically change society for the better. But one doesn't have to agree with Leary's theories to realize that Turn On, Tune In, Drop Out has historic value. This recording is very much a product of its time, and it is an intriguing listen despite -- or perhaps because of -- Leary's eccentricities and excesses. \n\n\nAudio Quality:\t\tFLAC (Lossless)\nAudiochecker:\t     \t99.70% CDDA\nLabel:\t\t\tPerformance Records\nCatalog:\t\tPERF 389CD\n\n\nOriginal Release:\t1967\n\n\n\nAudio Info:\n\n\n01.Turn On, Tune In, Drop Out\n02.The Turn On\n03.The Tune In\n04.The Beginning Of The Voyage (Heart Chakra)\n05.Root Chakra\n06.All Girls Are Yours\n07.Freak-Out\n08.Freak-Out (Continued)/Genetic Memory\n09.Re-Entry (Nirvana)\n10.Epilogue (Turn On, Tune In, Drop Out)\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n\n","torrent":{"xt":"urn:btih:c321f04b8de0d3f56aa119f96cb76ea4a4a94367","amp;dn":"Dr.+Timothy+Leary+-+Turn+On%2C+Tune+In%2C+Drop+Out++%281989%29+%7BFLAC%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c321f04b8de0d3f56aa119f96cb76ea4a4a94367","infoHashBuffer":{"type":"Buffer","data":[195,33,240,75,141,224,211,245,106,161,25,249,108,183,110,164,164,169,67,103]},"announce":[],"urlList":[]}}