{"title":"PETER WOLF - Lights Out [1984-Vinyl-Flac-16/44.1][Bubanee]","uid":8442243,"size":256457839,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c32ca72926db0448d6e9d86f16fbf64f8adec274&amp;dn=PETER+WOLF+-+Lights+Out+%5B1984-Vinyl-Flac-16%2F44.1%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bubanee","files":12,"time":1367800309,"description":"After Peter Wolf ditched the J. Geils Band in 1983 because co-leader Seth Justman turned down a batch of new songs Wolf had written with Don Covay and Michael Jonzun, he made the most of it and released the great Lights Out album. Boasting a huge hit single, the bouncing, machine funk monster title track, and a raft of catchy, candy coated' '80s pop, the album is one of the hidden gems of the era. Wolf casts off the responsibilities of fronting an arena rock band and heads straight for the pop jugular, leaving bluesy guitar licks and harmonica bleating in his rearview. With Michael Jonzun behind the board, the album is slicker than ice and loaded with cheesy synths, electronic drums, reverb, and &quot;sweetening.&quot; It is also very well arranged; the synthetic sounds never overtake Wolf's gritty soul and personality -- really a perfect balance of soul and machines that only a few artists were able to pull off in the '80s. Apart from the title track, the moderate charter &quot;I Need You Tonight,&quot; a moody ballad with trademark- '80s clicking guitars, peppy synths, and a dorky surf guitar solo, is the best song on the record. Wolf nails the quietly urgent tone of the lyrics and delivers probably the most sensitive and sweet vocal of his career. Other highlights are &quot;Baby Please Don't Go,&quot; a bubbling Motown-styled number that sounds very J. Geils-like, the electronic reggae ballad &quot;Poor Girl's Heart,&quot; the Hall &amp; Oates-y &quot;Here Comes That Hurt Again,&quot; and the rollicking &quot;Pretty Lady,&quot; which manages to overcome some annoying background warbling from Mick Jagger to be what would have been one of the best late-period J. Geils songs. The tracks that make the full leap into '80s dance-pop perhaps don't stand up as well. Something like &quot;Oo-We-Diddley-Bop!&quot; is very dated with Wolf gamely trying to rap and coming off like the male Debbie Harry. The jokey &quot;Mars Needs Women&quot; is better only because Jonzun brings in some wacky electro-sounds straight off a Jonzun Crew cut. Wolf's vocal is pretty embarrassing, though. These mis-steps don't really wreck the listening experience; they are so corny that they are almost good. The rest of the record isn't corny at all. It is soul music for a soulless time made by a guy who sounds very glad to be free and ready to hit the charts. That it actually became a hit makes it even sweeter. For sure, Justman and the rest of the J. Geils Band were kicking themselves when their lame Wolf-less album tanked. You should be kicking yourself too if you write this album off as just fluff. It is great fluff, some of the best the '80s had to offer.\n\n1. &quot;Lights Out&quot; (Don Covay, Wolf) - 4:27\n2. &quot;I Need You Tonight&quot; (Peter Bliss, Wolf) - 3:39\n3. &quot;Oo-Ee-Diddley-Bop!&quot; (Michael Jonzun, Wolf, Gordon Worthy) - 4:13\n4. &quot;Gloomy Sunday&quot; (Lazlo Javor, S. Lewis, RezsÅ‘ Seress) - 3:37\n5. &quot;Baby, Please Don't Let Me Go&quot; (Jonzun, Maurice Starr, Wolf) - 4:02\n6. &quot;Crazy&quot; (Jonzun, Wolf) - 3:49\n7. &quot;Poor Girl's Heart&quot; (Jonzun, Wolf) - 3:04\n8. &quot;Here Comes That Hurt&quot; (Jonzun, Wolf) - 3:14\n9. &quot;Pretty Lady&quot; (Jonzun, Wolf) - 3:44\n10. &quot;Mars Needs Women&quot; (Jonzun, Wolf) - 2:41\n11. &quot;Billy Bigtime&quot; (Jonzun, Timothy S. Mayer, Wolf) - 4:40 \n\nNot my rip.. for a friend ","torrent":{"xt":"urn:btih:c32ca72926db0448d6e9d86f16fbf64f8adec274","amp;dn":"PETER+WOLF+-+Lights+Out+%5B1984-Vinyl-Flac-16%2F44.1%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c32ca72926db0448d6e9d86f16fbf64f8adec274","infoHashBuffer":{"type":"Buffer","data":[195,44,167,41,38,219,4,72,214,233,216,111,22,251,246,79,138,222,194,116]},"announce":[],"urlList":[]}}