{"title":"After Dark Series (1-3) by Sadie Matthews [MU]","uid":8442687,"size":5202534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c34e63e2de8b9068d26d00ca69419a5b933a5729&amp;dn=After+Dark+Series+%281-3%29+by+Sadie+Matthews+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1367809666,"description":"After Dark Series (1-3) by Sadie Matthews in PDF, EPUB and MOBI format. \n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com/ \n\nBook 1: Fire After Dark (After Dark #1) by Sadie Matthews July 26th 2012)\n\nA story that will captivate, exhilarate and intoxicate you like no other, perfect for those who loved E. L. James' bestselling Fifty Shades of Grey but were left wanting more...\n\nThe first novel in a provocative romance series that will captivate, exhilarate and intoxicate you like no other, perfect for those who loved the bestselling Fifty Shades of Grey but were left wanting more...\n\nIt started with a spark...\n\nEverything changed when I met Dominic. My heart had just been broken, split into jagged fragments that can jigsaw together to make me look enough like a normal, happy person.\n\nDominic has shown me a kind of abandonment I've never known before. He takes me down a path of pure pleasure, but of pain, too - his love offers me both lightness and dark. And where he leads me, I have no choice but to follow.\n\nDeeply intense and romantic, provocative and sensual, FIRE AFTER DARK will take you to a place where love and sex are liberated from their limits.\n\nFans of E. L. James and Sylvia Day will find themselves kept awake late into the night with FIRE AFTER DARK...\n\nBook 2: Secrets After Dark (After Dark #2) by Sadie Matthews (November 22nd 2012)\n\nBeth and Dominic embarked on the most intensely sexual and emotional relationship of their life in FIRE AFTER DARK - the first novel in Sadie Matthews' erotic romance series. Now SECRETS AFTER DARK will take you one step closer to the bittersweet edge of passion: the perfect read for fans of Fifty Shades of Grey by E. L. James, Sylvia Day and Nikki Gemmell.\n\nOurs was a love bound by power...\n\nFalling in love with Dominic changed me. I relinquished myself completely and placed my heart and my trust in Dominic's hands, but in one exquisite, excruciating moment he abandoned his control. Anguished by his actions, he has locked those darkest desires inside, unable to share my conviction that it would never happen again.\n\nNow it's not only Dominic who craves that delicate, seductive game of give and take, of walking the line between pain and pleasure, abandon and release. Persuading Dominic to let those secret parts of himself unravel will be the biggest risk I've ever taken, but I can't resist. Even if it means we fall apart...\n\nProvocative and sophisticated, exhilarating and seductive, the AFTER DARK series is a compelling pleasure we should all indulge in . . .\n\nBook 3: Promises After Dark (After Dark #3) by Sadie Matthews (February 28th 2013)\n\nIntensity, sensuality, and seduction awaits in the final part of the provocative romantic AFTER DARK trilogy that has left readers longing for more. \n\nCan a fractured love be salvaged?\n\nParting with Dominic has left me broken in a way I could never have imagined. We held elation in the palm of our hands, but one misunderstanding brought it crashing down around us. Now the hurt and sadness follows me like a shadow and makes choosing the right path to take impossible. \n\nBut one moment with him and the pulsing heat is singing in my blood again; his touch lights a fire that my body refuses to ever forget. I'm hopelessly lost in him. Finding our way back to one another will take trust and a leap of faith - only then we will know whether we have a chance at forever.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:c34e63e2de8b9068d26d00ca69419a5b933a5729","amp;dn":"After+Dark+Series+%281-3%29+by+Sadie+Matthews+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34e63e2de8b9068d26d00ca69419a5b933a5729","infoHashBuffer":{"type":"Buffer","data":[195,78,99,226,222,139,144,104,210,109,0,202,105,65,154,91,147,58,87,41]},"announce":[],"urlList":[]}}