{"title":"Coast to Coast AM May 12, 2013 - Present Shock","uid":8472349,"size":59265169,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c46e3594cd725bf681964941dc2225420f29c2c2&amp;dn=Coast+to+Coast+AM+May+12%2C+2013+-+Present+Shock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1368517133,"description":"Coast to Coast AM for May 12, 2013. Present Shock\n\nNote: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nHost: Ian Punnett\n\nDouglas Rushkoff\n has been an authority on the intersection of technology and culture since before the word &quot;google&quot; was anything more than baby talk. He joined Ian Punnett\n(\nTwitter)\nto discuss what he calls &quot;present shock,&quot; the idea that we have a completely new relationship to time; we live in an always-on &quot;now,&quot; where the priorities of this moment seem to be everything. For many, their constant devotion to electronic devices and social networks has become the new now, as they chase the moment they offer, and &quot;forget that we human beings are the ones in real time, and these devices are chasing us,&quot; he said. But this digital chaos we find ourselves in today is really just the latest incarnation of an ancient battle between Kronos (clock time) and Kairos (personal time), Rushkoff observed.\n\n\nAll the data on our screens can end up disempowering us, he commented. &quot;When we're chasing those tweets, we're really just falling prey to many different corporations who have very different designs on our data than we might. We're living a life where everything we do can be traced, where it can be understood by Big Data analysis, and then predicted or even guided to more commercial ends,&quot; Rushkoff lamented. He also addressed &quot;digiphrenia,&quot; a term he used to describe how with digital technology people have multiple 'incarnations' that exist simultaneously, such as withTwitter, and email, and they can lose track of who they are. &quot;There's this sense with digital technology that all time is somehow generic, that every moment is like every other... and that makes us incoherent, especially because our bodies are living in a biological place,&quot; he argued. \n\nOur bodies are more like an analog clock than a digital one. Digital time is just a number, and is not the way the body moves through time-- that's why people end up so disjointed, he continued. Rushkoff did cite some cultural advantages to &quot;present shock,&quot; such as mash-ups in which, for instance, two songs from different eras might be mixed together. &quot;Instead of getting the same time from multiple places, you end up really getting the same place in different times,&quot; he remarked. \n\nJordan Codices Update\n\nFirst hour guest, professor, author and researcher, \nKen Hanson,\nshared an update on the purported ancient metal tablets known as the  Jordan Codices.\nThe authenticity of the find has been questioned by many experts in the field, including Hanson, who pointed out that the hodgepodge of repeated 'Paleo-Hebrew' letters stamped into the tablets seem to make little sense. Dr. Margaret Barker, a respected biblical scholar, recently published an article (\nPDF file)\nin which she acknowledges that while part of the find is likely fraudulent, other elements of the Codices may indeed be authentic relics dating back to the first century AD. \n\nWebsite(s):\nrushkoff.com\ntreasuresintime.org\nBook(s):\n Present Shock\n Blood Kin of Jesus\n The Eagle and the Bible\n","torrent":{"xt":"urn:btih:c46e3594cd725bf681964941dc2225420f29c2c2","amp;dn":"Coast+to+Coast+AM+May+12%2C+2013+-+Present+Shock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46e3594cd725bf681964941dc2225420f29c2c2","infoHashBuffer":{"type":"Buffer","data":[196,110,53,148,205,114,91,246,129,150,73,65,220,34,37,66,15,41,194,194]},"announce":[],"urlList":[]}}