{"title":"The Great Jazz Trio - 1988 - Standard Collection Vol. 1 FLAC","uid":8476713,"size":276909119,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6024bbdbe6f9e725d8f89a9dd4b8a364931a41d&amp;dn=The+Great+Jazz+Trio+-+1988+-+Standard+Collection+Vol.+1+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eika256","files":-1,"time":1368631001,"description":"The Great Jazz Trio - 1988 - Standard Collection Vol. 1 - Summertime\n\nHank Jones has been known to be a quintessential sideman and occasional leader during his lengthy career as a premier jazz pianist. His most frequent project has been as the ostensible leader of the co-op group known as the Great Jazz Trio, a classic example of how the piano-bass-drums format has remained timeless, enduring, and ever challenging. Formed in the spring of 1975, the initial threesome performed together for the first time at the Village Vanguard nightclub in New York City for one week, was given its name by owner Max Gordon, and consisted of Jones, drummer Tony Williams, and bassist Ron Carter. These musicians from three generations with ties to Miles Davis formed a unique bond playing standards and originals of each bandmember. The trio got together again in May of 1976, and this time headed for a studio to record an album with Japanese alto saxophonist Sadao Watanabe, resulting in the album I'm Old Fashioned. In February of 1977 the trio was again booked in the Village Vanguard for a week, and they recorded three days of the extended engagement, making several live volumes of their music available on vinyl for the Japanese based East Wind label, issued in the U.S. on Inner City. Concurrent studio efforts including Love for Sale (1976,) Kindness, Joy, Love &amp; Happiness, and Direct from LA (1977,) and Milestones (1978) cemented the reputation of the original combo. The Japanese continued their interest in booking the group for concert tours, and documenting the music of the GJT, with many more releases on East Wind and Denon only available as imports in the new CD era up to 2008, with another string of Great Standards, Vol. I-V for Alfa Jazz. Many of the recordings used cover art surrounding Major League Baseball images, especially action photos with the Boston Red Sox (Williams was born in Boston, as opposed to Metro-Detroiters Jones and Carter) the most famous being pitcher Roger Moret on the cover of the 1978 LP At the Village Vanguard. Since the passing of Tony Williams and Ron Carter's increased interest in a solo career, the personnel of the Great Jazz Trio has changed, but Hank Jones has always spearheaded the effort. Among some of the partners the pianist has employed; bassists Buster Williams, Eddie Gomez, John Patitucci, and Richard Davis, along with drummers Al Foster, Elvin Jones, and Jack DeJohnette. The band in one configuration or another has lasted over four decades, recording on average one album per year. (AllMusic)\n\nTrack list:\n01 - After You've Gone\n02 - Summertime\n03 - The Days Of Wine and Roses\n04 - As Time Goes By\n05 - You'd Be So Nice To Come Home To\n06 - Summer Knows\n07 - Georgia On My Mind\n08 - Prelude To A Kiss\n09 - St. Louis Blues\n10 - Danny Boy\n\nEnjoy and share!","torrent":{"xt":"urn:btih:c6024bbdbe6f9e725d8f89a9dd4b8a364931a41d","amp;dn":"The+Great+Jazz+Trio+-+1988+-+Standard+Collection+Vol.+1+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6024bbdbe6f9e725d8f89a9dd4b8a364931a41d","infoHashBuffer":{"type":"Buffer","data":[198,2,75,189,190,111,158,114,93,143,137,169,221,75,138,54,73,49,164,29]},"announce":[],"urlList":[]}}