{"title":"Egg Hunt - Two Songs (1986)","uid":8442988,"size":15894965,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c7f8c173e0f6f55e3ffd59883bc2aa0cd4efefdf&amp;dn=Egg+Hunt+-+Two+Songs+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GGPriest","files":3,"time":1367816801,"description":"Dischord 020\n\nEgg Hunt - Two Songs (1986)\n\nMp3 - 320 kbps (downloaded from http://www.dischord.com)\n\nFrom Wiki:\nEgg Hunt was a one-off band/project of long time friends and musicians Ian MacKaye and Jeff Nelson, former singer and drummer of the hardcore punk band Minor Threat, respectively. During a 1986 trip to England's Southern Studios to discuss possible European distribution of Dischord releases with owner John Loder, the three decided to make a record together, and the project was dubbed &quot;Egg Hunt&quot; for festive reasons (it was Easter time). John took a seat in the producer's chair, while Ian and Jeff handled all the instruments.\n\nEgg Hunt's only release, a self-titled 7&quot;, was, according to reviewer Ron DePasquale, an example of &quot;experimental, post-hardcore&quot; music.[1] The song &quot;We All Fall Down,&quot; appearing on the second side, was a song that Ian had originally written for his earlier band, Embrace, but it was discarded by that band. Although seemingly a small release in comparison to Dischord's significant catalog, this record is still a notable example of MacKaye and Nelson's songwriting abilities, as well as their chemistry together as artists.\n\nThey liked the project so much that they tried turning Egg Hunt into an actual band after returning to Washington, DC. They recruited former Gray Matter members Steve Niles and Geoff Turner, but Ian's energy and creativity were soon directed toward the forming of Fugazi, while Jeff, Geoff, Steve, and former Gray Matter guitarist Mark Haggerty started the Dischord band, Three.\n\nTrack Listing:\n1. &quot;Me and You&quot; (3:48)\n2. &quot;We All Fall Down&quot; (2:48)\n","torrent":{"xt":"urn:btih:c7f8c173e0f6f55e3ffd59883bc2aa0cd4efefdf","amp;dn":"Egg+Hunt+-+Two+Songs+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f8c173e0f6f55e3ffd59883bc2aa0cd4efefdf","infoHashBuffer":{"type":"Buffer","data":[199,248,193,115,224,246,245,94,63,253,89,136,59,194,170,12,212,239,239,223]},"announce":[],"urlList":[]}}