{"title":"POtHS - End Times - 38 - USA and End Times Prophecy","uid":8357859,"size":8914311252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8661b00161313bf4cdc96614f451b89eb80c29c&amp;dn=POtHS+-+End+Times+-+38+-+USA+and+End+Times+Prophecy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1365537748,"description":" PO t HS\n\nPouring Out the Holy Spirit\n\n\nEnd Times\n\nVolume 38\nUSA and End Times Prophecy\n\nHe is coming for his Bride soon.\n\n\n\nPOtHS - End Times - 38 - USA and End Times Prophecy\n\n\nPOtHS Comment:    Do you think The Wrath of God is coming to America\n\nDescription\n\nEx-Public School Principal Warns Christian Parents:\n&quot;Karl Priest: Calling for a mass exodus out of public schools.&quot; CHARLESTON, W.Va. -- The latest news says it succinctly:  &quot;Startling numbers released today rank West Virginia one of the worst for education in the country&quot; and &quot;West Virginia received one of the worst education rankings in the country.&quot;  This demonstrates the extreme con job that has condemned government-schooled students to downright dumminess.  Perhaps the state, like Kanawha County, should institute more Yoga into the system.\n\nThe Nation's Report Card on science scores revealed that only about one-fourth of West Virginia students have a good understanding of science.   Only people engrossed with American Idol will fall for the farce, put out by school officials, that progress is being made.  Making sure that students are thoroughly indoctrinated in evolution has only escalated the serious problem.\n\nBut, lousy academic performance is not the main thing that should alarm West Virginia parents.  Since retiring from teaching, I have documented (using secular sources) the dangers that prevail in &quot;public&quot; schools.  (See http://www.insectman.us/exodus-mandate-wv/wv-news.htm.)  One can easily follow common threads of drugs, sex (including teachers with students and promotion of sexual perversion), lack of disciple, violence, poor academic standards, crime, anti-Christianity, and wanting more and more money.\n\nSpeaking of money, the West Virginia Kid's Count and Casey Foundation, which produced the latest study, may have their hearts in the right place, but their heads are still in the clouds.  Money is not the answer.  The aforementioned two groups want more child care.  If private money is used, that is none of my concern.  If public money is used (including for charter and smaller government schools) then I strongly object.\n\nThe government needs to get out of education and let the free enterprise system work.  No one wants the government to tell them they must eat at limited government-run restaurants.  The same logic applies to education.  Charter schools are simply like putting a dog on a longer leash.  The dog still is not free to run.\n\nLiberals will not listen.  Conservatives are too tied to the Republican Party, which is simply (as a friend says) the &quot;opposite wing of the same bird flying in the wrong direction.&quot;  The simple solution is for Christian parents to lead a mass exodus out of government schools.  That will start a domino-effect downfall of this definite deception commonly called &quot;public&quot; schools.  If it does not happen, the headlines will be the same (or worse) as more test reports are released.\n--------------------------------------------------------------------------------------------------------------------\n\nAmerican Public is Treated as An Enemy of the State - Daniel Ellsberg on tyranny and the NDAA:\nOn February 6, 2013, a three-judge panel heard arguments on the indefinite detention clause of the 2012 National Defense Authorization Act.\n(NDAA)\n\nThe act would allow the U.S. military to indefinitely detain anyone who provides &quot;substantial support&quot; to the Taliban, al-Qaeda or &quot;associated forces,&quot; including &quot;any person who has committed a belligerent act&quot; in the aid of enemy forces.\n\nAccording to the attorney for the case, Hedges v. Obama will decide whether the United States will have a civil justice system or a military justice system.\n\nThe civil justice system is ingrained in the Constitution and is integral in combating tyranny and building a democratic society.\n\nThe NDAA attempts to impose a system of military justice that allows the military to police the streets of America, to detain US residents in military prisons, and allows detention of citizens 'until the end of hostilities.'\n\nUntil the end of Hostilities?\n\nWe are now on day 4,163 of an open-ended war against al-Qaeda.\n\nLegendary whistleblower, and author of the book &quot;Secrets: A Memoir of Vietnam and the Pentagon Papers&quot; Daniel Ellsberg speaks about the NDAA, the erosion of civil liberties, and the rapid rise of tyranny in the US.\n\nHe is joined by one of the lawyers for the case, Carl J. Mayer of Mayer Law Group LLC.\n------------------------------------------------------------------------------------\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:c8661b00161313bf4cdc96614f451b89eb80c29c","amp;dn":"POtHS+-+End+Times+-+38+-+USA+and+End+Times+Prophecy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8661b00161313bf4cdc96614f451b89eb80c29c","infoHashBuffer":{"type":"Buffer","data":[200,102,27,0,22,19,19,191,76,220,150,97,79,69,27,137,235,128,194,156]},"announce":[],"urlList":[]}}