{"title":"Gag.Reflex.Disc1+2.XXX.DVDRiP.x264-PORNOLATiON","uid":8384889,"size":3609448194,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ccaff1dcc2782f01ebc73583b6311de27df1757c&amp;dn=Gag.Reflex.Disc1%2B2.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":2,"time":1366262512,"description":"Gag Reflex Disc1 XXX DVDRiP x264-PORNOLATiON\nGag Reflex Disc2 XXX DVDRiP x264-PORNOLATiON\n\nStarring : Allie Haze, Skin Diamond, Prince Yahshua, Jynx Maze, Adrianna Nicole, Jonni Darkko, Cameron Canada, Winston Burbank, Keni Styles, Bailey Blue, Gabriella Paltrova, Heather Vahn, Mia Rider, Aria Salazar, Bobby Blam, Lena Charlotte Westby \n\nStarring Heather Vahn! 11 Sluts chocking On Cock! Orally obsessed director Jonni Darkko tests the Extreme Deep-throat Capabilities of 11 gorgeous cocksuckers in 'Gag Reflex,' a double-disc celebration of dick-swallowing virtuosity that might leave fans of nasty face fucking and cock worship a little choked up. In nine sensual scenes of alluring POV glamour and full-on, hard-core filth, Jonni's girls lovingly throbbing cocks with their talented lips and tongues, slobbering, sucking and, yes, gagging - until the lucky prick can no longer hold back from splattering Their stunning faces with messy Masses of Sperm! Tattooed Skin Diamond Black goddess buzzes her Pussy to Orgasm while slurping hungrily on Dick one after another. Petite, fun-loving Asian MILF Mia Rider services the director's pole until he delivers a massive cum facial. Frisky girlfriends Jynx Maze and Gabriella Paltrova enjoy a lewd blow job threesome with some big strap-on action as well. Sultry Latina Heather Vahn New Shows off her breasts, then sucks Winston Burbank's giant tool until her perfect Makeup has rendered Been A Saliva-smeared, dripping splooge-Wreck! She Tongues Jonni's Dick and taint to earn another coating of goo. Exquisite black teen Aria Arial works her mouth magic on Prince Yahshua's huge black shaft, and sassy blonde workout partners Bailey Blue and Cameron Canada swap drool and lap testicles while throating the director's dick. Don't miss kinky Adrianna Nicole, adorable Allie Haze and sexy, bespectacled punkette Luna C. Kitsuen. The intense blowjobbery in Jonni 'Gag Reflex' is sure to elicit an involuntary response!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=tdoyk5apdvz2joqi7hwz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=tdoyk5apdvz2joqi7hwz.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ymcmkiiig2mmh3c5puvf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ymcmkiiig2mmh3c5puvf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3m0rf9pjn6s5dtzouerk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3m0rf9pjn6s5dtzouerk.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ccaff1dcc2782f01ebc73583b6311de27df1757c","amp;dn":"Gag.Reflex.Disc1%2B2.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccaff1dcc2782f01ebc73583b6311de27df1757c","infoHashBuffer":{"type":"Buffer","data":[204,175,241,220,194,120,47,1,235,199,53,131,182,49,29,226,125,241,117,124]},"announce":[],"urlList":[]}}