{"title":"FEZ v1.04 (2-click run)","uid":8441186,"size":328078492,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd32e17cd5ae9752ad2069e7180062f3a9e6a9aa&amp;dn=FEZ+v1.04+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1367774999,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nFez the long-awaited PC-version of the brilliant platformer from Polytron Corporation, in which a two-dimensional creature named Gomez learns about the existence of the third dimension!\n\nSystem Requirements:\nOS: Windows XP SP3 or higher\nPROCESSOR: Intel Core 2 Duo 2.8Ghz or equivalent\nMEMORY: 2 GB RAM\nHDD SPACE: 500 MB HD space\nVIDEO: NVIDIA GeForce 9600 or ATI Radeon HD 2900 GFX\nSOUND :OpenAL-compatible\n\nsion 1.04\n------------\n- Tentative fix for missing world map icons on Intel HD Graphics 3000 and 4000 cards\n- Added experimental CLI flag for variable timestep (--variable-time-step), may break game physics, try at your own risk!\n- Fixed possible crash during loading screens\n- Fixed window scaling problem when using higher Windows DPI settings\n- Fixed leaderboard crash with unmapped characters in usernames\n- Game no longer forces 1280x720 resolution on first run if it's not supported\n- Sound effect volume setting now applied when starting game\n- Fixed possible crash with music buffering\n- Fixed problem where doors would remain closed forever after exiting or crashing out of a level\n- Tentative fix for invisible pages in tome\n- Number of anti-cubes now capped at 32, if you somehow manage to find 33!\n\nVersion 1.03\n------------\n- Fixed crash-on-load errors for systems with Turkish regional settings\n- Fixed possible crash when accessing video settings\n- Fixed wrong letterboxing when going fullscreen with some 16:9 resolutions\n\nVersion 1.02\n------------\n- Fixed memory leak for OpenAL buffers and sources\n- Fixed music-related crash in all puzzle rooms with the &quot;Knowledge&quot; music track\n- Fixed &quot;invalid entry point&quot; error when changing resolution or exiting the game with older OpenGL GPUs\n\nVersion 1.01\n------------\n- Fixed random crash issue when starting a new game","torrent":{"xt":"urn:btih:cd32e17cd5ae9752ad2069e7180062f3a9e6a9aa","amp;dn":"FEZ+v1.04+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd32e17cd5ae9752ad2069e7180062f3a9e6a9aa","infoHashBuffer":{"type":"Buffer","data":[205,50,225,124,213,174,151,82,173,32,105,231,24,0,98,243,169,230,169,170]},"announce":[],"urlList":[]}}