{"title":"Spam: A Shadow History of the Internet (Infrastructures)","uid":8476115,"size":2152641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce34f628766aa720ed4d4104b8bdac24a2f84433&amp;dn=Spam%3A+A+Shadow+History+of+the+Internet+%28Infrastructures%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":1,"time":1368616404,"description":"The vast majority of all email sent every day is spam, a variety of idiosyncratically spelled requests to provide account information, invitations to spend money on dubious products, and pleas to send cash overseas. Most of it is caught by filters before ever reaching an in-box. Where does it come from? As Finn Brunton explains in Spam, it is produced and shaped by many different populations around the world: programmers, con artists, bots and their botmasters, pharmaceutical merchants, marketers, identity thieves, crooked bankers and their victims, cops, lawyers, network security professionals, vigilantes, and hackers. Every time we go online, we participate in the system of spam, with choices, refusals, and purchases the consequences of which we may not understand. This is a book about what spam is, how it works, and what it means. Brunton provides a cultural history that stretches from pranks on early computer networks to the construction of a global criminal infrastructure. The history of spam, Brunton shows us, is a shadow history of the Internet itself, with spam emerging as the mirror image of the online communities it targets. Brunton traces spam through three epochs: the 1970s to 1995, and the early, noncommercial computer networks that became the Internet; 1995 to 2003, with the dot-com boom, the rise of spam's entrepreneurs, and the first efforts at regulating spam; and 2003 to the present, with the war of algorithms -- spam versus anti-spam. Spam shows us how technologies, from email to search engines, are transformed by unintended consequences and adaptations, and how online communities develop and invent governance for themselves.\n &lt;a href=&quot;\nhttp://www.amazon.com/Spam-Shadow-History-Internet-Infrastructures/dp/026201887X/ref=sr_1_3?ie=UTF8&amp;qid=1368608882&amp;sr=8-3&amp;keywords=spam&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Spam-Shadow-History-Internet-Infrastructures/dp/026201887X/ref=sr_1_3?ie=UTF8&amp;qid=1368608882&amp;sr=8-3&amp;keywords=spam&lt;/a&gt;","torrent":{"xt":"urn:btih:ce34f628766aa720ed4d4104b8bdac24a2f84433","amp;dn":"Spam%3A+A+Shadow+History+of+the+Internet+%28Infrastructures%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce34f628766aa720ed4d4104b8bdac24a2f84433","infoHashBuffer":{"type":"Buffer","data":[206,52,246,40,118,106,167,32,237,77,65,4,184,189,172,36,162,248,68,51]},"announce":[],"urlList":[]}}