{"title":"Pocket Rally v1.0.1","uid":8482774,"size":25693288,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:cfd96c10a102bd403794dbf5fe741416af5174b4&amp;dn=Pocket+Rally+v1.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":-1,"time":1368776506,"description":"\nPocket Rally is an attempt to combine the best of both old school rally racing games and smart device experiences. Stunning visual graphics, realistic yet fun to drive car physics, all in the palm of your hand. Take the rally racing anytime, anywhere with you!\n\nFeatures:\n\n* Highly detailed and precisely made car models, beautiful and visually convincing racing tracks located in various spectacular sceneries including mountains, coastline and ancient city ruins.\n\n* Carefully tuned car physics to be both realistic and fun. Multiple ground surface properties including tarmac, gravel and grass. Each car has unique driving characteristics, and will evolve through the winning of races.\n\n* 4 control modes and 3 camera angles (in-game toggleable) to choose from.\n\n* Strength adjustable AI opponents. Up to 4 cars can race simultaneously in a game.\n\n* Introducing the Replay Mode. Performed a perfect power drift doing a hairpin turn and want to show your friends? Too occupied in the competition not able to admire your own driving technique and want to see it later? Replay Mode is the answer for you! The replay cameras are tailored for each track, recording the whole event from best angles and play it back for you.\n\n* 2 main game modes to play: Challenge mode and Single Race mode. Additional cars and tracks can be unlocked by winning challenges and to be chosen in Single Race mode.\n\n* Pocket Rally only requires a 24+ MB download. Hi-end devices are not required to run the game smoothly. The loading is so fast it's literally seconds between launching the APP and grabbing your driving wheel! Rally racing whenever you like, wherever you like!\n\nCurrently there are 4 legendary rally cars, 4 tracks (including forward/reverse direction) and 30 Challenge mode events in the game, with many more to come!\n\nWhat's in this version:\nV1.0.1 (2013/05/14)\n- Graphics fix.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.IMStudio.PocketRally&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.IMStudio.PocketRally&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cfd96c10a102bd403794dbf5fe741416af5174b4","amp;dn":"Pocket+Rally+v1.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd96c10a102bd403794dbf5fe741416af5174b4","infoHashBuffer":{"type":"Buffer","data":[207,217,108,16,161,2,189,64,55,148,219,245,254,116,20,22,175,81,116,180]},"announce":[],"urlList":[]}}