{"title":"Wheat - White Ink, Black Ink [2009] [Album][EAC,log,cue. FLAC]","uid":8465156,"size":229322985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d4c8c86f390a00c6b30be13946ff88a85f1211a1&amp;dn=Wheat+-+White+Ink%2C+Black+Ink+%5B2009%5D+%5BAlbum%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":13,"time":1368338757,"description":"Artist: Wheat\nRelease: White Ink, Black Ink\nReleased: 2009\nLabel: Rebel Group\nCatalog#: RBG 0134\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: rock\n\n\n\n1. H.O.T.T. 2:31\n2. Change Is 3:55\n3. My Warning Song (Everything Is Gonna Be Alright) 3:08\n4. El Sincero 3:00\n5. Living 2 Die Vs. Dying 2 Live 3:06\n6. If Everything Falls Together 2:52\n7. Music Is Drugs 4:45\n8. Coke And Tanqueray 0:33\n9. Two Mountains 3:45\n10. I Want Less 4:05\n11. Baby In My Way 2:04\n\nWheat are more about flux than stasis. Since releasing its first album in 1998, the Massachusetts group has been tinkering restlessly with its sound and lineup to the degree that each new album heralds a new approach and a new band. As a result, there is no straight line of development from Wheat's debut through their most recent efforts, but rather a jagged trajectory tracing their exploration of the frayed edges of pop songcraft. So it's no surprise that their fifth full-length, White Ink, Black Ink, proves so markedly different from 2007's Every Day I Said a Prayer for Kathy and Made a One Inch Square, just as that album was worlds removed from its predecessor, 2003's Per Second Per Second Per Second... Every Second, whose streamlined sound made it a fan favorite. If the sonic contortions of One Inch Square lost the band some listeners (especially after a four-year wait), then White Ink, Black Ink might bring them back: It may not be start-to-finish consistent, but it is much more focused and straightforward.\nSinger Scott Levesque and drummer Brendan Harney-- who switch up instruments often enough that those titles are almost meaningless-- emphasize rhythm and texture on these songs, which gives the album a straight through-line that suggests the pop sensibility of Per Second sucked through the clatter of One Inch Square. Opener &quot;H.O.T.T.&quot; layers several live and programmed beats over each other to create a strange and steady groove that plays up Levesque's all-chorus songwriting even as it acknowledges that the band's ever-changing sound may alienate some listeners: &quot;Half of the time I feel broke, cracked, peeled, weathered,&quot; Levesque sings. &quot;Half of the time I feel shiny and new.&quot;\n&quot;Changes Is&quot; similarly emphasizes forward motion and Levesque's self-commentary, fashioning a statement on the band's mercurial nature into the album's catchiest hook and bounciest beat. &quot;I Want Less&quot; rallies around quick bursts of snare drum hits and high-hat clicks, as if Harney were playing each part of his drum kit separately, yet that sound gathers unexpected momentum as it pushes the song along at a weird clip. Wheat may sound more direct here, but never predictable. &quot;My Warning Song&quot; sets up a series of seemingly unconnected elements-- a continually unfolding guitar riff, a choir, a simple drum tattoo, Levesque singing, &quot;Everything is going to be alright,&quot; over and over-- yet their modularity is the point, and in the end they all cohere into one of the best and most naturally dramatic moments on the album.\nLevesque and Harney repeat no trick on White Ink, Black Ink, no matter how well it may work the first time around. That reluctance to linger makes for a concise album, and part of the album's appeal is hearing them find new ways to sound like themselves. These songs are dense with ideas, some intriguing and others not so much. The thirty-second &quot;Coke and Tanqueray&quot;, for example, aims for the evocative brevity of a haiku, but sounds more like a wisp of a breeze of a song. Closer &quot;Baby in My Way&quot; opens with Levesque singing excitedly over a simple piano theme, creating a nicely spare moment that lets the album exhale a bit, but it soon settles into a string section before fading out prematurely, ending the album on a puzzling but not unpleasant note. Wheat flirt with cursoriness on White Ink, Black Ink, which seems overly compact at times, but they've come back around to the simple pleasures of verses and choruses-- and sound all the better for it.","torrent":{"xt":"urn:btih:d4c8c86f390a00c6b30be13946ff88a85f1211a1","amp;dn":"Wheat+-+White+Ink%2C+Black+Ink+%5B2009%5D+%5BAlbum%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4c8c86f390a00c6b30be13946ff88a85f1211a1","infoHashBuffer":{"type":"Buffer","data":[212,200,200,111,57,10,0,198,179,11,225,57,70,255,136,168,95,18,17,161]},"announce":[],"urlList":[]}}