{"title":"One Piece 720p E590 x Toriko E099 &amp; Dragon Ball Z Crossover","uid":8360314,"size":190625516,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d65f3f22e6ccf87904d9e781aabd4ccf9e360d71&amp;dn=One+Piece+720p+E590+x+Toriko+E099+%26amp%3B+Dragon+Ball+Z+Crossover+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"santeros","files":-1,"time":1365606632,"description":"Part 1\nThe International Gourmet Organization (IGO) is hosting a World's Best Eating Tournament (Tenkaichi ShokuMkai), a merciless race with no rules, on a certain island. The tournament's championship prize is the luxuriously rare Carat Sizzled Cattle. Toriko and his friends are aiming for the championship, Luffy and his Straw Hat Crew is set to participate in the event as well, and Goku and his friends are also contestants. The showdown may determine the strongest of the three franchises' leads.\nThe special also features the following cast of characters: Sunny, Zebra, Coco (the &quot;Four Heavenly King&quot; Gourmet Hunters), Komatsu, Rin, Setsuno, Tina from Toriko, Nami, Chopper, Sanji, Zoro, Franky, Brook, Robin, Usopp, Pandaman from One Piece, and Gohan, Goten, Trunks, Master Roshi, Android 18, Vegeta, Piccolo, Krillin, Ox-King, Yajirobe, Korin, the World Tournament Announcer, Mr. Satan from Dragon Ball Z.\n\nPart 2\nMr. Satan wins the competition and when the champion serves up the championship prize, Carat Sizzled Cattle, to Luffy, Toriko, Goku, and their friends, the IGO Director Mansam reveals the shocking truth: the tournament was held in order to lure out a Deep Sea Glutton creature, Akami, said to suck out the energy of living things. Soon, sensing Luffy and the other's power, Akami appears from out of the depths of the sea. Goku, Luffy, Toriko may have to combine their powers in order to defeat this deadly monster.\n\nTitle Part 1: Run, Strongest Team! Toriko, Luffy, and Goku!\nTitle Part 2: The Mightiest Collaboration in History vs. the Gluttonous of the Sea\nAudio : Japanese\nSubtitles : English\nResolution : 720p\nRatio : 16:9\nSaiz : 181Mb\n\nBest Watch using MPC-Home Cinemas\n\n\nPlease comment my anime. Re-encode to m-HD, re-sub(softsub) and re-sync the anime.","torrent":{"xt":"urn:btih:d65f3f22e6ccf87904d9e781aabd4ccf9e360d71","amp;dn":"One+Piece+720p+E590+x+Toriko+E099+%26amp%3B+Dragon+Ball+Z+Crossover+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65f3f22e6ccf87904d9e781aabd4ccf9e360d71","infoHashBuffer":{"type":"Buffer","data":[214,95,63,34,230,204,248,121,4,217,231,129,170,189,76,207,158,54,13,113]},"announce":[],"urlList":[]}}