{"title":"Twilight Man (First Comics)","uid":8446320,"size":73531220,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d6cd9ed0459800bbee7d5c4d6c473b7c5f37fd1d&amp;dn=Twilight+Man+%28First+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ichthypod_Crane","files":5,"time":1367897601,"description":"Our next FCUP is 'Twilight Man', a four-issue mini from Steven Grant and Tristan Schane.\n\nAfter a nuclear explosion tears a rift between dimensions, the Tyrant Gods seek to return to Earth. In an interview, Mr. Grant said of Twilight Man, &quot;I'd done TWILIGHT MAN at First, essentially an attempt to modernize the sword-and-sorcery genre, which I've always had a soft spot in my head for but which is generally dismissed, not without reason. (TWILIGHT MAN is itself a lost story, the published version being nothing like what I'd originally planned, except for the second issue that reconfigured the Great God Pan as an incestuous child molester; that alone survived more or less intact from the original version. What never saw print was a savage critique of Reagan administration policies, which is what the book was really about.)&quot;\n\n\nEach of my First Comics uploads contains a .txt file called 'First Missing'. If you have ANY of the scans listed, please contact me at the listed email. I want to make these uploads as complete as possible. Thanks!\n\nThanks to the creators and scanners! Keep it alive, please!","torrent":{"xt":"urn:btih:d6cd9ed0459800bbee7d5c4d6c473b7c5f37fd1d","amp;dn":"Twilight+Man+%28First+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cd9ed0459800bbee7d5c4d6c473b7c5f37fd1d","infoHashBuffer":{"type":"Buffer","data":[214,205,158,208,69,152,0,187,238,125,92,77,108,71,59,124,95,55,253,29]},"announce":[],"urlList":[]}}