{"title":"Pieces of Lies Series (1-2) by Angela Richardson [MU]","uid":8485663,"size":3245923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d98baa6fd400de69f2673ec9e53a3956c23dcf1a&amp;dn=Pieces+of+Lies+Series+%281-2%29+by+Angela+Richardson+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1368853111,"description":"Pieces of Lies Series (1-2) by Angela Richardson in PDF, EPUB and MOBI format.\n\n\nFor ebook devices use an ebook converter like:\nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter\nCalibre - http://calibre-ebook.com/download\nOnline - http://ebook.online-convert.com\n\nPieces of Lies (Pieces of Lies #1) by Angela Richardson (January 7th 2013)\n\nPassionately driven artist, Norah Ross, has been banished from New York to Morewell for her final semester of graphic design at McLaren University. Her move allows her to reconnect with Josh, her best friend, who is more then thrilled at Norah's appearance back into his life.\n\nAt the same time that Norah steps back into Josh's heart, she learns that he is in the process of being accepted into McLaren's uber exclusive secret society, the 'Lappell'. Josh takes Norah to the Lappell's glamorous parties in the hope of taking their friendship to the next level, but when Norah meets the handsome and elusive Clint Weston, a leader in the Lappell, he sweeps her off her feet in more ways then one.\n\nNorah quickly becomes caught up in an emotional tug-of-war between the two guys while also trying to deal with her own secrets that follow her every day. When Norah's past begins to intertwine with her present, what unfolds is a series of dramatic events filled with romance, mystery and dark motivations. She quickly realizes the path to real love can be paved in all kinds of lies.\n\nPieces of Truth (Pieces of Lies #2) by Angela Richardson (May 15th 2013)\n\nIn the sequel to Pieces of Lies, we follow Norah and Clint to New York, the playground for the Lappell and Big Joe.\n\nFrom the outside, everything looks great for Norah and Clint. They have a new apartment, new jobs, a new life. Everything looks perfect... or is it?\nLeaving Morewell was a big step for the couple, but for Norah, she moved with the knowledge that there could be more secrets Clint could be keeping, more deception that could bring her whole world crashing down. She took the step knowing the truth would be lurking in the shadows, waiting for her to find it. Will the truth find Norah or will she find the truth?\n\nIn this story, relationships will be tested, old feelings will surface, secrets will be revealed and emotions will run high. By the end, Norah will have chosen her love, but at what price?\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:d98baa6fd400de69f2673ec9e53a3956c23dcf1a","amp;dn":"Pieces+of+Lies+Series+%281-2%29+by+Angela+Richardson+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98baa6fd400de69f2673ec9e53a3956c23dcf1a","infoHashBuffer":{"type":"Buffer","data":[217,139,170,111,212,0,222,105,242,103,62,201,229,58,57,86,194,61,207,26]},"announce":[],"urlList":[]}}