{"title":"BitDefender Internet Security 2013 Build 16.18.0.1407 Final","uid":8437791,"size":511967510,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d9dc3801a0f7262e335cc3123e83f67f99559d42&amp;dn=BitDefender+Internet+Security+2013+Build+16.18.0.1407+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1367684041,"description":"BitDefender Internet Security 2013 Build 16.18.0.1407 Final (x86/x64)-2010kaiser\n================================================================================\n\n\n\nBitDefender Internet Security 2013 is a security suite designed to provide your computer with the latest technologies against viruses and other virtual enemies.\n\nBitdefender Safepay - Keeps hackers at bay by automatically opening all your online banking pages in a separate, secure browser.\n\nMyBitdefender dashboard - See all the status and licensing information about your software and services.\n\nSecurity Widget - Enables you to keep track of all of your security related tasks, drag-and-drop files for quick scanning for viruses-right from your desktop!\n\nParental Control - Blocks inappropriate content, restricts Web access, monitors your children's online activity.\nUSB Immunizer - Immunizes any Flash Drive from viruses, when they are connected to your computer.\n\nActive Virus Control - A proactive, dynamic detection technology which monitors processes' behavior in real-time, as they are running, and tags suspicious activities. Rescue Mode - If e-threats cannot be removed, the computer is re-booted in a trusted environment which is then used for cleanup and restoration.\n\nVulnerability Scanner - Checks for missing or outdated security software, missing Windows security patches.\n\nBitdefender Autopilot - provides a hassle-free experience by making optimal security-related decisions without input from you. Social Network Protection - filters/blocks social-networking e-threats by scanning the links you receive from your friends.\n\nSearch Advisor - The Link Filter relies on intelligence provided by Bitdefender Cloud services to flag malware and phishing attempts in search engine results.\n\nPersonal Data Filter - Prevents critical data from ever leaving your computer.\n\nAntiphising - Analyzes and blocks websites that support various scams or credit card phishing attempts.\n\nScan Dispatcher - finds and uses time-slices when system resource usage falls below a certain threshold to perform recurring scans of your entire system.\n\n\nWhat's new in this version: Version 2013:\n=========================================\n\nBitdefender SafePay - for iron-clad security when shopping and banking\nWindows 8 Compatible.\n\nDevice Anti-Theft - Remotely locate, lock or wipe any internet connected device.\n\nUSB Immunizer - protection for flash drives against e-threats.\n\nSecurity Widget.\n\n\n\nInstallation Instructions:\n==========================\n\n1: Run the setup\n.\n2: Copy and paste the patch into the installation directory and right click on it then select &quot;run as administrator&quot; to activate.\n\nJOB DONE!!!\n\n\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n   &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n            &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n   &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:d9dc3801a0f7262e335cc3123e83f67f99559d42","amp;dn":"BitDefender+Internet+Security+2013+Build+16.18.0.1407+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9dc3801a0f7262e335cc3123e83f67f99559d42","infoHashBuffer":{"type":"Buffer","data":[217,220,56,1,160,247,38,46,51,92,195,18,62,131,246,127,153,85,157,66]},"announce":[],"urlList":[]}}