{"title":"POtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 53 - A ","uid":8355106,"size":10560892594,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc9b5581cecac0ccf4d1d4ec39127261feadee04&amp;dn=POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+53+-+A+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1365469412,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 53 - A Global Deception and Hybridization\n\n\n\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh and The Holy Spirit.\n\nDescription:\nA Global Deception Conspiracy UFO Disclosure:\nThis is a nice compilation of evidence revealed by American presidents, astronauts, military personnel, politicians along with credible aired news footage. The compilation contains planned revelations regarding knowledge of life beyond Earth along with current ongoing presence of E.T.s. &amp; awareness of free energy technology which is being hidden from masses.\n\nThe following is a partial list of what is in the compilation\n\n1 -- Former U.S. President - Dwight D Eisenhower's statement regarding the  &lt;a href=&quot;\nhttp://www.DivineCosmos.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.DivineCosmos.com&lt;/a&gt; - http://www.ProjectCamelot.org - http://www.ProjectAvalon.net - http://www.MichaelTsarion.com - http://www.RT.com -- http://www.CoastToCoastAm.org - http://www.DemocracyNow.org &lt;a href=&quot;\nhttp://www.DrudgeReport.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.DrudgeReport.com&lt;/a&gt;\n\nRussia Orders Obama: Tell World About Aliens, Or We Will: &lt;a href=&quot;\nhttp://www.stankovuniversallaw.com/2013/01/expect-stunning-revelations-aliens-world-economic-forum-davos-switzerland-beginning-january-23-2013/#more-5950&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.stankovuniversallaw.com/2013/01/expect-stunning-revelations-aliens-world-economic-forum-davos-switzerland-beginning-january-23-2013/#more-5950&lt;/a&gt;\n---------------------------------------------------------------------------------------------------------------------\n\nFrom the AIRCAT Files - Dr. Richard Haines Testimony:\nDr. Haines has been a NASA research scientist since the mid 1960's. He has worked on the Gemini, Apollo and Skylab programs as well as several others. Over the past 30 years, Dr. Haines has compiled over 3,000 cases of unusual visual and radar sightings of unexplained aerial phenomena -- known as the AIRCAT files.\n--------------------------------------------------------------------------------------------------------------------\n\nEncounter Over The Atlantic - Commander Graham Bethune Testimony:\nCmdr. Graham Bethune is a retired Navy commander pilot with a top-secret clearance. He was a VIP Plane Commander who flew most of the high-ranking officers and civilians from Washington, DC. In his testimony he explains how he was flying a group of VIPs and other pilots into Argentia, Newfoundland when they all witnessed a 300 foot UFO that traveled 10,000 feet straight up in a fraction of a second toward their plane. He has documented the event extensively.\n---------------------------------------------------------------------------------------------------------------------\n\nNephilim Stargates with Tom Horn:\nOriginally aired in 2007, Tom Horn joins J.R. Church and Gary Stearman as they discuss his book Nephilim Stargates.\n---------------------------------------------------------------------------------------------------------------------\n\nThe Anchorage Incident - FAA Division Chief John Callahan Testimony:\nFor 6 years, Mr. Callahan was the Division Chief of the Accidents and Investigations Branch of the FAA in Washington, DC. In his testimony he tells about a 1986 Japanese Airlines 747 flight that was followed by a UFO for 31 minutes over the Alaskan skies. Mr. Callahan was able to secure video tape and audio evidence of the event.\n---------------------------------------------------------------------------------------------------------------------\n\nQuarantine Is Lifted ! Ready to Meet Your Hybrid Nephilim Children?\nThe very disturbing truth of satan's corruptive influence on our world and future events. Much of the populace has either been indoctrinated into this process or active in the agenda. This is the acculumation of efforts devised by saatan and his followers to bring about the end of days.\n\n&quot;As in the days of Noah, so shall the coming of man be.&quot; Do not be deceived and prepare for what's unfolding before your eyes, whether you notice it or not. Avoid vaccines, GMO's, be careful of your diet intake, and use discernment for eliminating destructive programming influences found in the sciences,  govt, media, entertainment and societal propaganda.\n\nAlways remember: &quot;God forgives, Jesus saves!&quot;\n\n\n          \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:dc9b5581cecac0ccf4d1d4ec39127261feadee04","amp;dn":"POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+53+-+A+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc9b5581cecac0ccf4d1d4ec39127261feadee04","infoHashBuffer":{"type":"Buffer","data":[220,155,85,129,206,202,192,204,244,209,212,236,57,18,114,97,254,173,238,4]},"announce":[],"urlList":[]}}