{"title":"Educator.com - Advanced Placement Biology with Dr. Carleen Eaton","uid":8444379,"size":7230378668,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dd9da7c727ef2209ea88bb62d8ecc95a0b58a551&amp;dn=Educator.com+-+Advanced+Placement+Biology+with+Dr.+Carleen+Eaton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sanjog123","files":-1,"time":1367853281,"description":"Educator.com - Advanced Placement Biology with Dr. Carleen Eaton\n\nDr. Carleen Eaton utilizes her M.D. from the UCLA School of Medicine to bring in real world applications and examples for her AP Biology class. Carleen covers all the AP tested topics from cell structure to evolution to the laboratory review. Dr. Eaton has been teaching math and science for over 10 years and has won numerous &quot;Teacher of the Year&quot; awards and is consistently ranked as one of the top instructors in California. This course is indispensable for the student looking to ace the AP Biology test as Carleen covers the important concepts with fully illustrated diagrams before going in-depth into problems encountered in the multiple choice and free response sections. Topics also include Cell Structure, Genetics, Plants, Physiology, Behavior, and Ecology.\n\nThe way i recommend you watch these, use a video player that has global hotkeys (i.e. winamp). Set up the hotkeys for play, pause and rewind. Then download a program that allows you to take screenshots with hotkeys (i.e. gadwin printscreen). \n\nOnce you have those two set up, then you can open up a word processor and take notes. Pausing and rewinding when you need to and using the screenshot program to take a picture of the slides that are presented and paste them into your notes.  ","torrent":{"xt":"urn:btih:dd9da7c727ef2209ea88bb62d8ecc95a0b58a551","amp;dn":"Educator.com+-+Advanced+Placement+Biology+with+Dr.+Carleen+Eaton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9da7c727ef2209ea88bb62d8ecc95a0b58a551","infoHashBuffer":{"type":"Buffer","data":[221,157,167,199,39,239,34,9,234,136,187,98,216,236,201,90,11,88,165,81]},"announce":[],"urlList":[]}}