{"title":"Arrow S01E23 XviD [JKS]","uid":8480330,"size":439318232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ddcf1cc8145ac17fcca421b73ce8fe4e2df98ac1&amp;dn=Arrow+S01E23+XviD+%5BJKS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jksADIDAS","files":30,"time":1368719659,"description":"Arrow S01E23 XviD [JKS]\n.\nVideo\nXviD\nLength: 42.04\nFrame width.: 720\nFrame Height: 404\nData rate: 1240kbps\nTotal bitrate: 1369kbps\nFrame rate: 29f/s\n.\nAudio\nMP3\nBit Rate: 129kbps\nChannels:  2 stereo\nAudio sample rate: 48kHz\n.\nIMDb: http://www.imdb.com/title/tt2193021/\nWiki: https://en.wikipedia.org/wiki/Arrow_(TV_series)\nOfficial: http://www.cwtv.com/shows/arrow\n.\nArrow is an American action-adventure television series developed by Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg. It is based on the fictional superhero Green Arrow, a costumed crime-fighter who appears in comic books published by DC Comics. It premiered in North America on The CW on October 10, 2012, with international broadcasting to take place in late 2012. The series follows billionaire playboy Oliver Queen, portrayed by Stephen Amell, who, after five years of being stranded on a hostile island, returns home to fight crime and corruption as a secret vigilante whose weapon of choice is a bow and arrows. Arrow will also feature appearances by other DC Comics characters. To assist in promotion, a preview comic book was released to tie into the television series.\nOn October 22, 2012, Arrow was picked up by The CW for a full season. On February 11, 2013, Arrow was renewed for a second season by The CW.\n.\nArrow Season 1 Episode 23\nTitle: Sacrifice  Directed by: David Barrett  Story written by: Greg Berlanti\nTeleplay written by: Marc Guggenheim &amp; Andrew Kreisberg Original air date: May 15, 2013\n...\nMalcolm imprisons Oliver and leaves him to die, but he manages to escape and return home. In a flashback, Fyers fires a missle at an approaching airliner, but Oliver and Shado manage to override the coordinates and destroy the missle. Afterward, Oliver kills Fyers. In the present, Oliver confronts his mother about the Undertaking, which prompts her to hold a press conference and reveal to the city her involvement with Malcolm and the plan to destroy the Glades. Tommy sees the press conference, and Malcolm reveals that he is the other archer to the dismay of his son. Detective Lance, with help from Felicity, is able to dismantle the earthquake device. Diggle and Oliver go after Malcolm, who reveals that there is a second device shortly before he dies. The device activates and begins to level the east side of the Glades. Thea goes into the Glades to save Roy, who works to help others who are trying to escape the earthquake. Laurel is trapped in her office, but Tommy arrives to rescue her. Laurel escapes, but Tommy is caught by falling debris. Oliver arrives but is too late; Tommy is mortally wounded and dies after Oliver lies and tells him that he did not kill his father.\n","torrent":{"xt":"urn:btih:ddcf1cc8145ac17fcca421b73ce8fe4e2df98ac1","amp;dn":"Arrow+S01E23+XviD+%5BJKS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddcf1cc8145ac17fcca421b73ce8fe4e2df98ac1","infoHashBuffer":{"type":"Buffer","data":[221,207,28,200,20,90,193,127,204,164,33,183,60,232,254,78,45,249,138,193]},"announce":[],"urlList":[]}}