{"title":"KMPlayer_3-6-0-87.exe","uid":8459118,"size":32642064,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de7f19615e3e8929b6e67fb8ac2d5c24fd4a4c01&amp;dn=KMPlayer_3-6-0-87.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1368187091,"description":"K-Multimedia Player (commonly known as The KMPlayer, KMPlayer or KMP) is a media player for Windows which can play a large number of formats including VCD, DVD, AVI, MKV, Ogg, OGM, 3GP, MPEG-1/2/4, WMV, Real Media, FLV and QuickTime.\n\nThe player handles a wide range of audio, video and subtitles formats and allows one to capture audio, video, and screenshots. It provides both internal and external filters with a fully controlled environment in terms of connections to other splitters, decoders, audio/video transform filters and renderers without grappling with the Direct Show merit system (a system of selecting and prioritizing codecs across the entire Windows operating system). Internal filters are not registered into the system's registry to prevent the operating system from confusing system filters with K-Multimedia Player's filters.\n\nThe player can set many audio and video effects, slow down or increase playback speed, select parts of a video as favourites, do various A-B repeats, remap the keys of remote interface for HTPC including overlay screen controls, and change a skin dynamically depending on a media type playing. KMP is completely customizable thanks to a wide selection of skins and color schemes, as well as extensive the configuration options.\n\nUse it to play movies and you will never complain about low sound again !\n\n","torrent":{"xt":"urn:btih:de7f19615e3e8929b6e67fb8ac2d5c24fd4a4c01","amp;dn":"KMPlayer_3-6-0-87.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7f19615e3e8929b6e67fb8ac2d5c24fd4a4c01","infoHashBuffer":{"type":"Buffer","data":[222,127,25,97,94,62,137,41,182,230,127,184,172,45,92,36,253,74,76,1]},"announce":[],"urlList":[]}}