{"title":"The Girl with the Dragon Tattoo and Philosophy: Everything Is Fi","uid":8417530,"size":949232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df3ff598a64b6625872b654a0ed76a76a0c80538&amp;dn=The+Girl+with+the+Dragon+Tattoo+and+Philosophy%3A+Everything+Is+Fi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MersaletoPa","files":-1,"time":1367086365,"description":"William Irwin, Eric Bronson, &quot;The Girl with the Dragon Tattoo and Philosophy: Everything Is Fire&quot;\nISBN: 0470947586 | 2011 | EPUB/MOBI | 240 pages | 663 KB/849 KB\n\n\nThe essential companion to Stieg Larsson's bestselling trilogy and director David Fincher's 2011 film adaptation\n\nStieg Larsson's bestselling Millennium Trilogy-The Girl with the Dragon Tattoo, The Girl Who Played with Fire, and The Girl Who Kicked the Hornet's Nest-is an international phenomenon. These books express Larsson's lifelong war against injustice, his ethical beliefs, and his deep concern for women's rights. The Girl with the Dragon Tattoo and Philosophy probes the compelling philosophical issues behind the entire trilogy. What philosophies do Lisbeth Salander and Kant have in common? To catch a criminal, can Lisbeth and Mikael be criminals themselves? Can revenge be ethical? Drawing on some of history's greatest philosophical minds, this book gives fresh insights into Larsson's ingeniously plotted tale of crime and corruption.\n\n\nLooks at compelling philosophical issues such as a feminist reading of Lisbeth Salander, Aristotelian arguments for why we love revenge, how Kant can explain why so many women sleep with Mikael Blomkvist, and many more\nIncludes a chapter from a colleague of Larsson's-who worked with him in anti-Nazi activities-that explores Larsson's philosophical views on skepticism and quotes from never-before-seen correspondence with Larsson\nOffers new insights into the novels' key characters, including Lisbeth Salander and Mikael Blomkvist, and investigates the author, Stieg Larsson\n\nAs engrossing as the quest to free Lisbeth Salander from her past, The Girl with the Dragon Tattoo and Philosophy is ideal reading for anyone interested in unraveling the subtext and exploring the greater issues at work in the story.","torrent":{"xt":"urn:btih:df3ff598a64b6625872b654a0ed76a76a0c80538","amp;dn":"The+Girl+with+the+Dragon+Tattoo+and+Philosophy%3A+Everything+Is+Fi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df3ff598a64b6625872b654a0ed76a76a0c80538","infoHashBuffer":{"type":"Buffer","data":[223,63,245,152,166,75,102,37,135,43,101,74,14,215,106,118,160,200,5,56]},"announce":[],"urlList":[]}}