{"title":"Terry Stafford - Suspicion! [Collectables] (1994)","uid":8453418,"size":172135223,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e006d26c4fbdb0cd156e8fc20f8f954d55de001a&amp;dn=Terry+Stafford+-+Suspicion%21+%5BCollectables%5D+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":19,"time":1368052920,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nTerry Stafford - Suspicion! [Collectables] (1994)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51IGoQ7EkvL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51IGoQ7EkvL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Steve Huey):\n\nOne-hit wonder Terry Stafford was known for his Elvis sound-alike single &quot;Suspicion,&quot; which became a Top Five smash even at the height of Beatlemania in 1964. Stafford was born in Hollis, OK, on November 22, 1941, and grew up in Amarillo, TX. He moved to Los Angeles after high school to pursue a singing career and performed at various local dances and social events. He got the chance to record a demo and chose &quot;Suspicion,&quot; an album track from Elvis Presley's Pot Luck LP (1962). A local DJ took the song to Crusader Records, which remastered it and released it nationally in 1964. It went all the way to number three on the pop charts and did so during a week when the Beatles held every other spot in the Top Five. Stafford was never able to duplicate its success, though he did reach the Top 30 with his follow-up single, &quot;I'll Touch a Star.&quot; He continued to perform and also branched out into acting (the film Wild Wheels) and songwriting, penning Buck Owens' hit &quot;Big in Vegas.&quot; In 1973, Stafford signed with Atlantic's newly formed country division and recorded a full-fledged country album, Say, Has Anybody Seen My Sweet Gypsy Rose. The title track edged into the country Top 40, and its flip side, the Stafford co-write &quot;Amarillo by Morning,&quot; also enjoyed some regional popularity. It was later covered by George Strait for a major hit. Stafford recorded for Atlantic through 1974 then disappeared from the music scene. He died of liver problems in Amarillo on March 17, 1996.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/terry-stafford-p24819/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/terry-stafford-p24819/biography&lt;/a&gt;\n\nAll Music Album Review (by Greg Adams):\n\nTerry Stafford became one of only a few artists who managed to &quot;steal&quot; a hit from Elvis Presley by covering one of his album tracks -- in this case &quot;Suspicion&quot; from Presley's album Potluck. You wouldn't necessarily realize from that track the extent to which Stafford is a Presley sound-alike, but he is in the same category of great Elvis imitators such as Vince Everett and Ral Donner. &quot;Suspicion&quot; was Stafford's biggest hit by far, but he enjoyed two other hits on the Crusader label in 1964. &quot;I'll Touch a Star&quot; was a big one on the adult contemporary charts, and &quot;Follow the Rainbow&quot; missed the Top 100 by one position. Suspicion is a reissue of Stafford's 1964 album, and it includes the title track and &quot;I'll Touch a Star&quot; along with a number of other compositions by songwriters from Presley's stable. The one quirky flourish that keeps these songs from sounding just like Elvis is the rinky-dink keyboard that plays throughout.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/suspicion-collectables-r232080&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/suspicion-collectables-r232080&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000008E0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000008E0&lt;/a&gt;\n\nTrack List:\n\n01. Suspicion\n02. Margarita\n03. Playing With Fire\n04. Invitation To A Kiss\n05. Slowly But Surely\n06. For You My Love\n07. She Wishes I Were You\n08. Pocket Full Of Rainbows\n09. Everything I Need\n10. I'll Touch A Star\n11. Everybody Has Somebody\n12. Kiss Me Quick\n","torrent":{"xt":"urn:btih:e006d26c4fbdb0cd156e8fc20f8f954d55de001a","amp;dn":"Terry+Stafford+-+Suspicion%21+%5BCollectables%5D+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e006d26c4fbdb0cd156e8fc20f8f954d55de001a","infoHashBuffer":{"type":"Buffer","data":[224,6,210,108,79,189,176,205,21,110,143,194,15,143,149,77,85,222,0,26]},"announce":[],"urlList":[]}}