{"title":"Cut &amp; Run 05 Armed &amp; Dangerous by Abigail Roux","uid":8461515,"size":247326067,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e29a654b03b88d1d251334067329e9b16b8e4501&amp;dn=Cut+%26amp%3B+Run+05+Armed+%26amp%3B+Dangerous+by+Abigail+Roux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"funfactory","files":1,"time":1368244507,"description":"Written by Abigail Roux \nRead by Sean Crisden \nFormat: M4B \nUnabridged\n\nLeft alone in Baltimore after his unpredictable lover bails, Special Agent Zane Garrett takes his frustration out on everything in his path until he is ordered to Chicago to back up an undercover operative. When he gets there, though, he finds himself face to face with his wayward partner, Special Agent Ty Grady.\n\nThey have to deal with the uncertainty lingering between them while they work to retrieve their intended mark, a retired hit man and CIA wet-works operative named Julian Cross.\n\nTy, once a Marine and now an FBI hotshot, has a penchant for being unpredictable, a trait Zane can vouch for. Zane is a man who once lived for his job but has come to realize his heartbreaking past doesn't have to overshadow his future. They're partners, friends, lovers, and the go-to team for unusual cases. With Cross and his innocuous boyfriend, Cameron Jacobs, in tow, Ty and Zane must navigate the obstacles of a cross-country trek, including TSA pat-downs, blizzards, their uncooperative prisoners, CIA kill teams, a desperate lack of sleep and caffeine, and each other.\n\nTy and Zane are determined to get Julian Cross to DC in one piece, but it's starting to look like it might be the last thing they do.","torrent":{"xt":"urn:btih:e29a654b03b88d1d251334067329e9b16b8e4501","amp;dn":"Cut+%26amp%3B+Run+05+Armed+%26amp%3B+Dangerous+by+Abigail+Roux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29a654b03b88d1d251334067329e9b16b8e4501","infoHashBuffer":{"type":"Buffer","data":[226,154,101,75,3,184,141,29,37,19,52,6,115,41,233,177,107,142,69,1]},"announce":[],"urlList":[]}}