{"title":"20130502-Stossel-[Rumble in the States]-Fox Business.CF.avi","uid":8439747,"size":288186612,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e2f8bb05df17c62ac41fecf938c371d93d4e0ae4&amp;dn=20130502-Stossel-%5BRumble+in+the+States%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1367734591,"description":"----------\n\nSTOSSEL - [Rumble in the States] - Fox Business Network\n2013, May 2, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nEach state has different rules, regulations and taxes. It's confusing... but it's also a good thing. It creates competition. When one state does something stupid... people can leave that state and take their talent and money with them.\n\nTravis Brown tracked the movement of people between states for his book, &quot;How Money Walks.&quot; Florida and Arizona are #1 and #2 in terms of gaining people... and wealth. Darcy Olsen, who runs the Goldwater Institute in Arizona, says Florida and Arizona win only partly because of good weather. Most of the gain comes from people moving to where the jobs are.\n\nOklahoma didn't see many people move in... but then it lowered its tax rate. Speaker of the House, T.W. Shannon, said that turned things around, and now people want to live in Oklahoma.\n\nErica Grieder, who wrote the book about Texas: &quot;Big, Hot, Cheap and Right,&quot; says there is a lot Texas does... that the rest of the country could learn from.\n\n24 states now have right-to-work laws, which say workers can't be forced to pay union dues. I debate David Madland of the Center for American Progress, who says right-to-work laws are wrong--America needs unions.\n\nWill Ruger co-authored the Mercatus Center's study &quot;Freedom in the 50 States&quot;, which ranks how states compare in terms of economic and personal freedom. He and Veronique de Rugy explain the findings.\n\nSome states, like Colorado, are experimenting with a new liberty: the legalization of recreational marijuana. Special correspondent, Kennedy went to a weed rally in Denver to ask what this new freedom offers the state.","torrent":{"xt":"urn:btih:e2f8bb05df17c62ac41fecf938c371d93d4e0ae4","amp;dn":"20130502-Stossel-%5BRumble+in+the+States%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f8bb05df17c62ac41fecf938c371d93d4e0ae4","infoHashBuffer":{"type":"Buffer","data":[226,248,187,5,223,23,198,42,196,31,236,249,56,195,113,217,61,78,10,228]},"announce":[],"urlList":[]}}