{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":8257837,"size":8489152801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e53328342d018ed2282945fe38b04721ebec63c9&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1363299888,"description":"\n\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 49 - UFO Europe Untold Stories pt 1\n\n\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh and The Holy Spirit.\n\nDescription:\nC This is a UFO  phenomenon and there are NO UFO Jockeys that Have good intentions for man kind. They are all Demonic!\n\nNational Geographic UFO Europe Untold Stories, part 1 in 720p HD:\n\nS01E01:  A pilot glimpses a flying saucer, hundreds of UFOs are captured on film in Norway, and the UK's first criminal investigation into a UFO assault.\n\nS01E02:  A cyclist sees glowing UFOs in the sky, two US soldiers discover a landed craft, and strange files describing a UFO sighting in Venice from 1936\n\nS01E03:  A pilot reports a hovering object 10,000 metres above Paris, a headmaster in Portugal glimpses a strange disc and a driver sees an intense light.\n\nS01E04:  Locals spot an object above a Portuguese town, military personnel see a series of UFOs in the sky, a craft emits strange lights across a village.\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:e53328342d018ed2282945fe38b04721ebec63c9","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e53328342d018ed2282945fe38b04721ebec63c9","infoHashBuffer":{"type":"Buffer","data":[229,51,40,52,45,1,142,210,40,41,69,254,56,176,71,33,235,236,99,201]},"announce":[],"urlList":[]}}