{"title":"Daddy.Knows.Best.3.XXX.DVDRiP","uid":8464035,"size":1405263216,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e7e93d5f1fb92c44b6fbba7f25d860cc5a39714b&amp;dn=Daddy.Knows.Best.3.XXX.DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":5,"time":1368314002,"description":"Category All Sex, Interracial, Legal Teen, Big Dicks \n  \nDirector Sean Michaels \nStarring Destiny Dymes, Gisselle Leon, Sean Michaels, Shay Fox, Jayden Starr \n\nPorn legend Sean Michaels is a performer/director with a lifetime of sexual experience he enjoys imparting to the new generation of XXX sluts. When a young woman needs a guiding hand, some wise words or a massive, throbbing black cock Sean is there to help them make sense of their raging hormones and randy desires. Daddy Knows Best 3 is the veteran pornographers latest batch of sizzling vignettes with beautiful bombshells who crave the steady groove of a confident authority figure. Destiny Dymes, a sweet, dark chocolate student sporting nerdy glasses, is looking for some private tutoring from the famous Mr. Michaels. The adorable, impossibly voluptuous girl hikes up her skirt and strokes her juicy cunt, then kneels and worships the directors massive dick. He pounds her thoroughly and decorates Destinys pretty face with hot cum. Next, sultry white girl Giselle Leon needs a session of interracial counseling from Daddy. He pumps the slender cutie full of black meat and ejaculates his approval all over her lovely face. Big, bodacious MILF Shay Fox contacts Professor Michaels for some classroom tutoring, passionate fucking and a creamy load across her massive boobs. Thick, ebony BBW Jayden Starr gets her gigantic booty and huge, wobbling tits tamed by the masterful director, who bangs the luscious, phat babe and sprays Jayden with sticky goo. For the insufferably horny girls in this cast, theres no substitute for a seasoned pro, and their Daddy Knows Best 3. \n\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=pldkb3f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=pldkb3f.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=pldkb3b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=pldkb3b.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=pldkb3mp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=pldkb3mp4.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e7e93d5f1fb92c44b6fbba7f25d860cc5a39714b","amp;dn":"Daddy.Knows.Best.3.XXX.DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7e93d5f1fb92c44b6fbba7f25d860cc5a39714b","infoHashBuffer":{"type":"Buffer","data":[231,233,61,95,31,185,44,68,182,251,186,127,37,216,96,204,90,57,113,75]},"announce":[],"urlList":[]}}