{"title":"Iron Man [2008] .x264, Subtitles, Bonus Disk Extras","uid":8473892,"size":4023359298,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e80f23b72449a99c4f7f6cf26f5004cc16251502&amp;dn=Iron+Man+%5B2008%5D+.x264%2C+Subtitles%2C+Bonus+Disk+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rambam1776","files":-1,"time":1368564425,"description":"Iron Man [2008]\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.32 GiB\nDuration                                 : 2h 6mn\nOverall bit rate                         : 1 502 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 360 pixels\nDisplay aspect ratio                     : 2.35:1\nScan type                                : Progressive\nWriting library                          : x264 core 120\nSubtitles                                : English, Spanish, French\n\nSCREENS:\n &lt;a href=&quot;\nhttp://image.bayimg.com/7de8033aa50565ea9d9536ae033ebe8af86a29ea.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/7de8033aa50565ea9d9536ae033ebe8af86a29ea.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0371746/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0371746/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Iron_Man_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Iron_Man_(film)&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/397d7e5194388a807413cb9bf21e2f58e6a2fc6a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/397d7e5194388a807413cb9bf21e2f58e6a2fc6a.jpg&lt;/a&gt;\n\n\nCast overview, first billed only:\nRobert Downey Jr.\t ...\tTony Stark / Iron Man\nTerrence Howard\t ...\tRhodey\nJeff Bridges\t ...\tObadiah Stane\nGwyneth Paltrow\t ...\tPepper Potts\nLeslie Bibb\t ...\tChristine Everhart\nShaun Toub\t ...\tYinsen\nFaran Tahir\t ...\tRaza\nClark Gregg\t ...\tAgent Coulson\nBill Smitrovich\t ...    General Gabriel\nSayed Badreya\t ...\tAbu Bakaar\nPaul Bettany\t ...\tJarvis (voice)\nJon Favreau\t ...\tHappy Hogan\nPeter Billingsley\t ...\tWilliam Ginter Riva\nTim Guinee\t ...\tMajor Allen\nWill Lyman\t ...\tAward Ceremony Narrator (voice)\n\nPlayboy and genius Tony Stark, who has inherited the defense contractor Stark Industries from his father, is in war-torn Afghanistan with his friend and military liaison, Lieutenant Colonel James Rhodes to demonstrate the new &quot;Jericho&quot; missile. Stark is critically wounded in an ambush and imprisoned in a cave by the terrorist group the Ten Rings. An electromagnet grafted into Stark's chest by fellow captive Yinsen keeps the shrapnel that wounded him from reaching his heart and killing him. Ten Rings leader Raza offers Stark freedom in exchange for building a Jericho missile for the group, but Tony and Yinsen agree Raza will not keep his word.\n\nStark and Yinsen secretly build a powerful electric generator called an arc reactor, to power Stark's electromagnet, and then begin to build a suit of armor which is later named &quot;Mark I&quot; to escape. The Ten Rings attack the workshop when they discover that Stark was trying to escape. Yinsen sacrifices himself to divert them while Stark's suit powers up. The armored Stark battles his way out of the cave to find the dying Yinsen, then an enraged Stark burns the Ten Rings weapons and flies away, only to crash in the desert, destroying the suit. After being rescued by Rhodes, Stark returns home and announces that his company will no longer manufacture weapons. Obadiah Stane, his father's old partner and the company's manager, advises Stark that this may ruin Stark Industries and his father's legacy and asked to see what Stark has been working on in his home workshop. In his home workshop, Stark builds an improved version of his suit, as well as a more powerful arc reactor for his chest.\n\nAt a charity event held by Stark Industries, reporter Christine Everhart informs Stark that his company's weapons, including the Jericho, were recently delivered to the Ten Rings and are being used to attack Yinsen's home village, Gulmira. Stark also learns Stane is trying to replace him as head of the company. Enraged, Stark dons his new armor and flies to Afghanistan, where he saves Yinsen's village and delivers a devastating blow to the Ten Rings. While flying home, Stark is shot at by two F-22 Raptor fighter jets. He phones Rhodes and reveals his secret identity in an attempt to end the attack. Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who subdues Raza with a sonic device and has the rest of the group eliminated. He has a new suit reverse engineered from the wreckage. Seeking to find any other weapons delivered to the Ten Rings, Stark sends assistant Virginia &quot;Pepper&quot; Potts to hack into the company computer system from Stane's office. She discovers Stane has been supplying the terrorists and hired the Ten Rings to kill Stark, but the group reneged. Potts meets with Agent Phil Coulson of the &quot;Strategic Homeland Intervention, Enforcement and Logistics Division&quot;, a counter-terrorism agency, to inform him of Stane's activities.\n\nStane's scientists cannot duplicate Stark's arc reactor so Stane ambushes Stark at home, using his sonic device to paralyze him, and takes his arc reactor. Left to die, Stark manages to crawl to his lab and plug in his original reactor. Potts and several S.H.I.E.L.D. agents attempt to arrest Stane, but he dons his suit and attacks them. Stark fights Stane, but is overmatched without his new reactor to run his suit at full capacity. Stark lures Stane atop the Stark Industries building and instructs Potts to overload the large arc reactor there. This unleashes a massive electrical surge that knocks Stane unconscious, causing him and his armor to fall into the exploding reactor, killing him.\n\nThe next day, the press has dubbed the armored hero &quot;Iron Man&quot;. Agent Coulson gives Stark a cover story to explain the events of the night and Stane's death. At a press conference, Stark begins giving the cover story, but then announces he is Iron Man, prompting the reporters to swarm the stage and ask more questions.\n\nIn a post-credits scene, S.H.I.E.L.D. Director Nick Fury visits Stark at home, and, noting Iron Man is not &quot;the only superhero in the world&quot;, says he wants to discuss the &quot;Avengers Initiative&quot;.","torrent":{"xt":"urn:btih:e80f23b72449a99c4f7f6cf26f5004cc16251502","amp;dn":"Iron+Man+%5B2008%5D+.x264%2C+Subtitles%2C+Bonus+Disk+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e80f23b72449a99c4f7f6cf26f5004cc16251502","infoHashBuffer":{"type":"Buffer","data":[232,15,35,183,36,73,169,156,79,127,108,242,111,80,4,204,22,37,21,2]},"announce":[],"urlList":[]}}