{"title":"Art of the Devil.pdf","uid":8435831,"size":122429306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8f960fd505e86756c04596e946cd4bc059f107f&amp;dn=Art+of+the+Devil.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1367626804,"description":"Art of the Devil (Temporis Collection) By Arturo Graf\n2009 | 256 Pages | ISBN: 1844846466 , 1780429940 | PDF | 117 MB\n\n\nThe Devil holds the strings which move us! (Charles Baudelaire, The Flowers of Evil, 1857.) Satan, Beelzebub, Lucifer... the Devil has many names and faces, all of which have always served artists as a source of inspiration. Often commissioned by religious leaders as images of fear or veneration, depending on the society, representations of the underworld served to instruct believers and lead them along the path of righteousness. For other artists, such as Hieronymus Bosch, they provided a means of denouncing the moral decrepitude of one s contemporaries. In the same way, literature dealing with the Devil has long offered inspiration to artists wishing to exorcise evil through images, especially the works of Dante and Goethe. In the 19th century, romanticism, attracted by the mysterious and expressive potential of the theme, continued to glorify the malevolent. Auguste Rodin s The Gates of Hell, the monumental, tormented work of a lifetime, perfectly illustrates this passion for evil, but also reveals the reason for this fascination. Indeed, what could be more captivating for a man than to test his mastery by evoking the beauty of the ugly and the diabolic?","torrent":{"xt":"urn:btih:e8f960fd505e86756c04596e946cd4bc059f107f","amp;dn":"Art+of+the+Devil.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f960fd505e86756c04596e946cd4bc059f107f","infoHashBuffer":{"type":"Buffer","data":[232,249,96,253,80,94,134,117,108,4,89,110,148,108,212,188,5,159,16,127]},"announce":[],"urlList":[]}}