{"title":"Apocolyptic OS Installer By Uncle Jerry","uid":8368854,"size":62814643956,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eafcaffa97acad4f63c3828362446cf49ecaa818&amp;dn=Apocolyptic+OS+Installer+By+Uncle+Jerry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IntPir","files":-1,"time":1365853606,"description":"    Apocolyptic OS[Win8ProPreconfigured]Installer By Uncle Jerry\n\n   The real deal--as always. Seed and enjoy.\n\n           MADE IN AMERICA-MADE TO BOOT\n\n  From us to you because we care we present to you the Apocolyptic OS installer by Uncle Jerry. What this does: The included img file installs to a 64GB or larger usb flash drive. You then boot from that device and install a specially enhanced and formatted edition of Windows 8 Professional as the first partition on any hard drive on any computer or, additionally, you may install it as the first partition on any external storage device with a rotating hard drive (i.e.-toshiba,western digital, etc ).\n\n   The external storage device can then be booted on any computer and is immediately a forensics lab which binds to an existing os enabling high level examinations to be performed. Also, it is a fully enabled computer repair tool and a fine multi-format production tool. An all around multi-tool when installed in this fashion. \n\n  When installed as the first partition on any computer the Apocolyptic OS is a fully capable platform to create, design, think, and learn with. All of the tools of the Apocolyptic OS are available to you no matter where you install it. Here is a small sampling of some of the tools available to you upon boot up: PasswordRenew, Hiren's15.1, Geeksquad, Adobe CS6 M, Rosetta Stone, Driver Pack Solutions, Fruity Loops, Mapsource, and many many more. Helix Forensics has also been enabled here as part of the forensics package.\n\n   This is the Apocolyptic OS not to be confused with anything apocalyptic. There the a after the c would represent the power of the atom and here the o after the c represents the power of the OS. You will indeed find many capabilities here. This is as requested worldwide- a fully enabled, preconfigured, installable version of Windows 8 Professional. The password upon bootup is Apocolyptic\n\n   Many security and software consultations were performed while working on this project. You will now have the ability to right click your way through an entire session of windows if you like. Once this OS fully boots up she just sits there quietly--awaiting user imput.This is a mastered copy.\n\n   This is GOLD. Seed and enjoy. We came, we saw, we conquered, -we're outta here.\n \n  Best wishes from:  UncleJerry,Colleen,Duganator,Coder27,Skytrype,Shanika,Falsestop","torrent":{"xt":"urn:btih:eafcaffa97acad4f63c3828362446cf49ecaa818","amp;dn":"Apocolyptic+OS+Installer+By+Uncle+Jerry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eafcaffa97acad4f63c3828362446cf49ecaa818","infoHashBuffer":{"type":"Buffer","data":[234,252,175,250,151,172,173,79,99,195,130,131,98,68,108,244,158,202,168,24]},"announce":[],"urlList":[]}}