{"title":"HISTORY OF POP AND ROCK MUSIC - part 481","uid":8237602,"size":1086852166,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb976fd279d140f5e0e63e9f0ab2ecefc408923c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+481&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1362877572,"description":"\n                    \n                          PART  481\n\n\n    In the early 2000s, a garage rock or post-punk revival achieved the airplay and commercial success that had eluded garage rock bands of the past. This was led by four bands: The Strokes of New York City, The Hives of Fagersta, Sweden, The Vines of Sydney, Australia, and The White Stripes from Detroit, Michigan, christened by the media as the The bands, or &quot;The saviours of rock 'n' roll&quot;.\n\n\n\n\n                      THE STROKES  -  The Modern Age  (2001)\n                      THE STROKES  -  Last Nite  (2001)\n                      THE STROKES  -  Someday  (2002)\n                      THE STROKES  -  Reptilia (2004)\n                      THE STROKES  -  Juicebox  (2005)\n     \n\n\n\n              The Modern Age is a song by American indie rock band The Strokes. It was released on January 29, 2001 in the United Kingdom and May 22, 2001 in the United States. \n\n            &quot;Last Nite&quot; is a song by The Strokes, released as the second single from their debut album, &quot;Is This It&quot;.\nIn March 2005, Q placed &quot;Last Nite&quot; at number 66 in its list of the 100 Greatest Guitar Tracks. In September 2006, NME placed &quot;Last Nite&quot; at number one on its list of the 50 Greatest Tracks of the Decade. In May 2007, NME magazine placed &quot;Last Nite&quot; at number nine in its list of the 50 Greatest Indie Anthems Ever. It was also placed at number 16 on Rolling Stone's 50 Best Songs of the Decade and number 478 on its list of &quot;The 500 Greatest Songs of All Time&quot;. In 2011, NME placed it at number 4 on its list &quot;150 Best Tracks of the Past 15 Years&quot;.\n          &quot;Someday&quot; is a third single from &quot;Is This It&quot;. It peaked at #17 on the U.S. Alternative Songs chart and at #27 on the U.K. Singles Chart\n\n          &quot;Reptilia&quot; is a second single from album &quot;Room on Fire&quot;. The title &quot;Reptilia&quot; refers to the &quot;Reptilian complex&quot;, the central part of one's brain that handles basic emotions such as love and hate. The cover of the single features the artwork from the cabinet of the 1980 arcade game Centipede by Atari.  In October 2011, NME placed it at number 129 on its list &quot;150 Best Tracks of the Past 15 Years&quot;.This song peaked #19 on the alternative songs chart.\n\n           &quot;Juicebox&quot; is a second track and first single from The Strokes' third album, &quot;First Impressions of Earth&quot;, released in the US in October 2005. Julian Casablancas was quoted in Spin Magazine as saying this about the song: &quot;I remember people saying this track's ugly, I think it's got a great personality.&quot; Their first single in over a year, &quot;Juicebox&quot; marked the Strokes' second single to reach the Top 10 in the UK and also their highest charting single to date. The song also became their first and only single to chart the U.S. Billboard Hot 100, at #98.  The video for &quot;Juicebox&quot;, directed by Michael Palmieri with cinematography by Christopher Doyle, features comedian David Cross as a DJ in a radio station in New York City. The video caused some controversy because it contained an abundance of sexual content, which caused Palmieri to do major edits on the video so that it would be less explicit.","torrent":{"xt":"urn:btih:eb976fd279d140f5e0e63e9f0ab2ecefc408923c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+481","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb976fd279d140f5e0e63e9f0ab2ecefc408923c","infoHashBuffer":{"type":"Buffer","data":[235,151,111,210,121,209,64,245,224,230,62,159,10,178,236,239,196,8,146,60]},"announce":[],"urlList":[]}}