{"title":"Alfred with SK patch v. 2.0.3","uid":8399695,"size":3404213,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:ec66c506f1c99b05ec588c2c1c68919822875881&amp;dn=Alfred+with+SK+patch+v.+2.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1366664530,"description":"Official Web Site: &lt;a href=&quot; http://www.alfredapp.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.alfredapp.com&lt;/a&gt;\n\nPatch to unlock PowerPack courtesy of Special [K]\n\nAlfred is an award-winning productivity application for OS X. Alfred saves you time when you search for files online or on your Mac. Be more productive with hotkeys, keywords, and file actions at your fingertips.\n\nLoads of app-launching, file-searching goodness - free for you to download and use with no strings attached. Alfred is the ultimate productivity tool for your Mac. Get it and see for yourself.\n\nGet the Powerpack Discover the Powerpack, a set of incredibly powerful features, built on top of the robust core of Alfred and integrated with OS X.\n\nWhats New: \n\n* Give Alfred's Auto Updater its own tab with change log\n\n* Migrate user set hotkeys and keywords when updating a workflow\n\n* Make no results from a script filter correctly fall back to fallbacks\n\n* Make the script filter item uid attribute optional, and generate a UUID \n  for these instead. This prevents Alfred from learning the returned \n  result order so will respect the XML returned order\n\n* Sort saved workflow [input] objects based on y position for more\n   predictable initial no-knowledge ordering\n\n* Add hidden knowledge for placeholder items - Allows for web \n  searches / workflows to be ranked higher in the default results\n \n* better logic on alternative modifiers, allows default mod actions on \n  invalid results\n\n* Respect opening contacts metadata files in Alfred's contact viewer if \n  setup\n\n*  Don't show &quot;View contact in Alfred' subtext for non Powerpack\n   users\n\n* Capitalise Finder in 'reveal file in finder' modifier press subtext\n\n* Fix spelling mistake 'searchces' when deleting a custom search\n\n* Add option to escape backslashes in {query} for scripting\n \n* default backslash escaping for script workflow templates and \n  examples\n\n* When using cmd+c on a contact in Alfred's results, copy the name\n   rather than the contact id\n\n* Reset iTunes mini player if node stack typed mismatch, prevents nil\n   caused double characters\n\n* Add placeholder AppleScript for NSAppleScript configuration\n   window with no AppleScript\n\n* improve &quot;Open With&quot; matching to use kMDItemKeywords fields\n   which also match app char names from 10.8.3\n\n* fix issue with typed word not showing with define keyword in certain\n   scenarios\n\n* Add and improve timer logging for better performance profiling\n\n* Change resizing mode on snippets table in prefs to make more useful\n\n* If cmd+down on file, navigate into the containing folder\n\n* Show reason sheet why non-PP users can't import themes or \n  workflows rather than just not doing anything\n\n* More efficient eject workflow which only loads the volumes if it \n  needs to\n\n* Don't great out advanced 'sync' button for non-Powerpack users, \n  instead, explain Powerpack is needed\n\n* Rename 'Update&quot; to &quot;Save&quot; in the workflows detail editor to prevent\n   confusion\n\n* If a person is marked as a company, then prefix with the company in \n  Alfred's results\n\n* Add in support for Mailplane 3 email attachments\n\n* Trim large type text to ensure there are no hanging characters before\n  displaying\n\n* More clear 'grey out' behavior for alt connection sheet when selecting \n  'none' as the connection modifier\n\n* show full path at bottom of recent documents window\n\n* Add type to filter documents in the recent documents action\n\n* Fix some text in the v1 import sheet\n\n* Switch out some unused NSLogs\n\n* Add resilience against certain Address Book scenarios\n\n* Move application file cache database into app support folder to \n  prevent auto cache cleaner apps from breaking or slowing Alfred\n\n* Fix issue where joining comments and keywords in the app cache \n  caused a selector not found when assuming an id was an array\n\n* More robust default browser selection when populating browser info\n  into workflow object config browser selection\n\n* Fix time modifiers for snippets e.g. {time:short}\n\n* Code review and remove the unused update controllers from the \n  general prefs\n\nSystem Requirements:\n\nIntel Mac, OS X.6 or later\nProcessor type(s) &amp; speed: 64 Bit CPU\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:ec66c506f1c99b05ec588c2c1c68919822875881","amp;dn":"Alfred+with+SK+patch+v.+2.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec66c506f1c99b05ec588c2c1c68919822875881","infoHashBuffer":{"type":"Buffer","data":[236,102,197,6,241,201,155,5,236,88,140,44,28,104,145,152,34,135,88,129]},"announce":[],"urlList":[]}}