{"title":"Microsoft Windows 7 Ultimate SP1 Super OEM Edition Italian (x86x","uid":8449207,"size":6125804434,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:edf57a43deee9e155276c3f02424b6f2af6f8867&amp;dn=Microsoft+Windows+7+Ultimate+SP1+Super+OEM+Edition+Italian+%28x86x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"isuhno","files":1,"time":1367954730,"description":"Windows 7 is easy, fast and fascinating. New capabilities to find and manage files, like Jump Lists and improved taskbar previews from, you can speed up your daily activities. Windows 7 is designed to provide faster performance and reliable so that your PC functions just as you wish. With the 64-bit version, you can take advantage of the power of the latest generation PCs. In addition, exceptional features such as HomeGroup, Windows Media Center and Windows Touch make the impossible possible.\n\nRelease Notes:\nWindows 7 includes many new features, such as advances in touch, speech recognition (not available in Italian), handwriting, support for virtual hard disk format VHD for booting, improved performance on multi-core processors, support Hard Drive partitioned GPT on EFI-based systems.\nWindows 7 on the same system allows you to have video cards from different manufacturers, and includes a new version of Windows Media Center, gadgets that integrate directly into the Desktop, the ability to lock and unlock the links in the Start menu and the taskbar (a feature called pinning), improved media features, the XPS Essential Pack integrated and a redesigned Calculator with multiline capabilities, which include Planning and Statistics with unit conversion.\nMany items have been added to the Control Panel: Configuration ClearType, Color Configuration Wizard, Gadgets, Recovery, Troubleshooting, Identity Management, System Icons, and many others. The &quot;Security Center&quot; was renamed Operations Center (Health Center and Center PC Troubleshooting in previous versions), and encompasses both security and maintenance of your PC. Were also added to the HomeGroup that allow you to share in the house so simple documents, pictures, music and videos between different computers.\n\nIncludes\nMicrosoft Windows 7 Ultimate Sp1 Super OEM Edition (x86/x64)\nMicrosoft Windows 7 Pro Sp1 Super OEM Edition (x86/x64)\nMicrosoft Windows 7 Home Premium Sp1 Super OEM Edition (x86/x64)\nMicrosoft Windows 7 Home Basic Sp1 Super OEM Edition (x86/x64)\nMicrosoft Windows 7 Starter Sp1 Super OEM Edition (x86/x64)\n\nMore than 100 OEM Officials File","torrent":{"xt":"urn:btih:edf57a43deee9e155276c3f02424b6f2af6f8867","amp;dn":"Microsoft+Windows+7+Ultimate+SP1+Super+OEM+Edition+Italian+%28x86x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf57a43deee9e155276c3f02424b6f2af6f8867","infoHashBuffer":{"type":"Buffer","data":[237,245,122,67,222,238,158,21,82,118,195,240,36,36,182,242,175,111,136,103]},"announce":[],"urlList":[]}}