{"title":"Formula 1. 2013. Spanis - Qualifying, Russian, 1080i, HDTV, AVC,","uid":8463980,"size":7780759008,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f0289a3601abc25fe96a3a23bc429016ebce83a5&amp;dn=Formula+1.+2013.+Spanis+-+Qualifying%2C+Russian%2C+1080i%2C+HDTV%2C+AVC%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigdiq","files":1,"time":1368312369,"description":"\nCatalunya\n\nThe Formula One teams are no strangers to Barcelona's Circuit de Catalunya; not only have they raced there every year since 1991, they also conduct extensive testing at the venue.\n\nFamiliarity does not, however, lessen the challenge for car or driver. Barcelona's mix of high and low-speed corners, plus its abrasive and rather bumpy track surface, makes for a physically and mechanically taxing race. Tyre wear is particularly high and the varying winds that cut across the circuit mean an optimum set-up can be hard to find.\n\nFor spectators Elf corner is among the best places to watch, as it is one of the track's few overtaking opportunities. For the drivers it is the final two turns, known collectively as New Holland, which provide one of the biggest challenges of the season. A fast exit is essential in order to maximise speed down the start-finish straight into Elf.\n\n2012 marks the 22nd time Barcelona has hosted the Spanish Grand Prix. Michael Schumacher has been the most successful driver at the circuit, with a total of six victories. Among the other current drivers, Kimi Raikkonen, Fernando Alonso, Sebastian Vettel, Jenson Button, Mark Webber and Felipe Massa have all won there.\n","torrent":{"xt":"urn:btih:f0289a3601abc25fe96a3a23bc429016ebce83a5","amp;dn":"Formula+1.+2013.+Spanis+-+Qualifying%2C+Russian%2C+1080i%2C+HDTV%2C+AVC%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0289a3601abc25fe96a3a23bc429016ebce83a5","infoHashBuffer":{"type":"Buffer","data":[240,40,154,54,1,171,194,95,233,106,58,35,188,66,144,22,235,206,131,165]},"announce":[],"urlList":[]}}