{"title":"Lydia Loveless - Indestructible Machine [2011] FLAC]","uid":8454438,"size":288870618,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f189aa339f5b29fecd12338c986d207847e31398&amp;dn=Lydia+Loveless+-+Indestructible+Machine+%5B2011%5D+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":11,"time":1368078478,"description":"Artist: Lydia Loveless\nRelease:  Indestructible Machine\nReleased:  2011\nLabel:    Bloodshot Records\nCatalog#:   BS188\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana,country,rock\n\n\n Bad Way To Go\t\t\n Can't Change Me\t\t\n More Like Them\t\t\n How Many Women\t\t\n Jesus Was A Wino\t\t\n Steve Earle\t\t\n Learn To Say No\t\t\n Do Right\t\t\n Crazy\n\nIf you're someone who seeks out the place where punk rock, country music, crafted songwriting, and raw, immediate, visceral garagey rock &amp; roll meet, look no further than Indestructible Machine, the Bloodshot debut of Lydia Loveless. The 21-year-old Ohioan is the product of a rock &amp; roll drummer daddy (who plays in her band), a Loretta Lynn-worshiping momma, and a boyfriend who hipped her to country music's outlaws and the latter-day XXX-brand country of Hank III, Shooter Jennings, etc. Indestructible Machine reflects all this, but Loveless is more than the sum of her influences: her writing and singing talents are in their own class. She has a big throaty voice that recalls Neko Case's at first blush, but Loveless' is bigger, richer, more expressive -- her singing owes more to singers Lynn and Jeannie C. Riley. She's backed by a bona fide careening country sextet with lead guitarist Todd May, banjo boss Rob Woodruff, pedal steel player Barry Hensley, fiddler Adrian Jusdanis, Ben Lamb on bass, and dad Parker Chandler on skins. The set kicks off at 100 miles per with &quot;Bad Way to Go.&quot; The banjo and guitar struggle for dominance, the snare and kick drums skitter at a gallop, and Loveless wails atop a charging bassline. Her colorful language is filled with double and triple entendres and images of a seedy America reflected in the rear-view mirror. &quot;Can't Change Me&quot; is a feminist anthem that stays on electrical overload but in a minor key. &quot;How Many Women&quot; is a straight-up honky tonk weeper. &quot;Jesus Was a Wino&quot; is a rockin' triple-time 2-step that celebrates the Son of God's empathy for the struggling human race. The song &quot;Steve Earle&quot; simply has to be heard to be believed; it's hysterically funny. If the Rolling Stones had ever recorded with the young Emmylou Harris when she was part of Gram Parsons' band, it might have sounded similar to &quot;Learn to Say No,&quot; one of the finest moments on the record. &quot;Do Right,&quot; with its NASCAR-fueled bluegrass tempo and dueling banjo and guitars, is an unapologetic paean to the consequences of substance abuse. &quot;Crazy&quot; is a spare country lust song worthy of Charles Bukowski. Lydia Loveless' Indestructible Machine possesses a classicist's grip of country, a rock &amp; roll sense of swagger, and the keen eye of a songwriter twice her age.","torrent":{"xt":"urn:btih:f189aa339f5b29fecd12338c986d207847e31398","amp;dn":"Lydia+Loveless+-+Indestructible+Machine+%5B2011%5D+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f189aa339f5b29fecd12338c986d207847e31398","infoHashBuffer":{"type":"Buffer","data":[241,137,170,51,159,91,41,254,205,18,51,140,152,109,32,120,71,227,19,152]},"announce":[],"urlList":[]}}