{"title":"Pepper Spray for Self-Defense and for Home Defense ","uid":8240576,"size":584958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f19223403c8ce76df2e3e8bcefd942d75d63fb04&amp;dn=Pepper+Spray+for+Self-Defense+and+for+Home+Defense+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"DaRule762","files":-1,"time":1362950368,"description":"&quot;Pepper Spray for Self-Defense and for Home Defense&quot; contains vital information about one form of non-lethal self-defense.\n\nAccording to a study done at the University of Utah, pepper spray has a 30% failure rate, So it pays to do your homework before purchasing an item that you hope will help protect you in a bad situation.\n\nTable of Contents\n==============\nChapter 1. Can pepper spray really help me escape a bad situation? (includes a warning against unscrupulous attempts to get you to buy more expensive products)\n\nChapter 2. What causes most pepper spray failures? (includes ingredients and a look at the inside of a canister)\n\nChapter 3. How big a problem is pepper spray failure? (includes information about inexperienced manufacturers and scam artists)\n\nChapter 4. How can I avoid pepper spray failure? (sets out my criteria for selecting a manufacturer and what companies fit that criteria)\n\nChapter 5. How do you measure pepper spray strength? (explains why it's so hard to get a straight answer and clarifies the various rating systems)\n\nChapter 6. How can I make sure I hit my target? (how product design affects your ability to hit the target)\n\nChapter 7. Can you give me some tips on using pepper spray? (tips from a pepper spray trainer)\n\nChapter 8. What about first aid?\n\nChapter 9. Can I use pepper spray against dogs and bears?\n\nChapter 10. What about legal issues and travel?","torrent":{"xt":"urn:btih:f19223403c8ce76df2e3e8bcefd942d75d63fb04","amp;dn":"Pepper+Spray+for+Self-Defense+and+for+Home+Defense+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f19223403c8ce76df2e3e8bcefd942d75d63fb04","infoHashBuffer":{"type":"Buffer","data":[241,146,35,64,60,140,231,109,242,227,232,188,239,217,66,215,93,99,251,4]},"announce":[],"urlList":[]}}