{"title":"The Finish: The Killing of Osama Bin Laden","uid":8417796,"size":791982,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f194e9f118e5daabd80469427feacd2e96733526&amp;dn=The+Finish%3A+The+Killing+of+Osama+Bin+Laden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MersaletoPa","files":-1,"time":1367092160,"description":"Mark Bowden, &quot;The Finish: The Killing of Osama Bin Laden&quot;\nISBN: 0802120342 | 2012 | EPUB/MOBI | 266 pages | 299 KB/476 KB\n\n\nFrom Mark Bowden, the preeminent chronicler of our military and special forces, comes The Finish, a gripping account of the hunt for Osama bin Laden. With access to key sources, Bowden takes us inside the rooms where decisions were made and on the ground where the action unfolded.\n\nAfter masterminding the attacks of September 11, 2001, Osama bin Laden managed to vanish. Over the next ten years, as Bowden shows, America found that its war with al Qaeda-a scattered group of individuals who were almost impossible to track-demanded an innovative approach. Step by step, Bowden describes the development of a new tactical strategy to fight this war-the fusion of intel from various agencies and on-the-ground special ops. After thousands of special forces missions in Iraq and Afghanistan, the right weapon to go after bin Laden had finally evolved. By Spring 2011, intelligence pointed to a compound in Abbottabad; it was estimated that there was a 50/50 chance that Osama was there. Bowden shows how three strategies were mooted: a drone strike, a precision bombing, or an assault by Navy SEALs. In the end, the President had to make the final decision. It was time for the finish.","torrent":{"xt":"urn:btih:f194e9f118e5daabd80469427feacd2e96733526","amp;dn":"The+Finish%3A+The+Killing+of+Osama+Bin+Laden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f194e9f118e5daabd80469427feacd2e96733526","infoHashBuffer":{"type":"Buffer","data":[241,148,233,241,24,229,218,171,216,4,105,66,127,234,205,46,150,115,53,38]},"announce":[],"urlList":[]}}