{"title":"Beach House - Bloom [24 bit FLAC] vinyl","uid":8248942,"size":1171253420,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1e2f59c6d51a63ae3e4306739c411a2c76fbf42&amp;dn=Beach+House+-+Bloom+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"24.96","files":-1,"time":1363119587,"description":"  Beach House - Bloom (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Genre: Electronic\n  Style: Indie Electronic, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Myth 4:19 \n  A2. Wild 4:58 \n  A3. Lazuli 5:02 \n  B1. Other People 4:25 \n  B2. The Hours 4:12 \n  B3. Troublemaker 4:56 \n  C1. New Year 5:26 \n  C2. Wishes 4:47 \n  D1. On The Sea 5:32 \n  D2. Irene 6:45 \n  D3. Wherever You Go [Hidden Track] 3:35\n\n  &quot;It's a strange paradise,&quot; Victoria LeGrand sings at one point on Beach House's fourth album Bloom, and there isn't a more apt description of the beautifully heartbroken mood that she and Alex Scally create here. Reuniting with Teen Dream engineer Chris Coady, the duo designed the album to be listened to as a whole, and fittingly, it often feels more like a suite than a collection of songs. This ambition is admirable, but it also means that it takes a while for individual moments to emerge from the album's beautiful haze. Indeed, Bloom may be Beach House's most sonically gorgeous album yet, with an icy sheen that doesn't warm up much, even when recordings of locusts and seagulls show up between tracks; it's easy to imagine LeGrand exhaling clouds of mist while singing the backing vocals on &quot;Lazuli.&quot; While the endearing, sometimes awkward intimacy of Beach House's earlier work -- which felt like LeGrand was crooning confessions over creaky, vintage keyboards and drum machines just for you -- is missed, Bloom's shimmering remoteness enhances the album's philosophical, searching approach to love and loss. It's a mood and setting perfect for LeGrand's vocals, which have never sounded richer or more world-weary: &quot;What comes after this momentary bliss? Help me to name it,&quot; she calls out on the opening track &quot;Myth,&quot; a sentiment echoed later by &quot;Wishes,&quot; where she wonders, &quot;How's it supposed to feel?&quot; Emotional moments such as these take their time to emerge, but when they do, they're riveting, particularly on &quot;Troublemaker,&quot; which recalls Beach House's previous albums in its delicate dance between sad, stark verses and more hopeful choruses, and on the beautifully resigned &quot;Irene,&quot; where a whimsical keyboard melody offsets and underscores the feeling of loss at the same time. Since Bloom's suite-like flow downplays Beach House's poppy side (with the notable exceptions &quot;Other People&quot; and &quot;The Hours&quot;), it's not the band's most immediate music, but the album's challenging mix of heartbroken words and aloof sounds rewards patient and repeated listening.","torrent":{"xt":"urn:btih:f1e2f59c6d51a63ae3e4306739c411a2c76fbf42","amp;dn":"Beach+House+-+Bloom+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1e2f59c6d51a63ae3e4306739c411a2c76fbf42","infoHashBuffer":{"type":"Buffer","data":[241,226,245,156,109,81,166,58,227,228,48,103,57,196,17,162,199,111,191,66]},"announce":[],"urlList":[]}}