{"title":"Warhammer - Dwarf Love - Tribute to UNDEAD","uid":8470511,"size":1329262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f250432840738c58c77767515b8bbe9e76dacf0a&amp;dn=Warhammer+-+Dwarf+Love+-+Tribute+to+UNDEAD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Archolm","files":1,"time":1368471702,"description":"My second release! A trilogy of Dwarf Stories, Honourkeeper, Oathbreaker and Grudgebearer. A collection of stories that no dwarf lover should be without!\n\nThis is a tribute to UNDEAD, many thanks for your uploads at Demonoid, keeping money from the money hungry scumbags over at Black Library. \n\nAll files are in epub and cleaned in Calibre.\n\nLet me know what you think and ill upload more from my personal library.\n\nPeace, and keep the scene alive!\n\nHonourkeeper:\nIn the ancient days of the Old World, long before the time of men, the dwarfs and elves are at the height of their prosperity. As King Bagrik of the dwarfs and Prince Ithalred of the elves forge a trade pact, a vast horde of northmen attacks the elf settlement. When King Bagrik's son is slain, the dwarfs join forces with the elves, eager for vengeance. Can the dwarfs and the elves put aside their differences long enough to prevail over foe?\n\nOathbreaker:\nIn the bleak mountains of the Warhammer Old World, the dwarf race fights a bitter battle for survival against its ancient enemies. When the hold Karak Varn is overrun by skaven ratmen, Dwarf Thane Uthor makes a rash vow to the enormity of such a task.\n\nHow can this band of dwarfs, brave and stalwart as they are, ever hope to triumph against such impossible odds?\n\nGrudgebearer:\nIn an epic tale that spans centuries, Barundin battles his way through enemies on a desperate quest to avenge the wrongs against his father and save his people from a terrible war against the dark forces of Chaos.","torrent":{"xt":"urn:btih:f250432840738c58c77767515b8bbe9e76dacf0a","amp;dn":"Warhammer+-+Dwarf+Love+-+Tribute+to+UNDEAD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f250432840738c58c77767515b8bbe9e76dacf0a","infoHashBuffer":{"type":"Buffer","data":[242,80,67,40,64,115,140,88,199,119,103,81,91,139,190,158,118,218,207,10]},"announce":[],"urlList":[]}}