{"title":"[BlacksOnBlondes] Danica Dillon (Put That Cock In My Ass)","uid":8483126,"size":420157548,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f2fce700ed805845e5349b2d3c67245f68d8b0d3&amp;dn=%5BBlacksOnBlondes%5D+Danica+Dillon+%28Put+That+Cock+In+My+Ass%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":2,"time":1368786055,"description":"[BlacksOnBlondes] Danica Dillon (Put That Cock In My Ass)\n\nThe romantic art of interracial ass reaming doesn't get any better than Danica Dillon's rectal rampage. Danica has tried getting white dicks hard but the white man's curse continues on. The only way to expand her bunghole would be with a black nightstick that doesn't deflate upon initial entry. The latest entry to club BlacksonBlondes is a sexually deprived white girl that's come to us in order to achieve the multiple orgasms that all our sluts barely live through. On her bed Danica finger-fucks all her holes until uber black meat slinger, Mr. Marcus, joins in on her fun and worships this white slut in a manner that's only fitting. After some hot and heavy foreplay Danica swallows his black bazooka until her stomach's contents nearly reach the surface. The gooey and wet pussy is next on the black cock hit list and Marcus goes balls deep on Danica's gaping gash. The sound of big black cock slamming against her naughty area is drowned out by Danica's teething grinding as a result of a black cock that's leveling her reproductive system. We could have had a pop shot at this point and call it a day. However, Danica begged that her asshole be filled to the rim with black cock and who were we to deny that request? Marcus drilled her asshole until his balls were resting comfortably against her slippery wet vulva. The anal blitzkrieg left Danica clinching at her bedsheets and her lungs nearly void of any oxygen. Our interracial anal invasion came to an end when Danica's face was frosted by black glaze\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=omsg9nap8as26h35nd54.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=omsg9nap8as26h35nd54.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=utfu7e0byjtky4lq5lhy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=utfu7e0byjtky4lq5lhy.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f2fce700ed805845e5349b2d3c67245f68d8b0d3","amp;dn":"%5BBlacksOnBlondes%5D+Danica+Dillon+%28Put+That+Cock+In+My+Ass%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2fce700ed805845e5349b2d3c67245f68d8b0d3","infoHashBuffer":{"type":"Buffer","data":[242,252,231,0,237,128,88,69,229,52,155,45,60,103,36,95,104,216,176,211]},"announce":[],"urlList":[]}}