{"title":"Evangeline (First Comics)","uid":8443483,"size":195086686,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f4fc481ad6a0036fcfeb1f2c94060646a8e1d506&amp;dn=Evangeline+%28First+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ichthypod_Crane","files":15,"time":1367834826,"description":"The FCUP series continues with 'Evangeline'. Wiki says:\n\nEvangeline is a 1980s comic book co-created and written initially by then-husband and wife team Chuck Dixon &amp; Judith Hunt, with pencils by Hunt inks by Ricardo Villagran. Letters were by cartoonist and letterer Ed J. King of the Star Wars comic strip.\n\nThe art for the first few issues of Evangeline were unusual for the time period, in that they were not printed using process color, but instead each page was hand-painted by Hunt and then color separated. This method was introduced by the newly formed independent comic companies and was encouraged by the cheaper printing methods of the 1980s. Cover paintings were also illustrated by Hunt and Villagran.\n\nThe title character has been described as &quot;a sexy killer vigilante nun&quot; taking her instructions directly from her mentor, Cardinal Szn, a politically powerful figure in the hierarchy of the Roman Curia/Vatican during the 23rd-century. However, co-creator Hunt would describe her skilled but naive feminist character as created &quot;to explore the infinite conflict between good and evil and the powerful religions which would be involved in manipulating the politics and economics of the future&quot;.\n\nTwo issues, Guns of Mars (loosely based on the spaghetti western film genre) and Hate Boat, were published by Comico Comics in 1984. An ownership dispute in 1985 led to Evangeline leaving Comico and then a 12-issue run from 1987 to 1989 published by First Comics. Hunt co-wrote and illustrated only the first few issues of the First Comics series, leaving to pursue her design and illustration licensing work for HA! Henson Associates and MacMillan Publishing on Raggedy Ann and Andy. In an interview with the Comics Buyer's Guide, Judith Hunt said that (after she left), &quot;The comic [Evangeline] lost its original complexity and feminist standpoint and became just another excuse for depictions of gratuitous sex and violence.&quot;\n\n\nEach of my First Comics uploads contains a .txt file called 'First Missing'. If you have ANY of the scans listed, please contact me at the listed email. I want to make these uploads as complete as possible. Thanks!\n\nProps to the creators and scanners! Get it and keep it alive!\n","torrent":{"xt":"urn:btih:f4fc481ad6a0036fcfeb1f2c94060646a8e1d506","amp;dn":"Evangeline+%28First+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4fc481ad6a0036fcfeb1f2c94060646a8e1d506","infoHashBuffer":{"type":"Buffer","data":[244,252,72,26,214,160,3,111,207,235,31,44,148,6,6,70,168,225,213,6]},"announce":[],"urlList":[]}}