{"title":"CENSORED! I am a timetraveller from 3010 - ATS Forum Backup Thre","uid":8372588,"size":4123199,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f6a535350fa4c3a02077afb84300e30102ec555f&amp;dn=CENSORED%21+I+am+a+timetraveller+from+3010+-+ATS+Forum+Backup+Thre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NWOFin","files":494,"time":1365958782,"description":"This torrent contains the backupfiles from an ATS Thread titled &quot;I am a timetraveller from 3010&quot; that was quickly removed after being made. Here is the first post:\n\nHello from Yorkshire in 3010, well what was Yorkshire UK. \n\nYou see my name is Betty and i am what you would call a time bender. If you do not believe me, several others of us will be arriving in person in your capitals and public over the coming months, as April of 2013 in your timeline was the year in which it was first made public about the technology. \n\nI will briefly explain, in 2049, a scientist named George Hyman from Manchester UK invents the first time machine, but the only issue with it is it can only go back to 2013. \nThere are of course, in our time frame devices that can go back much futher, but they are kept by military and officials, none of the public have access to them. \n\nI would like to first of all tell you that a big event is happening later on in this year, a large fault plate in the earth core will trigger a series of large earthquakes and following tsunamis, over the coming years roughly a half of the worlds population will sadly perish. \nI am here in the same was as you may wish you could go back in time to warn people about september 11, think of how many people would laugh you off and tell you they do not believe you. \nSadly, i just want to warn people that the safe places on earth willl be Europe and Asia. \nAustralia will no longer exist in ten years from now. \nJapan will be under water in 3 years from now. \n\nAs we have been given permission to visit, there will be several of us who will be visiting your time frame in person, we can show you our technology as proof of our time frame, however we are not allowed to change the events which are going to happen. \n\nI will be on this website for roughly 3 months and then i must return. \n\nI know when i return to my time frame, most of you will no longer be here, and i weep, but do not fear because in about 15 years from now, your world is bettered by the first contact with extra terrestrials who will stop the warming of the planet, and fix many problems on earth. \n\nThe future is better, my message to you all is please hold on as there IS light at the end of the tunnel","torrent":{"xt":"urn:btih:f6a535350fa4c3a02077afb84300e30102ec555f","amp;dn":"CENSORED%21+I+am+a+timetraveller+from+3010+-+ATS+Forum+Backup+Thre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a535350fa4c3a02077afb84300e30102ec555f","infoHashBuffer":{"type":"Buffer","data":[246,165,53,53,15,164,195,160,32,119,175,184,67,0,227,1,2,236,85,95]},"announce":[],"urlList":[]}}