{"title":"Knowing Too Much: Why the American Jewish Romance with Israel I","uid":8441812,"size":1872753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f83800b4df5f607ec50180418f5404d973785d40&amp;dn=+Knowing+Too+Much%3A+Why+the+American+Jewish+Romance+with+Israel+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"baboo456","files":1,"time":1367789720,"description":"Traditionally, American Jews have been broadly liberal in their political outlook; indeed African-Americans are the only ethnic group more likely to vote Democratic in US elections. Over the past half century, however, attitudes on one topic have stood in sharp contrast to this group's generally progressive stance: support for Israel. Despite Israel's record of militarism, illegal settlements and human rights violations, American Jews have, stretching back to the 1960s, remained largely steadfast supporters of the Jewish &quot;homeland.&quot; But, as Norman Finkelstein explains in an elegantly-argued and richly-textured new book, this is now beginning to change. Reports by Human Rights Watch, Amnesty International and the United Nations, and books by commentators as prominent as President Jimmy Carter and as well-respected in the scholarly community as Stephen Walt, John Mearsheimer and Peter Beinart, have increasingly pinpointed the fundamental illiberalism of the Israeli state. In the light of these exposes, the support of America Jews for Israel has begun to fray. This erosion has been particularly marked among younger members of the community. A 2010 Brandeis University poll found that only about one quarter of Jews aged under 40 today feel &quot;very much&quot; connected to Israel. In successive chapters that combine Finkelstein's customary meticulous research with polemical brio, Knowing Too Much sets the work of defenders of Israel such as Jeffrey Goldberg, Michael Oren, Dennis Ross and Benny Morris against the historical record, showing their claims to be increasingly tendentious. As growing numbers of American Jews come to see the speciousness of the arguments behind such apologias and recognize Israel's record as simply indefensible, Finkelstein points to the opening of new possibilities for political advancement in a region that for decades has been stuck fast in a gridlock of injustice and suffering.","torrent":{"xt":"urn:btih:f83800b4df5f607ec50180418f5404d973785d40","amp;dn":"+Knowing+Too+Much%3A+Why+the+American+Jewish+Romance+with+Israel+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f83800b4df5f607ec50180418f5404d973785d40","infoHashBuffer":{"type":"Buffer","data":[248,56,0,180,223,95,96,126,197,1,128,65,143,84,4,217,115,120,93,64]},"announce":[],"urlList":[]}}