{"title":"20130425-Stossel-[Free Market Medicine]-Fox Business.CF.avi","uid":8416091,"size":278727944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f94ebab43c98f2b6d63bcc6c12fa0fe79a7e6455&amp;dn=20130425-Stossel-%5BFree+Market+Medicine%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1367044237,"description":"----------\n\nSTOSSEL - [Free Market Medicine] - Fox Business Network\n2013, April 25, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nObamacare promises to cover the uninsured, and somehow... lower costs. How can it do both?\n\nWyoming senator, and licensed orthopedic surgeon, John Barrasso, explains that Obamacare is incredibly complicated.\n\nPediatrician Steve Auerbach says ObamaCare doesn't go far enough... and America needs more government control. He debates orthopedic surgeon Lee Hieb who says free market medicine would be much better.\n\nCongressman Ted Poe, R-Texas, shows me the government's gigantic book of medical codes. Medical code W6161XA means a patient has been bitten by a duck. But W6162XA means a patient has been STRUCK by a duck. Doctors must use these codes when billing insurance companies and Medicare. Next year, they will have to use a new code book that's 10 times bigger.\n\nNot all health care is dominated by government and other third-party deciders. Special correspondent, Kennedy, visited a cosmetic dermatologist and a Lasik eye surgeon. In those specialties, prices stay lower because patients pay for their own care. They shop around. Doctors work hard to win their business.\n\nCan we bring free market medicine back to more important procedures...like heart surgery? Dr. Keith Smith says we can. He founded a Surgery Center in Oklahoma where doctors rarely deal with insurance. Prices are much lower..and listed on their website.\n\nEven my dog, Luca, is threatened by government rules.\n\nBureaucrats ordered veterinarian Ron Hines to stop giving online advice. His volunteer lawyer from the Institute for Justice, Jeff Rowes, took up the case... so Ron can help pets again.","torrent":{"xt":"urn:btih:f94ebab43c98f2b6d63bcc6c12fa0fe79a7e6455","amp;dn":"20130425-Stossel-%5BFree+Market+Medicine%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94ebab43c98f2b6d63bcc6c12fa0fe79a7e6455","infoHashBuffer":{"type":"Buffer","data":[249,78,186,180,60,152,242,182,214,59,204,108,18,250,15,231,154,126,100,85]},"announce":[],"urlList":[]}}