{"title":"Coast to Coast AM May 08, 2013 - UFOs, ETs, and abductions","uid":8460956,"size":56112871,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fc73376932ecd77f9fa6c0f06b15e51987a76257&amp;dn=Coast+to+Coast+AM+May+08%2C+2013+-+UFOs%2C+ETs%2C+and+abductions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1368230160,"description":"Coast to Coast AM for May 08, 2013.  UFOs, ETs, and Abductions\nNote: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nRetired psychology professor from McGill University, \nDon Donderi,\nhas spent the last 50 years studying evidence for UFOs, ETs and abductions. He discussed some of the copious evidence for these phenomena, which he believes should not be dismissed by mainstream science, yet typically is. He's concluded that a percentage of UFOs are extraterrestrial vehicles, even though the website of the US Air Force denies this. The governments of such countries as Chile, Brazil, France, and Belgium have provided UFO information to the public,\nand are neutral as to the origin of UFOs, he pointed out. As to how such craft might travel to Earth, Donderi cited the work of a NASA engineer, Paul R.\nHill, who in his posthumously published book, Unconventional Flying Objects, posited that ET craft have the ability to modify gravity. \n\nUFOs have been described in a multitude of shapes and sizes, from small craft to huge objects, bigger and wider than a football field. With such a variety of craft reported over the years, one might infer that they come from different places, and have different operating specs, he noted. One well-researched, but little-known case involved the sighting of a giant spherical UFO seen by about 31 witnesses over the Yukon Territory in Canada in 1996. Donderi is\nparticularly intrigued by the sightings of these kind of gigantic craft, which also occurred in Stephenville, Texas in 2008, over the Taconic Parkway in 1986, over Belgium in 1989, and the Phoenix Lights in 1997. \n\nAs far as the reason behind their visitations, Donderi suggested it has to do with surveillance. &quot;It's like what we do when we're trying to learn more about nature,&quot; he remarked. Further, the probable &quot;catch and release&quot; of humans by ET crews has been established by a number of incidents involving reliable witnesses and investigators, such as the Betty and Barney Hill case, he stated. Donderi believes at least in the &quot;front line,&quot; we are dealing with humanoid\nintelligent beings, rather than some type of robotic creations. \n\nExtinctions &amp; Survival\n\nFirst hour guest, science/culture journalist \nAnnalee Newitz\n talked about how humans will adapt and survive a mass extinction event. Such extinction events, which she classified as wiping out 75% of the Earth's species, have happened at least 5 times in our planet's history, and have been brought on by climate changes, she said. Yet, these extinctions occurred gradually over a million years time. Shorter term events like the eruption of a supervolcano would pump a lot of toxic gases into the atmosphere, leading to a cold period or a small ice age, followed by global warming. Animals and plants can't deal with rapid changes in temperature, but humans are equipped to adapt to various situations, such as by building underground facilities, she noted. Still, the global civilization needs to get better prepared for various catastrophic events that have occurred in Earth's past, she admonished. \n\nNews segment guests: \nWilliam Thomas,\nRobert Zubrin\n\nWebsite(s):\n techsploitation.com\n io9.com\n ufoets.com\nBook(s):\n UFOs, ETs, and Alien Abductions\n Scatter, Adapt, and Remember: How Humans Will Survive a Mass Extinction\n","torrent":{"xt":"urn:btih:fc73376932ecd77f9fa6c0f06b15e51987a76257","amp;dn":"Coast+to+Coast+AM+May+08%2C+2013+-+UFOs%2C+ETs%2C+and+abductions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc73376932ecd77f9fa6c0f06b15e51987a76257","infoHashBuffer":{"type":"Buffer","data":[252,115,55,105,50,236,215,127,159,166,192,240,107,21,229,25,135,167,98,87]},"announce":[],"urlList":[]}}