{"title":"102 London Night issues (1993-1999) RAZOR UNCUT, SHEENA, etc.","uid":8332688,"size":1472402997,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fcf94180088eee904b0799d4d4093337d35572df&amp;dn=102+London+Night+issues+%281993-1999%29+RAZOR+UNCUT%2C+SHEENA%2C+etc.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1364917587,"description":"I still can't refer to old comments, but someone was requesting RAZOR from Everette Hartsoe's London Night. I found an old torrent that had a (probably) complete set of London Night comics, but unfortunately only 95.7% of it was available, which means this is missing a couple dozen comics... but hey, beats nothing.\n\nSmack dab in the middle of the 1990s collecting crazes (Wizard magazine bullshit hype, bad girls, nude covers and even chromium covers), London Night put out some fairly good black and white indy titles (and later, Razor and Stryke/Strike were relaunched in full-color).\n\nRazor, like the Crow, Faust, and others, is basically an urban vigilante with two giant gauntlet blades which she uses to kill criminals. There's a grab bag of other titles here, too, like SHEENA QUEEN OF THE JUNGLE, FANGS OF THE WIDOW, ULTIMATE STRIKE, DREAM WOLVES (which I'm not even sure is London Night) and so forth, but it's mostly Razor -- over 60 issues of her comics.\n\nAll credit goes to the original scanners (including johnny2eyes-DCP, FoxMuld38, and Clasher) and to the original uploader! Please seed and share with our friends here on TPB!  --STFmaryville\n\n------\n\nFrom Comic Vine (which, by the way, has a shitty new layout!):\n\nLaunched in 1992 with the second issue of RAZOR, Everette Hartsoe decided to tackle publishing on his own terms to become one of comics' premier indy publishers! William Tucci, David Mack, Ed McGuiness, Steve Scott, Eric Powell and many more got their start with London Nights Studios.  \n \nThe first appearances of SHI and KABUKI also grace the pages of London Nights Studio books and over 5 million comics were published worldwide between 1991 and 1999. \n \nJ.M. Linsner, a friend of Hartsoe, did covers for several London Nights Studio issues and has voiced his support for a fellow independent self-publisher in a market dominated by the major publishing houses.","torrent":{"xt":"urn:btih:fcf94180088eee904b0799d4d4093337d35572df","amp;dn":"102+London+Night+issues+%281993-1999%29+RAZOR+UNCUT%2C+SHEENA%2C+etc.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcf94180088eee904b0799d4d4093337d35572df","infoHashBuffer":{"type":"Buffer","data":[252,249,65,128,8,142,238,144,75,7,153,212,212,9,51,55,211,85,114,223]},"announce":[],"urlList":[]}}