{"title":"Jack The Giant Slayer 2013 CAMRip XviD READNFO-INFERNO","uid":8269927,"size":1312375232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe56e797313d6f0ce788730f5cea5354ae2562c9&amp;dn=Jack+The+Giant+Slayer+2013+CAMRip+XviD+READNFO-INFERNO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barms236","files":6,"time":1363595101,"description":"Plot: The ancient war between humans and a race of giants is reignited when Jack, a young farmhand fighting for a kingdom and the love of a princess, opens a gateway between the two worlds.\n\nGenre: Adventure | Drama | Fantasy\nIMDB Rating: 6.6/10 from 6,959 users Metascore: 51/100\nDirected by: Bryan Singer\nStarring: Nicholas Hoult, Stanley Tucci, Ewan McGregor\n\nRelease Name: Jack.the.Giant.Slayer.2013.CAMRip.XviD.READNFO-INFERNO\nSize: 1.16 GiB\nVideo: AVI | 624Ã—320 | 1 478 Kbps\nAudio: English | MP3 | 128 Kbps\nRuntime: 1h 43mn\n\nSOURCE: HustleHard/NOGRP THANKS :bow:\nNOT A GREAT SOURCE WITH LOTS OF MOVEMENT,OUT OF FOCUS,NOISE IN THE VID,OFF CENTER BORDERS,BLABLABLA ETC BUT IT IS PROPER ( FULL ) FROM BEGINNING TO END WITH ENGLISH AUDIO SO SOMETHING IS BETTER THEN NOTHING!\nWORK DONE: WELL DID A COUPLE VERSION AND CHOOSE THIS FOR OUR V1 SO TO SPEAK SO THAT MEANS WE MIGHT DO/PICK A V2...\nFIRST CONVERTED TO AVI AND MP3 AND DROPPED THE FILE IN VDUB WHERE WE ROATED BY 1,200 USING THE BICUBIC FILTER AND THEN USED A CENTER AND BORDER FILTER AND PULLED THE RIGHT SIDE TO THE LEFT TO TRY AND CENTER THE VID A BIT MORE!\nCROPPED,CROPPED A BIT MORE AND CROPPED AGAIN( TOP 34,YOUR LEFT48,RIGHT BY 10 AND BOTTOM BY 32) TILL WE COULDN'T CROP ANYMORE WITHOUT LOSING THE WHOLE PICTURE LOL AND THEN RESIZED AND ADDED A DENOISER.\nADDED SOME INT AS WELL AS A LITTLE SAT AND A TINY TINY BIT OF BRIGHTNESS.\nNEXT ADDED THE WARP SHARP FILTER TO TRY TO BRING THE FACES OUT A LITTLE MORE IN THE DARK PARTS AND LAST ADDED A MOTION FILTER TO TRY AND REMOVE SOME OF THE FLICKER CAUSE AS MOST KNOW BY USING THE DEFLICKER WILL SOMETIMES LEAVE A GHOSTING EFFECT AS WELL AS SOME SPOTTY GLITCHES SO TO SPEAK:wink:\n\nWE CUT THE FIRST 40 SECONDS OFF THE INTRO CAUSE IT WAS JUST A INTRO WITH NOTHING BUT MOVEMENT AND THE CAMMER &quot;TRYING&quot; TO GET CENTERED :)\n\n4 SAMPLES INCLUDED SO PLEASE CHECK THEM BEFORE YOU DECIDE IF YOU WANNA DOWNLOAD THIS OR NOT AS SOME PARTS LOOKS BETTER THEN OTHERS AND YES YOU HAVE BEEN WARNED!!!\n\nAUDIO UNTOUCHED OTHER THEN CONVERTED TO MP3 AND YES YOU HERE THE GUY BREATHING!!!\n\nSTILL HAS SOME NOISE AND A SLIGHT PULSE WITH SOME MOVEMENT AND A FEW BORDERS SO ITS A BIT BETTER IMO AND NOT GREAT BUT WE DID WHAT WE COULD FOR YA!\nCOULD HAVE DARKENED IT UP TO REMOVE MORE NOISE LOL BUT THEN THERE WOULD BE NO DEATAIL!!!\nPLEASE REALIZE YOU CAN ONLY POLISH A TURD SO MUCH...\n\n\n\n\n\n\n\n\n\n\n\nenjoy this inferno release! greetz - killabeats","torrent":{"xt":"urn:btih:fe56e797313d6f0ce788730f5cea5354ae2562c9","amp;dn":"Jack+The+Giant+Slayer+2013+CAMRip+XviD+READNFO-INFERNO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe56e797313d6f0ce788730f5cea5354ae2562c9","infoHashBuffer":{"type":"Buffer","data":[254,86,231,151,49,61,111,12,231,136,115,15,92,234,83,84,174,37,98,201]},"announce":[],"urlList":[]}}